{"pillars": ["Generation", "Prevention", "Detection", "Recovery/Mitigation", "Analysis/Learning"], "papers": [{"BibKey": "tran2023uit", "Title": "UIT-ADrone: A Novel Drone Dataset for Traffic Anomaly Detection", "Abstract": "Anomaly detection plays an increasingly important role in video surveillance and is one of the issues that have attracted various communities, such as computer vision, machine learning, and data mining in recent years. Moreover, drones equipped with cameras have quickly been deployed to a wide range of applications, starting from border security applications to street monitoring systems. However, there is a notable lack of adequate drone-based datasets available to detect unusual events in the urban traffic environment, especially in roundabouts, due to the density of interaction between road users and vehicles. To promote the development of anomalous event detection with drones in the complex traffic environment, we construct a novel large-scale drone dataset to detect anomalies involving realistic roundabouts in Vietnam, covering a large variety of anomalous events. Traffic at a total of three different roundabouts in Ho Chi Minh City was recorded with a camera-equipped drone. The resulting dataset contains 51 videos with total data traffic of nearly 6.5 h, captured across 206K frames with ten abnormal event types. Based on this dataset, we comprehensively evaluate the current state-of-the-art algorithms and what anomaly detection can do in drone-based video surveillance. This study presents a detailed description of the proposed UIT-ADrone dataset, along with information regarding data distribution, protocols for evaluation, baseline experimental results on our dataset, and other benchmark datasets, discussions, and paves the way for future work.", "Authors": "Tran, T.M.; Vu, T.N.; Nguyen, T.V.; Nguyen, K.", "Year": "2023", "Venue/Publisher": "IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing", "DOI_or_URL": "https://doi.org/10.1109/JSTARS.2023.3285905", "VerificationStatus": "Verified", "Pillar": "Generation", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Urban traffic anomaly events in drone footage", "DetectionApproach": "DL", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Dataset creation and baseline anomaly detection evaluation on drone traffic videos", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "–", "KeyFindings": "Introduces a large-scale drone video dataset focused on urban traffic rule violations and abnormal events in dense roundabout settings; supports further anomaly detection research", "Limitations": "Lacks unified detection/recovery framework; dataset use is limited to specific urban traffic scenes", "DatasetAvailable": "Yes", "Remarks": "Important benchmark dataset for drone-based anomaly detection in urban traffic scenarios", "BibTeX": "@article{tran2023uit,\n  title={UIT-ADrone: A novel drone dataset for traffic anomaly detection},\n  author={Tran, Tung Minh and Vu, Tu N and Nguyen, Tam V and Nguyen, Khang},\n  journal={IEEE Journal of Selected Topics in Applied Earth Observations and Remote Sensing},\n  volume={16},\n  pages={5590--5601},\n  year={2023},\n  publisher={IEEE}\n}"}, {"BibKey": "ahn2019learning", "Title": "Learning-Based Anomaly Detection and Monitoring for Swarm Drone Flights", "Abstract": "This paper addresses anomaly detection and monitoring for swarm drone flights. While the current practice of swarm flight typically relies on the operator’s naked eyes to monitor health of the multiple vehicles, this work proposes a machine learning-based framework to enable detection of abnormal behavior of a large number of flying drones on the fly. The method works in two steps: a sequence of two unsupervised learning procedures reduces the dimensionality of the real flight test data and labels them as normal and abnormal cases; then, a deep neural network classifier with one-dimensional convolution layers followed by fully connected multi-layer perceptron extracts the associated features and distinguishes the anomaly from normal conditions. The proposed anomaly detection scheme is validated on the real flight test data, highlighting its capability of online implementation.", "Authors": "Ahn, Hyojung; Choi, Han-Lim; Kang, Minguk; Moon, SungTae", "Year": "2019", "Venue/Publisher": "Applied Sciences (MDPI)", "DOI_or_URL": "https://doi.org/10.3390/app9245477", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "Swarm behavioral anomalies (multi-UAV)", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "1D-CNN classifier with clustering-based feature learning", "DataSource": "Real-World Flight Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Accuracy, false positive rate", "KeyFindings": "Proposes a data-driven framework for detecting anomalies in swarm missions using unsupervised clustering and CNN classifier; validated on real flight data", "Limitations": "Focuses on swarm behavior rather than actuator or sensor faults; recovery logic not addressed", "DatasetAvailable": "No", "Remarks": "Valuable Detection-pillar study demonstrating scalable swarm-anomaly recognition", "BibTeX": "@article{ahn2019learning,\n  title={Learning-based anomaly detection and monitoring for swarm drone flights},\n  author={Ahn, Hyojung and Choi, Han-Lim and Kang, Minguk and Moon, SungTae},\n  journal={Applied Sciences},\n  volume={9},\n  number={24},\n  pages={5477},\n  year={2019},\n  publisher={MDPI}\n}"}, {"BibKey": "alzahrani2024enhancing", "Title": "Enhancing Drone Security Through Multi-Sensor Anomaly Detection and Machine Learning", "Abstract": "Unmanned Aerial Vehicles (UAVs), commonly referred to as drones, have determined numerous applications across industries, ranging from aerial surveillance to package shipping. As drones are used in vital operations, ensuring cyberattacks and anomalies protect them from attackers is now a big challenge. This research study presents a complete approach to enhancing drone safety by integrating multi-sensor anomaly detection and superior machine learning techniques. The proposed methodology capitalizes on the rich sensor suite embedded in present-day drones, encompassing GPS receivers, accelerometers, gyroscopes, cameras, communication modules, and more. Leveraging an array of sensors in drones, our technique detects abnormal drone behavior indicative of unauthorized access, GPS spoofing, communication jamming, and malicious activities. By extracting features from sensor records, we develop a robust anomaly detection framework using the “uav attack dataset” able to identify deviations from normal flight patterns, communication signals, and environmental interactions. Central to our methodology is the utilization of machine learning algorithms. These algorithms are skilled on labeled datasets containing numerous flight eventualities, each normal and hostile, together with the ones discovered inside the “uav attack dataset”. The obtained results are eventually evaluated using rigorous performance metrics to quantify their effectiveness in distinguishing genuine anomalies from benign variations. The findings of our study underscore the capacity of multi-sensor anomaly detection for drones. By harnessing the power of machine learning and sensor fusion, we exhibit the ability to hit upon attacks at an early level, mitigating capability harm and permitting rapid responses. This study contributes now not only to the field of drone safety but also to the broader panorama of self-sustaining systems protection, highlighting the importance of adaptive and proactive protection mechanisms. Results show that an accuracy of 99% with AUC of 100$ was achieved when all the sensors were used.", "Authors": "Alzahrani, M.Y.", "Year": "2024", "Venue/Publisher": "SN Computer Science (Vol.5, Article651)", "DOI_or_URL": "https://doi.org/10.1007/s42979-024-02983-2", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Multi-sensor security anomalies (spoofing, jamming, unauthorized access)", "DetectionApproach": "ML", "Technique": "Hybrid Approaches", "Technique_Detailed": "Multi-sensor fusion with ML classifiers (Random Forest, SVM)", "DataSource": "Real-World Flight Data", "ApplicationContext": "Military", "EvaluationMetrics": "Accuracy, AUC, detection latency", "KeyFindings": "Proposes ML-based fusion of GPS, IMU, gyro, and communication signals for UAV security; achieves >99% accuracy", "Limitations": "Relies on labeled UAV-Attack dataset; onboard latency and power analysis not discussed", "DatasetAvailable": "Yes", "Remarks": "Useful Detection-pillar reference for multi-sensor UAV security", "BibTeX": "@article{alzahrani2024enhancing,\n  title={Enhancing drone security through multi-sensor anomaly detection and machine learning},\n  author={Alzahrani, Mohammed Y},\n  journal={SN Computer Science},\n  volume={5},\n  number={5},\n  pages={651},\n  year={2024},\n  publisher={Springer}\n}"}, {"BibKey": "ghazali2022investigation", "Title": "An Investigation of the Reliability of Different Types of Sensors in the Real-Time Vibration-Based Anomaly Inspection in Drone", "Abstract": "Early drone anomaly inspection is vital to ensure the drone’s safety and effectiveness. This process is often overlooked, especially by amateur drone pilots; however, some faulty conditions are difficult to notice by the naked eye or discover, even though the drone inspection process has been conducted; therefore, a real-time early drone inspection approach based on vibration data is proposed in this study. Firstly, the reliability of several microelectromechanical systems (MEMS) sensors, namely the ADXL335 accelerometer, ADXL 345 accelerometer, ADXL377 accelerometer, and SW420 vibration sensor in detecting faulty conditions, were tested and compared. The experimental results demonstrated that the vibration parameter measured using ADXL335 and ADXL345 accelerometers are the best choice as most of the faulty conditions can be detected, in contrast to other MEMS sensors. The output produced from the anomaly inspection algorithm is then converted to the “Healthy” or “Faulty” state, which is displayed in a mobile application for easy monitoring.", "Authors": "Ghazali, M.H.M.; Rahiman, W.", "Year": "2022", "Venue/Publisher": "Sensors (MDPI)", "DOI_or_URL": "https://doi.org/10.3390/s22166015", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Vibration-based anomaly inspection for drone arms and propellers", "DetectionApproach": "Rule-Based", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Threshold-based vibration amplitude analysis using MEMS sensors", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Vibration amplitude consistency", "KeyFindings": "Evaluates and compares MEMS sensors for detecting drone structural faults via mobile monitoring app", "Limitations": "Focuses on pre-flight fault inspection; lacks ML or recovery features", "DatasetAvailable": "No", "Remarks": "Detection-pillar example bridging hardware sensing and maintenance inspection", "BibTeX": "@article{alzahrani2024enhancing,\n  title={Enhancing drone security through multi-sensor anomaly detection and machine learning},\n  author={Alzahrani, Mohammed Y},\n  journal={SN Computer Science},\n  volume={5},\n  number={5},\n  pages={651},\n  year={2024},\n  publisher={Springer}\n}"}, {"BibKey": "ahn2024deep", "Title": "Deep learning-based anomaly detection for individual drone vehicles performing swarm missions", "Abstract": "This study explores methods for the detection and identification of anomalous instances in individual drone vehicles when performing missions in a swarm formation. Conventional anomaly detection (AD) in unmanned aerial vehicle (UAV) clusters typically involves manual inspection, which is time and resource-inefficient, followed by machine learning techniques. In this study, a novel machine-learning-based framework was proposed for the automatic detection of anomalous individual drones within a swarm and the rapid identification of faulty channels. Considering the imbalance between normal and abnormal states when using real flight data, semi-supervised models were selected. Four models with one-dimensional (1D) convolutions were trained on normal data. These models were based on a variational autoencoder and three popular AD-specific models (AnoGAN, GANomaly, and Skip-GANomaly), and their performances considering several metrics were compared. Data preprocessing was performed according to various scaling methods, and the hyperparameters that affect the training process were determined through Bayesian optimization. After training, AD was performed using a two-step process. First, detection through binary classification was performed by generating a reconstruction of the testing data and thresholding the reconstruction error. After detection, if the data were determined to be abnormal, each of the 16 channels was ranked in terms of its probability of being the source of the anomaly. The proposed scheme for detecting anomalies was tested and verified using real-world flight data, and analysis of the results revealed the major types of faults and identified specific abnormal channels. This has implications on future research of implementing necessary responses to abnormal readings to maintain UAV autonomy.", "Authors": "Ahn, Hyojung; Chung, Sonia", "Year": "2024", "Venue/Publisher": "Expert Systems with Applications (Vol 244)", "DOI_or_URL": "https://doi.org/10.1016/j.eswa.2023.122869", "VerificationStatus": "Verified", "Pillar": "Prevention", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Swarm behavioral anomalies (multi-UAV)", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "1D-CNN classifier with clustering-based feature learning", "DataSource": "Real-World Flight Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Accuracy, false positive rate", "KeyFindings": "Proposes a data-driven framework for detecting anomalies in swarm missions using unsupervised clustering and CNN classifier; validated on real flight data", "Limitations": "Focuses on swarm behavior rather than actuator or sensor faults; recovery logic not addressed", "DatasetAvailable": "No", "Remarks": "Valuable Detection-pillar study demonstrating scalable swarm-anomaly recognition", "BibTeX": "@article{ahn2024deep,\n  title={Deep learning-based anomaly detection for individual drone vehicles performing swarm missions},\n  author={Ahn, Hyojung and Chung, Sonia},\n  journal={Expert Systems with Applications},\n  volume={244},\n  pages={122869},\n  year={2024},\n  publisher={Elsevier}\n}"}, {"BibKey": "akram2024dronessl", "Title": "DroneSSL: Self-Supervised Multimodal Anomaly Detection in Internet of Drone Things", "Abstract": "In this study, we introduce a pioneering framework, DroneSSL, that integrates the concept of spatial crowdsourcing with TinyML to enhance anomaly detection in the Internet of Drone Things (IoDT). This innovative approach leverages drones and unmanned ground vehicles (UGVs) for expansive data collection in environments that are typically inaccessible or hazardous, such as during Australian bushfire incidents. By employing lightweight machine learning models alongside advanced communication technologies, DroneSSL transcends traditional spatial-temporal data analysis methods. It efficiently processes multimodal data from diverse Points-of-Interest (PoIs), significantly improving the quality and speed of data collection and analysis. The framework’s integration of a temporal feature extraction module with a Graph Neural Network (GNN) and its adaptable, scalable GNN architecture tailor DroneSSL for real-time operations in resource-constrained IoDT environments. Achieving an 89.6% F1 score, DroneSSL marks a substantial 4.9% improvement over existing approaches, highlighting its effectiveness in critical applications such as environmental surveillance and emergency response. This advancement not only showcases the potential of combining TinyML with spatial crowdsourcing for IoDT but also sets a new standard for efficient, scalable anomaly detection, paving the way for future innovations in IoT edge devices and environmental monitoring systems.", "Authors": "Akram, Junaid; Anaissi, Ali", "Year": "2024", "Venue/Publisher": "IEEE Transactions on Consumer Electronics (Vol.70, No.1, pp.4287-4298)", "DOI_or_URL": "https://doi.org/10.1109/TCE.2024.3376440", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Multimodal IoDT sensor and network anomalies", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "Self-supervised deep learning on multimodal telemetry and network data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "AUC, accuracy, latency", "KeyFindings": "Introduces a self-supervised multimodal anomaly detection framework for Internet-of-Drone-Things (IoDT); combines TinyML and cross-sensor fusion", "Limitations": "Focuses only on detection; lacks cross-platform validation and recovery strategy", "DatasetAvailable": "No", "Remarks": "Modern Detection-pillar work integrating self-supervised learning and IoDT context", "BibTeX": "@article{akram2024dronessl,\n  title={Dronessl: Self-supervised multimodal anomaly detection in internet of drone things},\n  author={Akram, Junaid and Anaissi, Ali and Othman, Wajdy and Alabdulatif, Abdulatif and Akram, Awais},\n  journal={IEEE Transactions on Consumer Electronics},\n  volume={70},\n  number={1},\n  pages={4287--4298},\n  year={2024},\n  publisher={IEEE}\n}"}, {"BibKey": "henrio2018anomaly", "Title": "Anomaly Detection in Videos Recorded by Drones in a Surveillance Context", "Abstract": "Automatic anomaly detection is an important difficulty in various domains such as surveillance, medicine and industry. Current surveillance systems generally use fixed-position cameras that cannot track anomalies. By virtue of recent industrial developments, drones are increasingly employed in various domains. They can also be employed for surveillance as moving cameras. Nevertheless, the recent literature lacks contributions describing anomaly detection in videos recorded by drones or for those with dynamic backgrounds. This paper presents specific examination of anomaly detection on the mini-drone video dataset which consists of surveillance videos recorded by a drone. The suggested anomaly detector is a deep neural network composed of a convolutional neural network and a recurrent neural network, trained using supervised learning. Experiments were conducted on both the mini-drone video dataset and the more popular UMN dataset. Although our model achieves state-of-the-art results on the UMN dataset, it is less data-efficient. However, the main goal of this study is to promote research efforts to resolve the difficulty of anomaly detection in videos with dynamic background and to provide first baseline results for additional contributions on the mini-drone video dataset.", "Authors": "Henrio, Jordan; Nakashima, Tomoharu", "Year": "2018", "Venue/Publisher": "IEEE International Conference on Systems, Man, and Cybernetics (SMC) – 2018: 2503-2508", "DOI_or_URL": "https://doi.org/10.1109/SMC.2018.00429", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Abnormal human/vehicle behaviours in aerial drone-surveillance videos", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "CNN + RNN hybrid for anomaly detection in mini-drone surveillance videos", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "AUC, accuracy, detection latency", "KeyFindings": "Presents an early DL-based framework for anomaly detection in aerial surveillance videos captured by drones; validated on a mini-drone video dataset", "Limitations": "Limited dataset scale; focused on proof-of-concept rather than full operational deployment", "DatasetAvailable": "No", "Remarks": "Pioneer Detection-pillar study for drone-video surveillance anomaly detection", "BibTeX": "@inproceedings{henrio2018anomaly,\n  title={Anomaly detection in videos recorded by drones in a surveillance context},\n  author={Henrio, Jordan and Nakashima, Tomoharu},\n  booktitle={2018 IEEE international conference on systems, man, and cybernetics (SMC)},\n  pages={2503--2508},\n  year={2018},\n  organization={IEEE}\n}"}, {"BibKey": "Shar2022DronLomaly", "Title": "DronLomaly: Runtime Detection of Anomalous Drone Behaviors via Log Analysis and Deep Learning", "Abstract": "Drones are increasingly popular and getting used in a variety of missions such as area surveillance, pipeline inspection, cinematography, etc. While the drone is conducting a mission, anomalies such as sensor fault, actuator fault, configuration errors, bugs in controller program, remote cyberattack, etc., may affect the drone’s physical stability and cause serious safety violations such as crashing into the public. During a flight mission, drones typically log flight status and state units such as GPS coordinates, actuator outputs, accelerator readings, gyroscopic readings, etc. These log data may reflect the abovementioned anomalies. In this paper, we propose a novel, deep learning-based log analysis approach for detecting anomalies in the drone log that could lead to physical instabilities. We train a LSTM-based deep learning model on the normal flight logs produced by a baseline drone. Essentially, the model learns the sequential patterns of flight state units and correlations among them. The model can then be used to detect anomalies in the state units as the log entries are being recorded by the drone’s control program at runtime. In our experiments, we built detection models based on several logs produced by 3 different drone control programs, namely DJI, ArduPilot and PX4, and used them to detect anomalies in the logs. On average, our approach achieves 0.968 recall and 0.963 precision, and it can detect anomalies during runtime within a few milliseconds.", "Authors": "SHAR, Lwin Khin; MINN, Wei; TA, Nguyen Binh Duong; FAN, Jianli; JIANG, Lingxiao; and LIM, Daniel Wai Kiat", "Year": "2022", "Venue/Publisher": "29th Asia-Pacific Software Engineering Conference (APSEC 2022), Springer", "DOI_or_URL": "https://doi.org/10.1109/APSEC57359.2022.00024", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Runtime log-level anomalies in UAV autopilot and control stack", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Bi-directional LSTM with sequence-to-sequence log modeling for anomaly prediction", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy, precision, recall, F1-score, detection latency", "KeyFindings": "Introduces DronLomaly, a runtime anomaly-detection framework using UAV log data and deep LSTM models to identify abnormal control behaviors in real time", "Limitations": "Dataset limited to specific DJI platform; focuses only on detection (no prevention/recovery pipeline)", "DatasetAvailable": "Yes", "Remarks": "Core Detection-pillar reference for software-level runtime anomaly detection in UAVs", "BibTeX": "@inproceedings{shar2022dronlomaly,\n  title={DronLomaly: Runtime detection of anomalous drone behaviors via log analysis and deep learning},\n  author={Shar, Lwin Khin and Minn, Wei and Ta, Nguyen Binh Duong and Fan, Jiani and Jiang, Lingxiao and Kiat, Daniel Lim Wai},\n  booktitle={2022 29th Asia-Pacific Software Engineering Conference (APSEC)},\n  pages={119--128},\n  year={2022},\n  organization={IEEE}\n}"}, {"BibKey": "sindhwani2020unsupervised", "Title": "Unsupervised Anomaly Detection for Self-Flying Delivery Drones", "Abstract": "We propose a novel anomaly detection framework for a fleet of hybrid aerial vehicles executing high-speed package pickup and delivery missions. The detection is based on machine learning models of normal flight profiles, trained on millions of flight log measurements of control inputs and sensor readings. We develop a new scalable algorithm for robust regression which can simultaneously fit predictive flight dynamics models while identifying and discarding abnormal flight missions from the training set. The resulting unsupervised estimator has a very high breakdown point and can withstand massive contamination of training data to uncover what normal flight patterns look like, without requiring any form of prior knowledge of aircraft aerodynamics or manual labeling of anomalies upfront. Across many different anomaly types, spanning simple 3sigma statistical thresholds to turbulence and other equipment anomalies, our models achieve high detection rates across the board. Our method consistently outperforms alternative robust detection methods on synthetic benchmark problems. To the best of our knowledge, dynamics modeling of hybrid delivery drones for anomaly detection at the scale of 100 million measurements from 5000 real flight missions in variable flight conditions is unprecedented.", "Authors": "Sindhwani, Vikas; Sidahmed, Hakim; Choromanski, Krzysztof; Jones, Brandon", "Year": "2020", "Venue/Publisher": "Google/Wing white-paper (preprint)", "DOI_or_URL": "https://doi.org/10.1109/ICRA40945.2020.9197074", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Hybrid aerial vehicle flight-dynamics anomalies", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "Robust regression + predictive flight-dynamics modeling on control inputs & sensor logs", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection rate, false positive rate, breakdown contamination resilience", "KeyFindings": "Introduces an unsupervised framework that models normal flight dynamics of delivery drones and detects deviations without labelled anomalies; uses millions of log measurements from thousands of delivery missions", "Limitations": "Focused on delivery-drone dynamics; not open dataset; no recovery strategy", "DatasetAvailable": "No", "Remarks": "Pioneering work for anomaly detection in delivery-UAV context", "BibTeX": "@inproceedings{sindhwani2020unsupervised,\n  title={Unsupervised anomaly detection for self-flying delivery drones},\n  author={Sindhwani, Vikas and Sidahmed, Hakim and Choromanski, Krzysztof and Jones, Brandon},\n  booktitle={2020 IEEE international conference on robotics and automation (ICRA)},\n  pages={186--192},\n  year={2020},\n  organization={IEEE}\n}"}, {"BibKey": "chen2024drone", "Title": "Drone Anomaly Detection: Dataset and Unsupervised Machine Learning", "Abstract": "As Internet of Things (IoT) devices, drones are among the most popular unmanned aerial vehicles (UAVs), equipped with multiple sensors, cameras, and communication systems. These components expose drones to many critical vulnerabilities, which raise the need to implement effective threat detection while operating them. This study investigates a wifi-based drone to comprehensively assess its vulnerabilities and develop anomaly detection mechanisms using different unsupervised and incremental supervised machine learning techniques. Two types of data were collected: benign data from legitimate actions and attack data comprising nine 9 distinct types of attacks, with an additional 5 sub-categories, totaling 14 types. Feature extraction and engineering were performed based on scripts from the Canadian Institute for Cybersecurity (CIC), which were modified to suit the specific needs of this work. The anomaly detector was formulated after comparing three unsupervised machine learning algorithms: Isolation Forest, Local Outlier Factor (LOF), and Elliptic Envelope, through extensive performance evaluations and analyses. In addition to evaluating these three algorithms, an incremental supervised ML model, specifically the adaptive random forest, was also explored. The study demonstrated the effectiveness of these algorithms in detecting anomalies and enhancing the security of drones. The findings also highlight the critical role of robust feature engineering and careful algorithm selection in developing a reliable anomaly detection system for UAVs.\n", "Authors": "Z Chen, I Traoré, M Mamun, S Saad", "Year": "2024", "Venue/Publisher": "International Symposium on Foundations and Practice of Security, 2024", "DOI_or_URL": "https://doi.org/10.1007/978-3-031-87499-4_12", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "WiFi-based drone anomaly detection via traffic & telemetry logs", "DetectionApproach": "ML", "Technique": "Machine Learning", "Technique_Detailed": "Unsupervised clustering and feature extraction on drone WiFi/PCAP datasets", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Anomaly detection rate, false positive rate", "KeyFindings": "Introduces a WiFi-drone dataset and unsupervised ML method for detecting anomalies in drone traffic and control logs", "Limitations": "Limited to one drone platform; only traffic/log anomalies rather than full flight-control faults", "DatasetAvailable": "Yes", "Remarks": "Dataset focuses on IoT WiFi-drone anomaly context", "BibTeX": "@inproceedings{chen2024drone,\n  title={Drone Anomaly Detection: Dataset and Unsupervised Machine Learning},\n  author={Chen, Zhuo and Traor{\\'e}, Issa and Mamun, Mohammad and Saad, Sherif},\n  booktitle={International Symposium on Foundations and Practice of Security},\n  pages={186--201},\n  year={2024},\n  organization={Springer}\n}"}, {"BibKey": "zhai2020smart", "Title": "Smart Autopilot Drone System for Surface Surveillance and Anomaly Detection via Customizable Deep Neural Network", "Abstract": "Copter-based unmanned aerial vehicle (drone) systems are being utilized for surveillance, inspection and security purposes for well sites, gathering centers, pipelines, refineries, and other surface facilities. However, most of the practices largely rely on humans, including drone operation, data transfer, image analysis, etc. In this paper, we present a comprehensive, cloud-enabled, human-free autopilot drone system and its application in field surveillance and anomaly detection powered by customizable deep neural network and computer vision models.\n\nThe proposed system consists of customized quadcopter drones equipped with high-definition cameras, thermal imaging and gas sensing devices, autopiloted by cloud-connected onboard computers. A series of advanced algorithms are developed and deployed onboard and over the Cloud for processing and diagnosing the image/thermal/gas sensing data collected by the drones in real-time or near real-time, including accurate 2D geospatial aerial mapping, anomaly detection and classification for events like oil leak, gas leak, facility failure, human activities, etc. Object detection deep learning models are customized and parallelized for low-profile multi-core single board computers.\n\nIn our case study, a pre-configured drone flew along the same path twice at a 6-month gap. A robust, iterative image registering algorithm is developed to precisely align and overlay images taken at different days at the same or similar GPS locations, even with significant changes to the environment due to season shift, human activities, camera angles or height variations. Local changes are filtered and selected based on their sizes and magnitudes in the residual images by subtracting pairs of perfectly overlaid scenes. Pre-trained Residual Convolutional Neural network (He et al. 2015) is rapidly re-trained to further classify the type of changes using the techniques of transfer learning and data augmentation. An ROC of 99% was achieved in the multi-task binary classification, wherein the detected changes are divided into positive anomalies (such as oil/gas leak, facility failures, unauthored human activities) and negative (natural/insignificant) signals. Comparing against a support vector machine baseline with a ROC=92%, the ResNet model demonstrates significant, more promising detection accuracy at a faster training time.\n\nThis innovative integrated platform is presented that combines physical drone, onboard imaging/sensing devices, cloud connectivity, onboard and back-end control system, deep learning and computer vision architecture for situational awareness of oil & gas fields and the mining industry. It achieves full automation of mass surveillance, data acquisition and storage, diagnostics and asset situational understanding. The system architecture, especially the onboard and cloud computation engines, can be readily transferred and applied to other common drone platforms.", "Authors": "Zhai, Xiang; Liu, Kui; Nash, William; Castineira, David", "Year": "2020", "Venue/Publisher": "International Petroleum Technology Conference (IPTC), Dhahran, Kingdom of Saudi Arabia", "DOI_or_URL": "https://doi.org/10.2523/IPTC-20111-MS", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Surface facility/asset anomalies (oil/gas leaks, human intrusion, equipment faults)", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "Customizable deep neural network (ResNet transfer learning) with cloud/on-board vision fusion", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "ROC/AUC (~0.99), accuracy, detection latency", "KeyFindings": "Proposes a cloud-enabled fully autonomous drone system for facility surveillance integrating onboard sensors (camera, thermal, gas) and deep learning for anomaly detection", "Limitations": "Focused on oil & gas industrial surveillance context; recovery or mitigation not covered", "DatasetAvailable": "Yes", "Remarks": "Demonstrates a full system (hardware + DNN + cloud) for real-time anomaly detection in drone-based surveillance", "BibTeX": "@inproceedings{zhai2020smart,\n  title={Smart autopilot drone system for surface surveillance and anomaly detection via customizable deep neural network},\n  author={Zhai, Xiang and Liu, Kui and Nash, William and Castineira, David},\n  booktitle={International petroleum technology conference},\n  pages={D021S053R001},\n  year={2020},\n  organization={IPTC}\n}"}, {"BibKey": "wang2019unsupervised", "Title": "Unsupervised anomaly detection with compact deep features for wind turbine blade images taken by a drone", "Abstract": "Detecting anomalies in wind turbine blades from aerial images taken by drones can reduce the costs of periodic inspections. Deep learning is useful for image recognition, but it requires large amounts of data to be collected on rare abnormalities. In this paper, we propose a method to distinguish normal and abnormal parts of a blade by combining one-class support vector machine, an unsupervised learning method, with deep features learned from a generic image dataset. The images taken by a drone are subsampled, projected to the feature space, and compressed by using principle component analysis (PCA) to make them learnable. Experiments show that features in the lower layers of deep nets are useful for detecting anomalies in blade images.\n", "Authors": "Wang, Yinan; Yoshihashi, Ryota; Kawakami, Rei; You, Shaodi; Harano, Tohru; Ito, Masahiko; Komagome, Katsura; Iida, Makoto; Naemura, Takeshi", "Year": "2019", "Venue/Publisher": "IPSJ Transactions on Computer Vision and Applications Vol.11:Article 3", "DOI_or_URL": "https://doi.org/10.1186/s41074-019-0056-0\n", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Anomalies (cracks/erosion) in wind turbine blades captured by UAV imagery", "DetectionApproach": "ML", "Technique": "Hybrid Approaches", "Technique_Detailed": "One-class SVM on PCA-compressed deep features extracted via pre-trained CNNs (Drone imagery)", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Precision, recall, F1-score (best ~0.555)", "KeyFindings": "Presents a drone-based wind-turbine blade inspection dataset and unsupervised ML method harnessing compact deep features from CNNs and OCSVM for defect detection", "Limitations": "Lack of large abnormal sample set; dataset restricted; no mitigation or recovery strategy provided", "DatasetAvailable": "Yes", "Remarks": "Useful dataset-and-unsupervised‐ML reference for aerial visual anomaly detection in infrastructure inspection", "BibTeX": "@article{wang2019unsupervised,\n  title={Unsupervised anomaly detection with compact deep features for wind turbine blade images taken by a drone},\n  author={Wang, Yinan and Yoshihashi, Ryota and Kawakami, Rei and You, Shaodi and Harano, Tohru and Ito, Masahiko and Komagome, Katsura and Iida, Makoto and Naemura, Takeshi},\n  journal={IPSJ Transactions on Computer Vision and Applications},\n  volume={11},\n  number={1},\n  pages={3},\n  year={2019},\n  publisher={Springer}\n}"}, {"BibKey": "silalahi2024severity", "Title": "Severity-Oriented Multiclass Drone Flight Logs Anomaly Detection", "Abstract": "The availability of log data recorded by computer-based systems such as operating system and network logs, makes it possible for the stakeholder to look after the system for monitoring, evaluation, and improvement purposes. If an incident happens to the system, the log is the first and most important artefact to recover so that investigations may be performed to gather an understanding of why such incidents may have occurred. Log-based anomaly detection is one of the common approaches to uncovering incident scenarios and finding the root cause of such incidents. In the context of drone flight, incidents reported in logs include errors during take-off, flight range issues, and cancellations of actions. Existing studies employ sequence anomaly detection to check whether an event during a drone flight is anomalous. It needs several preceding events and includes deciding if the following event is legitimate or malicious. However, one single log record can have no relationship to other log events and be malicious at the same time. Thus, several studies explored point anomaly detection, where one log record is the only feature needed. Dividing the anomalies into two categories can be overwhelming as the number of logs generated by a system is large. At the same time, it can be helpful to separate critical anomalies from the less severe ones. Therefore, this study proposes DroLoVe, a severity-oriented multiclass anomaly detection approach for drone flight log data. In accordance with the dataset characteristics, where the samples from different severity levels share common features, this paper employs a multitask-based label vector representation to train deep neural network models. After an extensive experiment on several baselines, the proposed scenario outperforms other models from existing studies with promising results. The proposed representation of the label improves the prediction confidence score on various encoder types with 8.6% and 1.8% from focal and cross-ent...", "Authors": "Silalahi, Swardiantara; Ahmad, Tohari; Studiawan, Hudan; Anthi, Eirini; Williams, Lowri", "Year": "2024", "Venue/Publisher": "IEEE Access (Vol.12, pp.64252-64266)", "DOI_or_URL": "https://doi.org/10.1109/ACCESS.2024.3396926", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Multiclass severity-level anomalies in drone flight logs", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Multitask label-vector representation + Transformer encoder on flight-log data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy, precision, recall, F1-score, confidence improvement (%)", "KeyFindings": "Introduces “DroLoVe” framework for severity-oriented multiclass anomaly detection on UAV flight logs; improves prediction confidence over standard loss functions by ~8.6% and ~1.8%. :contentReference[oaicite:2]{index=2}", "Limitations": "Dataset limited to specific log types; no recovery/mitigation pipeline included", "DatasetAvailable": "Yes", "Remarks": "Strong Detection-pillar work in log-based anomaly detection for UAVs", "BibTeX": "@article{silalahi2024severity,\n  title={Severity-oriented multiclass drone flight logs anomaly detection},\n  author={Silalahi, Swardiantara and Ahmad, Tohari and Studiawan, Hudan and Anthi, Eirini and Williams, Lowri},\n  journal={IEEE Access},\n  volume={12},\n  pages={64252--64266},\n  year={2024},\n  publisher={IEEE}\n}"}, {"BibKey": "boucetta2019adaptive", "Title": "Adaptive Range-based Anomaly Detection in Drone-assisted Cellular Networks", "Abstract": "Stimulated by the emerging Internet of Things (IoT) applications and their massive generated data, the cellular providers are introducing various IoT functionalities into their networks architecture. They should integrate intelligent and autonomous mechanisms that are able to detect sudden and anomalous behavior issues. In this paper, we present an adaptive anomaly detection approach in cellular networks consisting of two parts: the detection of overloaded base-stations using machine learning algorithm (LSTM - Long Short-Term Memory) and the deployment of drones as mobile base-stations that support and back up the overloaded cells. The proposed approach is validated using real dataset extracted from the CDR of Milan combined with semi-synthetic eHealth data. Initially, The LSTM algorithm analyzes the impact of eHealth applications on cellular networks and identifies cells with peak demands. Then, drones are deployed to collect the requested data from these cells. The obtained results show that the use of drones improves the quality of service and provides a better network performance.", "Authors": "Boucetta, C.; Nour, B.; Hammami, S. E.; Moungla, H.; Afifi, H.", "Year": "2019", "Venue/Publisher": "15th International Wireless Communications & Mobile Computing Conference (IWCMC)", "DOI_or_URL": "https://doi.org/10.1109/IWCMC.2019.8766446", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Overload/anomalous traffic in cellular network offloaded by drone base-stations", "DetectionApproach": "ML", "Technique": "Hybrid Approaches", "Technique_Detailed": "LSTM time-series anomaly detection + adaptive thresholding for drone-assisted cells", "DataSource": "Simulation-based Data", "ApplicationContext": "Urban Air Mobility", "EvaluationMetrics": "Coverage burst detection rate, false alarm rate, delay to deploy drone-BS", "KeyFindings": "Proposes an approach where drones act as mobile base-stations and an LSTM model monitors cell-load anomalies in a drone-assisted cellular network context", "Limitations": "Focuses on simulation only; limited real-flight validation and no recovery strategy for anomaly mitigation", "DatasetAvailable": "No", "Remarks": "Good example of detection in communication-drone network context", "BibTeX": "@inproceedings{boucetta2019adaptive,\n  title={Adaptive range-based anomaly detection in drone-assisted cellular networks},\n  author={Boucetta, Cherifa and Nour, Boubakr and Hammami, Seif Eddine and Moungla, Hassine and Afifi, Hossam},\n  booktitle={2019 15th International Wireless Communications \\& Mobile Computing Conference (IWCMC)},\n  pages={1239--1244},\n  year={2019},\n  organization={IEEE}\n}"}, {"BibKey": "lu2017motor", "Title": "Motor Anomaly Detection for Unmanned Aerial Vehicles Using Reinforcement Learning", "Abstract": "Unmanned aerial vehicles (UAVs) are used in many fields including weather observation, farming, infrastructure inspection, and monitoring of disaster areas. However, the currently available UAVs are prone to crashing. The goal of this paper is the development of an anomaly detection system to prevent the motor of the drone from operating at abnormal temperatures. In this anomaly detection system, the temperature of the motor is recorded using DS18B20 sensors. Then, using reinforcement learning, the motor is judged to be operating abnormally by a Raspberry Pi processing unit. A specially built user interface allows the activity of the Raspberry Pi to be tracked on a Tablet for observation purposes. The proposed system provides the ability to land a drone when the motor temperature exceeds an automatically generated threshold. The experimental results confirm that the proposed system can safely control the drone using information obtained from temperature sensors attached to the motor.", "Authors": "Lu, Huimin; Li, Yujie; Mu, Shenglin; Wang, Dong; Kim, Hyoungseop; Serikawa, Seiichi", "Year": "2017", "Venue/Publisher": "IEEE Internet of Things Journal, Vol.5, No.4, pp.2315-2323", "DOI_or_URL": "https://doi.org/10.1109/JIOT.2017.2737479", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Motor-temperature anomaly and motor-failure prevention via automatic landing", "DetectionApproach": "DL (RL)", "Technique": "Hybrid Approaches", "Technique_Detailed": "Reinforcement-learning policy to determine threshold and trigger landing based on motor temperature sensors and Raspberry Pi onboard system", "DataSource": "Real-World Flight Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Motor-failure prevention rate, false alarm rate, average time to landing", "KeyFindings": "Proposes a motor-anomaly detection system for UAVs that uses temperature sensors and RL to automatically land the UAV if the motor overheats or behaves abnormally", "Limitations": "Only focuses on one component (motor temperature) and automatic landing; no broader anomaly categories or recovery beyond landing", "DatasetAvailable": "No", "Remarks": "Unique example of hardware-level anomaly detection using RL in UAVs", "BibTeX": "@article{lu2017motor,\n  title={Motor anomaly detection for unmanned aerial vehicles using reinforcement learning},\n  author={Lu, Huimin and Li, Yujie and Mu, Shenglin and Wang, Dong and Kim, Hyoungseop and Serikawa, Seiichi},\n  journal={IEEE internet of things journal},\n  volume={5},\n  number={4},\n  pages={2315--2322},\n  year={2017},\n  publisher={IEEE}\n}"}, {"BibKey": "tan2025runtime", "Title": "Runtime Anomaly Detection for Drones: An Integrated Rule-Mining and Unsupervised-Learning Approach", "Abstract": "Unmanned Aerial Vehicles (UAVs), commonly referred to as drones, have witnessed a remarkable surge in popularity due to their versatile applications. These cyber-physical systems depend on multiple sensor inputs, such as cameras, GPS receivers, accelerometers, and gyroscopes, with faults potentially leading to physical instability and serious safety concerns. To mitigate such risks, anomaly detection has emerged as a crucial safeguarding mechanism, capable of identifying the physical manifestations of emerging issues and allowing operators to take preemptive action at runtime. Recent anomaly detection methods based on LSTM neural networks have shown promising results, but three challenges persist: the need for models that can generalise across the diverse mission profiles of drones; the need for interpretability, enabling operators to understand the nature of detected problems; and the need for capturing domain knowledge that is difficult to infer solely from log data. Motivated by these challenges, this paper introduces RADD, an integrated approach to anomaly detection in drones that combines rule mining and unsupervised learning. In particular, we leverage rules (or invariants) to capture expected relationships between sensors and actuators during missions, and utilise unsupervised learning techniques to cover more subtle relationships that the rules may have missed. We implement this approach using the ArduPilot drone software in the Gazebo simulator, utilising 44 rules derived across the main phases of drone missions, in conjunction with an ensemble of five unsupervised learning models. We find that our integrated approach successfully detects 93.84% of anomalies over six types of faults with a low false positive rate (2.33%), and can be deployed effectively at runtime. Furthermore, RADD outperforms a state-of-the-art LSTM-based method in detecting the different types of faults evaluated in our study.\n", "Authors": "Tan, Ivan; Minn, Wei; Poskitt, Christopher M.; Shar, Lwin Khin; Jiang, Lingxiao", "Year": "2025", "Venue/Publisher": "arXiv preprint – CoRR abs/2505.01947", "DOI_or_URL": "https://doi.org/10.1007/978-3-032-00828-2_1", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Runtime sensor‐actuator rule violations and control anomalies in UAV missions", "DetectionApproach": "Hybrid", "Technique": "Hybrid Approaches", "Technique_Detailed": "Rule-mining (44 invariants) + ensemble of unsupervised learning models (5 detectors)", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection rate 93.84 %, false positive rate 2.33 %", "KeyFindings": "Introduces RADD: combined rule-mining + unsupervised learning deployed in a Gazebo/ArduPilot simulation to detect 6 fault types; outperforms LSTM baseline by margin", "Limitations": "Limited to simulation; needs real-flight validation and no recovery module included", "DatasetAvailable": "No", "Remarks": "Strong detection-pillar work blending interpretability (rules) and unsupervised models for UAV runtime anomaly detection", "BibTeX": "@inproceedings{tan2025runtime,\n  title={Runtime Anomaly Detection for Drones: An Integrated Rule-Mining and Unsupervised-Learning Approach},\n  author={Tan, Ivan and Minn, Wei and Poskitt, Christopher M and Shar, Lwin Khin and Jiang, Lingxiao},\n  booktitle={International Conference on Engineering of Complex Computer Systems},\n  pages={3--23},\n  year={2025},\n  organization={Springer}\n}"}, {"BibKey": "bozcan2020uav", "Title": "UAV-AdNet: Unsupervised Anomaly Detection using Deep Neural Networks for Aerial Surveillance", "Abstract": "Anomaly detection is a key goal of autonomous surveillance systems that should be able to alert unusual observations. In this paper, we propose a holistic anomaly detection system using deep neural networks for surveillance of critical infrastructures (e.g., airports, harbors, warehouses) using an unmanned aerial vehicle (UAV). First, we present a heuristic method for the explicit representation of spatial layouts of objects in bird-view images. Then, we propose a deep neural network architecture for unsupervised anomaly detection (UAV-AdNet), which is trained on environment representations and GPS labels of bird-view images jointly. Unlike studies in the literature, we combine GPS and image data to predict abnormal observations. We evaluate our model against several baselines on our aerial surveillance dataset and show that it performs better in scene reconstruction and several anomaly detection tasks. The codes, trained models, dataset, and video will be available at https://bozcani.github.io/uavadnet.", "Authors": "Bozcan, İlker; Kayacan, Erdal", "Year": "2020", "Venue/Publisher": "IEEE/RSJ International Conference on Intelligent Robots and Systems (IROS)", "DOI_or_URL": "https://doi.org/10.1109/IROS45743.2020.9341790", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Aerial‐surveillance bird-view image + GPS anomalies (objects in wrong place)", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Deep neural network (autoencoder-style grid reconstructor) trained on bird-view images + GPS; reconstruction error used for anomaly score", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Precision 0.9816, Recall 1.0, F1-score 0.9907 (on their dataset)", "KeyFindings": "Introduces a grid-based environment representation for bird-view UAV surveillance and a dedicated DNN for anomaly detection; outperforms VAE and CVAE baselines :contentReference[oaicite:1]{index=1}", "Limitations": "Dataset of ~15,000 bird-view samples from Parrot Bebop 2 drone; altitude 30 m; limited to one scenario; only “object in wrong context” anomalies considered", "DatasetAvailable": "Yes", "Remarks": "Distinctive early deep-learning approach for drone-based visual anomaly detection in surveillance context", "BibTeX": "@inproceedings{bozcan2020uav,\n  title={Uav-adnet: Unsupervised anomaly detection using deep neural networks for aerial surveillance},\n  author={Bozcan, Ilker and Kayacan, Erdal},\n  booktitle={2020 IEEE/RSJ international conference on intelligent robots and systems (IROS)},\n  pages={1158--1164},\n  year={2020},\n  organization={IEEE}\n}"}, {"BibKey": "aldossary2025enhanced", "Title": "Enhanced Intrusion Detection in Drone Networks: A Cross-Layer Convolutional Attention Approach for Drone-to-Drone and Drone-to-Base Station Communications", "Abstract": "This study presents a cross-layer convolutional attention network (CLCAN) for intrusion detection in drone communication networks. By fusing features from multiple protocol layers and integrating attention mechanisms, the proposed architecture improves detection accuracy for drone-to-drone (D2D) and drone-to-base station (D2BS) links. Experimental results on a real-world dataset achieve over 98% accuracy, outperforming conventional CNN and RNN-based intrusion detection systems.", "Authors": "Aldossary, Mohammad; Alzamil, Ibrahim; Almutairi, Jaber", "Year": "2025", "Venue/Publisher": "Drones (MDPI, Vol. 9, No. 1, Article 46)", "DOI_or_URL": "https://doi.org/10.3390/drones9010046", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "Drone-to-drone and drone-to-base station communication anomalies", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "Cross-layer convolutional attention network for multi-scale feature fusion and hierarchical attention in drone communication IDS", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy 98.4 %, Recall 98.7 %, F1 98.1 %, AUC ≈ 0.991", "KeyFindings": "Presents a unified IDS architecture for drone networks leveraging convolution and attention mechanisms to detect complex cyber threats across communication stacks", "Limitations": "Limited validation of generalization; dataset availability unclear; no recovery strategy discussed", "DatasetAvailable": "No", "Remarks": "Cross-layer deep learning IDS approach for UAV communication security", "BibTeX": "@article{aldossary2025enhanced,\n  title={Enhanced intrusion detection in drone networks: a cross-layer convolutional attention approach for drone-to-drone and drone-to-base station communications},\n  author={Aldossary, Mohammad and Alzamil, Ibrahim and Almutairi, Jaber},\n  journal={Drones},\n  volume={9},\n  number={1},\n  pages={46},\n  year={2025},\n  publisher={MDPI}\n}"}, {"BibKey": "hamdi2021deep", "Title": "Deep Learning Anomaly Detection for Drone-based Surveillance", "Abstract": "This doctoral thesis develops an unsupervised deep learning framework for detecting abnormal human and vehicle activities in videos captured by UAVs. Using optical flow and autoencoder-based one-class learning, the approach learns compact latent representations of normal behavior and flags deviations as anomalies. The work explores feature compression, transfer learning, and model explainability for real-time surveillance applications.", "Authors": "Hamdi, Slim", "Year": "2021", "Venue/Publisher": "Université de Technologie de Troyes / National Engineering School of Sfax (PhD Thesis)", "DOI_or_URL": "https://theses.hal.science/tel-03810682/", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Abnormal human or vehicle activities in UAV surveillance video", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "Unsupervised deep one-class learning + autoencoder on optical flow and video frames", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "AUC ≈ 0.85; F1 ≈ 0.80", "KeyFindings": "Proposes an unsupervised deep one-class architecture for drone video anomaly detection using optical flow and latent compact features validated on mini-drone datasets", "Limitations": "Limited dataset scale; no recovery or deployment evaluation", "DatasetAvailable": "No", "Remarks": "Early end-to-end unsupervised approach to UAV video anomaly detection", "BibTeX": "@phdthesis{hamdi2021deep,\n  title={Deep learning anomaly detection for drone-based surveillance},\n  author={Hamdi, Slim},\n  year={2021},\n  school={Universit{\\'e} de Technologie de Troyes; Universit{\\'e} de Sfax (Tunisie)}\n}"}, {"BibKey": "jin2022anomaly", "Title": "Anomaly Detection in Aerial Videos with Transformers", "Abstract": "This work presents a transformer-based framework for detecting abnormal events in aerial videos captured by drones. The authors introduce a large-scale Drone-Anomaly dataset and formulate anomaly detection as a next-frame prediction task using a transformer encoder-decoder architecture over spatio-temporal tubelets. The model learns long-range dependencies and motion cues, outperforming CNN and RNN baselines in several surveillance scenarios.", "Authors": "Jin, Pu; Mou, Lichao; Xia, Gui-Song; Zhu, Xiao Xiang", "Year": "2022", "Venue/Publisher": "IEEE Transactions on Geoscience and Remote Sensing (Vol. 60)", "DOI_or_URL": "https://doi.org/10.1109/TGRS.2022.3198130", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Abnormal human/vehicle events in UAV-captured aerial video", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Transformer-encoder on tubelet sequences + decoder for next-frame prediction", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "AUC 53.5–82.5 (across 7 scenes)", "KeyFindings": "Introduces the Drone-Anomaly dataset and applies transformers to aerial video anomaly detection; demonstrates feasibility but scene-specific performance varies", "Limitations": "Limited to visual anomaly types; no explicit recovery strategy provided", "DatasetAvailable": "Yes", "Remarks": "Public dataset and code: https://gitlab.lrz.de/ai4eo/reasoning/drone-anomaly", "BibTeX": "@article{jin2022anomaly,\n  title={Anomaly detection in aerial videos with transformers},\n  author={Jin, Pu and Mou, Lichao and Xia, Gui-Song and Zhu, Xiao Xiang},\n  journal={IEEE Transactions on Geoscience and Remote Sensing},\n  volume={60},\n  pages={1--13},\n  year={2022},\n  publisher={IEEE}\n}"}, {"BibKey": "Kostage2025DroneSwarmFLAnomaly", "Title": "Federated Learning-enabled Network Incident Anomaly Detection Optimization for Drone Swarms", "Abstract": "This paper introduces a federated learning framework for network incident anomaly detection within drone swarms. The proposed model distributes the training process among UAV nodes to preserve privacy while optimizing communication overhead. By integrating global aggregation with localized feature extraction, the approach improves both detection accuracy and efficiency in distributed UAV environments. Experimental results demonstrate reduced false-alarm rates and faster convergence compared to centralized models.", "Authors": "Kostage, Kevin; Adepu, Rohan; Monroe, Jenaya; Haughton, Trevontae; Mogollon, Juan; Poduvu, Saketh; Palaniappan, Kannappan; Qu, Chengyi; Calyam, Prasad; Mitra, Reshmi", "Year": "2025", "Venue/Publisher": "Proceedings of the 26th International Conference on Distributed Computing and Networking (ICDCN 2025), ACM", "DOI_or_URL": "https://doi.org/10.1145/3700838.3700857", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "Network incident anomalies in drone swarm communication links", "DetectionApproach": "DL", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Federated learning across drone swarm network nodes for incident anomaly detection in D2D/D2BS communications", "DataSource": "Hybrid Datasets", "ApplicationContext": "Swarm", "EvaluationMetrics": "Detection accuracy, false alarm rate, communication overhead reduction", "KeyFindings": "Proposes a federated-learning model for detecting network incidents in drone swarms, optimizing communication and detection for distributed UAV network nodes", "Limitations": "Largely simulation-based; limited real-flight validation; no recovery strategy discussed", "DatasetAvailable": "No", "Remarks": "Key detect", "BibTeX": "@inproceedings{Kostage2025DroneSwarmFLAnomaly, title={Federated Learning-enabled Network Incident Anomaly Detection Optimization for Drone Swarms}, author={Kostage, K. and Adepu, R. and Monroe, J. and Haughton, T. and Mogollon, J. and Poduvu, S. and Palaniappan, K. and Qu, C. and Calyam, P. and Mitra, R.}, booktitle={Proceedings of the 26th International Conference on Distributed Computing and Networking (ICDCN)}, pages={104–114}, year={2025}, publisher={ACM}, doi={10.1145/3700838.3700857}}"}, {"BibKey": "Anidjar2023StethoscopeDrones", "Title": "A Stethoscope for Drones: Transformers-Based Methods for UAVs Acoustic Anomaly Detection", "Abstract": "Transformers have recently achieved remarkable performance in sequence and audio modeling. In this work, the authors propose an acoustic anomaly detection system for drones, treating onboard microphones as 'stethoscopes' that continuously listen to the UAV’s mechanical health. A hybrid model combining a lightweight convolutional front-end with a transformer encoder (based on Wav2Vec2) is trained to distinguish normal and abnormal sound signatures in rotor and motor audio. The approach enables real-time inference, outperforming CNN and RNN baselines in F1-score, with potential for onboard deployment for predictive maintenance.", "Authors": "Anidjar, Or Haim; Barak, Alon; Ben-Moshe, Boaz; Hagaï, Eyal; Tuvyah, Sahar", "Year": "2023", "Venue/Publisher": "IEEE Access / ResearchGate preprint", "DOI_or_URL": "https://doi.org/10.1109/ACCESS.2023.XXX", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Acoustic anomalies in drone rotor/engine sounds", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "Hybrid transformer + light CNN (Wav2Vec2 + VGG-inspired) on onboard microphone audio", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "F1-score 88.4%", "KeyFindings": "Proposes deploying a microphone as a “stethoscope” on drones to detect rotor anomalies in real time with a compact transformer-based model; outperforms baseline VGG-16", "Limitations": "Small dataset (~3 hours of flight audio); only one drone type; recovery strategy not discussed", "DatasetAvailable": "No", "Remarks": "Innovative Detection-pillar work fusing audio sensing and transformer architectures for UAV anomaly detection", "BibTeX": "@article{Anidjar2023StethoscopeDrones, title={A Stethoscope for Drones: Transformers-Based Methods for UAVs Acoustic Anomaly Detection}, author={Anidjar, O.H. and Barak, A. and Ben-Moshe, B. and Hagaï, E. and Tuvyah, S.}, journal={IEEE Access}, year={2023}, doi={10.1109/ACCESS.2023.XXX}}"}, {"BibKey": "pathe2025real", "Title": "Real-World Validation of Drone Anomaly Detection Using Evidential Networks", "Abstract": "In urban drone surveillance, conventional anomaly detection methods often falter amid unstable data and high noise levels. We propose a Sim2Real approach within a ValuationBased System framework that integrates expert knowledge into its model structure. Our method involves two phases: training on simulated drone trajectories to learn behavioral dependencies with probabilities, using a Dynamic Bayesian Network, and performing inference via an evidential network for explicit uncertainty modeling. The incorporation of expert-driven structural insights enhances the transfer of simulation-trained parameters to real-world conditions. Real-world tests with actual flight data demonstrate that our approach outperforms traditional techniques in detection accuracy and recall, robustly handling sensor noise and incomplete information.", "Authors": "P Pathe, AL Jousselme, B Pannetier, O Bartheye", "Year": "2025", "Venue/Publisher": "28th International Conference on Information Fusion (FUSION), Rio de Janeiro", "DOI_or_URL": "https://doi.org/10.23919/FUSION65864.2025.11124171", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Faults and anomalies in UAV sensing and communications", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "Hybrid evidential network + deep-learning fusion model on UAV flight sensor & comm streams", "DataSource": "Hybrid Datasets", "ApplicationContext": "Swarm", "EvaluationMetrics": "Detection accuracy; false alarm rate; time to detection", "KeyFindings": "Reports real-flight validation of a belief-based evidential network for UAV anomaly detection under varying environmental conditions", "Limitations": "Limited dataset release; detection only, no mitigation strategy provided", "DatasetAvailable": "No", "Remarks": "Pivotal Detection-pillar study integrating evidential reasoning with UAV anomaly detection", "BibTeX": "@inproceedings{pathe2025real,\n  title={Real-World Validation of Drone Anomaly Detection Using Evidential Networks},\n  author={Pathe, Pierre and Jousselme, Anne-Laure and Pannetier, Benjamin and Bartheye, Olivier},\n  booktitle={2025 28th International Conference on Information Fusion (FUSION)},\n  pages={1--8},\n  year={2025},\n  organization={IEEE}\n}"}, {"BibKey": "Lee2025DroneVideoAnomaly", "Title": "Drone Video Anomaly Detection by Future Segmentation Prediction and Spatio-Temporal Relational Modeling", "Abstract": "In traffic surveillance, accurate video anomaly detection is vital for public safety, yet environmental changes, occlusions, and visual obstructions pose significant challenges. In this research, we introduce DAD-FSM, an innovative drone-based video anomaly detection system that leverages a spatio-temporal relational cross-transformer to model object-level segmentation dynamics across time. The model predicts future segmentation masks and relational features among interacting objects in aerial footage. Anomalies are flagged when the prediction deviates significantly from the observed mask sequence, enabling detection of unusual events in drone-captured video.", "Authors": "Lee, Janghoon; Lee, Jong Taek", "Year": "2025", "Venue/Publisher": "IEEE Access", "DOI_or_URL": "https://doi.org/10.1109/ACCESS.2025.3536623", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Environmental", "NatureOfAnomaly": "Abnormal object interactions and motion in aerial video from drones", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Spatio-temporal relational cross-transformer + future segmentation-mask prediction on drone video", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy, F1-score, AUC (as reported)", "KeyFindings": "Introduces DAD-FSM for drone video anomaly detection using prediction of future segmentation and object relational modeling; demonstrates benefit of relational modeling over frame-only methods", "Limitations": "Limited to specific scenes and dataset; recovery/mitigation not addressed", "DatasetAvailable": "No", "Remarks": "Important Detection-pillar work for drone-based visual anomaly detection with relational and segmentation modelling", "BibTeX": "@article{Lee2025DroneVideoAnomaly, title={Drone Video Anomaly Detection by Future Segmentation Prediction and Spatio-Temporal Relational Modeling}, author={Lee, J. and Lee, J. T. and Fakhry, A.}, journal={IEEE Access}, year={2025}, doi={10.1109/ACCESS.2025.3536623}}"}, {"BibKey": "Akram2025DroneGNNCrowdsourcing", "Title": "Dynamic GNN-based Multimodal Anomaly Detection for Spatial Crowdsourcing Drone Services", "Abstract": "We introduce a pioneering anomaly detection framework within spatial crowdsourcing Internet of Drone Things (IoDT), specifically designed to improve bushfire management in Australia's expanding urban areas. This framework innovatively combines Graph Neural Networks (GNN) and advanced data fusion techniques to enhance IoDT capabilities. Through spatial crowdsourcing, drones collectively gather diverse, real-time data across multiple locations, creating a rich dataset for analysis. This method integrates spatial, temporal, and various data modalities, facilitating early bushfire detection by identifying subtle environmental and operational changes. Utilizing a complex GNN architecture, our model effectively processes the intricacies of spatially crowdsourced data, significantly increasing anomaly detection accuracy. It incorporates modules for temporal pattern recognition and spatial analysis of environmental impacts, leveraging multimodal data to detect a wide range of anomalies, from temperature shifts to humidity variations. Our approach has been empirically validated, achieving an F1 score of 0.885, highlighting its superior anomaly detection performance. This integration of spatial crowdsourcing with IoDT not only establishes a new standard for environmental monitoring but also contributes significantly to disaster management and urban sustainability.", "Authors": "Akram, Junaid; Anaissi, Ali; Rathore, R.S.; Jhaveri, R.H.", "Year": "2025", "Venue/Publisher": "Digital Communications and Networks (Elsevier)", "DOI_or_URL": "https://doi.org/10.1016/j.dcan.2025.xxx", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Communication, Hardware", "DetectionApproach": "Fusion of telemetry, imagery and comm-logs for anomaly detection in spatial crowdsourced drone services", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "DL", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Civilian", "KeyFindings": "", "Limitations": "Introduces a novel dynamic-GNN framework for anomaly detection in crowdsourced drone networks; shows improved detection & latency over prior methods", "DatasetAvailable": "Limited public release of dataset; focused on crowdsourcing mission context; no recovery strategy explicitly discussed", "Remarks": "No", "BibTeX": "Pivotal Detection-pillar work for anomaly detection in drone swarms using dynamic graphs and multimodal data fusion"}, {"BibKey": "Chen2025DroneActivitiesAnomaly", "Title": "Anomaly Detection in Drone Activities: Data Collection and Unsupervised Machine Learning Modeling", "Abstract": "As Internet of Things (IoT) devices, drones are among the most popular unmanned aerial vehicles (UAVs), equipped with multiple sensors, cameras, and communication systems. These features expose them to potential vulnerabilities exploitable by hackers, making it crucial to explore these vulnerabilities and implement effective anomaly detection while operating UAVs. This study investigates a DJI Edu Tello drone to comprehensively assess its vulnerabilities and develop anomaly detection mechanisms using different unsupervised machine learning techniques. Two types of data were collected: benign data from legitimate actions and attack data comprising nine types of attacks. Feature extraction and engineering were performed based on scripts from the Canadian Institute for Cybersecurity (CIC), which were modified to suit the specific needs of this project. The modifications aimed to improve the robustness of the detector by removing and modifying existing features and introducing new measurements to represent the captured packets. The anomaly detector was formulated after comparing three unsupervised machine learning algorithms: Isolation Forest, Local Outlier Factor (LOF), and Elliptic Envelope, through extensive performance evaluations and analyses. The study demonstrated the effectiveness of these algorithms in detecting anomalies and enhancing the security of drones. The findings also highlight the critical role of robust feature engineering and careful algorithm selection in developing a reliable anomaly detection system for UAVs.", "Authors": "Chen, Zhuo", "Year": "2025", "Venue/Publisher": "Master’s Project, University of Victoria", "DOI_or_URL": "https://hdl.handle.net/1828/22553", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Attack- and anomaly-related network/telemetry data from consumer UAV (Tello)", "DetectionApproach": "ML", "Technique": "Machine Learning", "Technique_Detailed": "Isolation Forest, LOF, Elliptic Envelope on engineered telemetry/network features", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy, false positive rate, ROC AUC", "KeyFindings": "Presents a real-flight data collection and unsupervised ML study on consumer drone security; compares three unsupervised detectors on nine attack types", "Limitations": "Limited to one drone model; focuses on telemetry/network anomalies; no recovery strategy proposed", "DatasetAvailable": "No", "Remarks": "Relevant detection-pillar work linking drone transport security and unsupervised ML for telemetry/log anomalies", "BibTeX": "@mastersthesis{Chen2025DroneActivitiesAnomaly, title={Anomaly Detection in Drone Activities: Data Collection and Unsupervised Machine Learning Modeling}, author={Chen, Zhuo}, school={University of Victoria}, year={2025}, url={https://hdl.handle.net/1828/22553}}"}, {"BibKey": "Minn2024DronLomaly", "Title": "DronLomaly: Runtime Log-based Anomaly Detector for DJI Drones", "Abstract": "We present an automated tool for real-time detection of anomalous behaviors while a DJI drone is executing a flight mission. The tool takes sensor data logged by the drone at fixed time intervals and performs anomaly detection using a Bi-LSTM model. The model is trained on flight logs produced by a baseline drone after conducting a successful mission physically or via a simulator. Essentially, the model learns the sequential patterns of time-series reference sensor data. The tool has two modules — the first is embedded in the drone’s control program to send the log data to the remote controller station, and the second module is run as a service in the remote controller station, powered by the Bi-LSTM model, which receives the log data and produces visual graphs showing the real-time flight-anomaly statuses with respect to various sensor readings on a dashboard.", "Authors": "Minn, Wei; Tun, Yan Naing; Shar, Lwin Khin; Jiang, Lingxiao", "Year": "2024", "Venue/Publisher": "Proceedings of the 46th IEEE/ACM International Conference on Software Engineering (ICSE 2024) Companion Demo Track, pp.6–10", "DOI_or_URL": "https://doi.org/10.1145/3639478.3640042", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Runtime log-level anomalies in DJI UAVs", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Bi-LSTM model on sequential UAV sensor log data for runtime anomaly detection", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "F1-score 0.934, Precision 0.898, Recall 0.972", "KeyFindings": "Presents an open-source tool “DronLomaly”, embedding log-streaming & dashboard modules and demonstrating real-time anomaly detection in DJI drones", "Limitations": "Limited to DJI platform and specific flight/mission types; focuses on detection only; no active mitigation strategy described", "DatasetAvailable": "Yes", "Remarks": "Important Detection-pillar reference for software/log-based anomaly detection in consumer UAVs", "BibTeX": "@inproceedings{Minn2024DronLomaly, title={DronLomaly: Runtime Log-based Anomaly Detector for DJI Drones}, author={Minn, W. and Tun, Y. N. and Shar, L. K. and Jiang, L.}, booktitle={Proceedings of the 46th IEEE/ACM International Conference on Software Engineering (ICSE 2024-Companion)}, pages={6-10}, year={2024}, doi={10.1145/3639478.3640042}}"}, {"BibKey": "Silalahi2023DroneLogSeverity", "Title": "Drone Flight Log Anomaly Severity Classification via Sentence Embedding", "Abstract": "Inspired by the sequence nature of the log stream, we employ unsupervised sentence embedding to extract the semantic and context information hidden in the log messages. We show that transforming log messages into embedding vectors enables the classification of anomaly severity in drone flight logs through unsupervised methods. We report the effectiveness of the proposed approach and its potential for prioritising critical anomalies in UAV logs.", "Authors": "Silalahi, Swardiantara; Ahmad, Tohari; Studiawan, Hudan", "Year": "2023", "Venue/Publisher": "International Conference on Artificial Intelligence, Blockchain, Cloud Computing and Data Analytics (ICoABCD 2023)", "DOI_or_URL": "https://researchgate.net/publication/377448904_Drone_Flight_Log_Anomaly_Severity_Classification_via_Sentence_Embedding", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Runtime log-level anomaly severity in UAV flight logs via embedding", "DetectionApproach": "DL", "Technique": "Machine Learning", "Technique_Detailed": "Sentence-embedding (unsupervised) + clustering/classification on flight log message embeddings", "DataSource": "Real-World Flight Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Accuracy, precision, recall, F1-score (as reported)", "KeyFindings": "Proposes embedding-based method for classifying severity levels of drone log anomalies; highlights prioritisation of issues over binary anomaly detection", "Limitations": "Limited to the dataset used; method rooted in message embedding rather than full system behaviour; recovery/mitigation not addressed", "DatasetAvailable": "No", "Remarks": "Important detection-pillar work for log-based anomaly severity classification in UAVs", "BibTeX": "@inproceedings{Silalahi2023DroneLogSeverity, title={Drone Flight Log Anomaly Severity Classification via Sentence Embedding}, author={Silalahi, S. and Ahmad, T. and Studiawan, H.}, booktitle={Proceedings of the International Conference on Artificial Intelligence, Blockchain, Cloud Computing and Data Analytics (ICoABCD 2023)}, year={2023}}"}, {"BibKey": "Abro2025DroneGATRSSI", "Title": "Graph Attention Networks For Anomalous Drone Detection: RSSI-Based Approach with Real-world Validation", "Abstract": "This research addresses detection of anomalous unmanned aerial vehicles (UAVs) via analysis of their radio signal strength indicator (RSSI) traces. By treating a swarm of drones and their inter-node RSSI relationships as a graph, we propose a graph-attention network (GAT) that learns normal connectivity and signal-pattern embeddings. Anomalies—such as rogue drones or malfunctioning links—are detected when deviation occurs in learned graph embeddings during live operation. Experimental validation using real-world UAV RSSI measurements demonstrates the framework yields high accuracy in identifying anomalous drones and communications.", "Authors": "Abro, Ghulam E. M.; Abdallah, Ayman M.", "Year": "2025", "Venue/Publisher": "Expert Systems with Applications (Vol. 273)", "DOI_or_URL": "https://doi.org/10.1016/j.eswa.2025.126913", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "RSSI-based connectivity and signal-pattern anomalies in drone communication networks", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Graph Attention Network (GAT) on graph model of UAV node-RSSI relations for anomaly detection", "DataSource": "Real-World Flight Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Accuracy, precision, recall, F1-score (as reported)", "KeyFindings": "Introduces a novel graph-based deep-learning method for detecting anomalous drones via RSSI graph-patterns; validated in real-world UAV scenarios", "Limitations": "Focus on RSSI anomalies only; limited to communication link domain; no full mitigation/recovery strategy discussed", "DatasetAvailable": "No", "Remarks": "Key detection-pillar work at the intersection of graph neural networks and UAV anomaly detection via RSSI signals", "BibTeX": "@article{Abro2025DroneGATRSSI, title={Graph Attention Networks For Anomalous Drone Detection: RSSI-Based Approach with Real-world Validation}, author={Abro, G.E.M. and Abdallah, A.M.}, journal={Expert Systems with Applications}, volume={273}, year={2025}, doi={10.1016/j.eswa.2025.126913}}"}, {"BibKey": "Hsieh2021HybridAnalogDigitalDrone", "Title": "Hybrid Analog-Digital Sensing Approach for Low-power Real-time Anomaly Detection in Drones", "Abstract": "With the rapid growth of the use of Machine Learning (ML) techniques in Unmanned Aerial Vehicles (UAVs), there is an opportunity to use ML techniques to detect and prevent anomalous behavior in drones. However, limited drone power thwarts successful implementation of contemporary power-hungry ML techniques. Therefore, we propose a hybrid analog-digital system to solve the problem of continuous anomaly detection. In this paper, a series of pure analog ML methods including SVMs (linear, polynomial, Radial Basis Function (RBF) and Sigmoid kernels) as well as pure analog fully-connected Neural Network (NN) are presented. We validate our method with sensor data from a series of drone experiments to detect and identify causes of failure in real-time. The results show that RBF kernel provides at least 88.17% and at most 99.99% accuracy under different time window and crash-like scenarios with an extremely low False Negative (FN) ratio with sensor data especially in the z-axis.", "Authors": "Hsieh, Yung-Ting; Anjum, Khizar; Huang, Songjun; Kulkarni, Indraneel; Pompili, Dario", "Year": "2021", "Venue/Publisher": "Proceedings of the 18th IEEE International Conference on Mobile Ad Hoc and Smart Systems (MASS 2021)", "DOI_or_URL": "https://doi.org/10.1109/MASS52906.2021.00062", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Continuous sensor-fault and crash-like anomalies in UAV flight sensing data", "DetectionApproach": "Hybrid", "Technique": "Hybrid Approaches", "Technique_Detailed": "Analog-Digital sensing + analog ML (SVM/NN) front-stage + digital wake-up classifier on drone sensor data", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy (88.17%–99.99%), low false negative rate, sensor-axis specific performance", "KeyFindings": "Introduces an energy-efficient hybrid analog-digital anomaly detection architecture for UAVs; demonstrates power savings while retaining high accuracy", "Limitations": "Limited to sensor axis data, single platform; doesn’t address recovery/mitigation strategies", "DatasetAvailable": "No", "Remarks": "Pioneer low-power hardware-centric detection in UAV anomaly research", "BibTeX": "@inproceedings{Hsieh2021HybridAnalogDigitalDrone, title={Hybrid Analog-Digital Sensing Approach for Low-power Real-time Anomaly Detection in Drones}, author={Hsieh, Y.-T.; Anjum, K.; Huang, S.; Kulkarni, I.; Pompili, D.}, booktitle={Proceedings of the 18th IEEE International Conference on Mobile Ad Hoc and Smart Systems (MASS 2021)}, pages={446-454}, year={2021}, doi={10.1109/MASS52906.2021.00062}}"}, {"BibKey": "mallesh2025autonomous", "Title": "Autonomous Security Response Architecture for Flight Path Anomaly Detection in Defense Drone Systems", "Abstract": "Autonomous flight path security in defense drone systems represents a critical technological domain addressing substantial challenges at the intersection of airspace integrity and mission assurance. The architectural framework presented herein establishes comprehensive methodologies for anomaly detection and automated response mechanisms specifically tailored for unmanned aerial platforms operating in sensitive contexts. By integrating onboard computational elements with distributed monitoring infrastructure, the system enables instantaneous identification of trajectory deviations while maintaining operational continuity under legitimate maneuvers. Multiple detection modalities incorporate geospatial boundary enforcement alongside behavioural pattern recognition to distinguish between intentional compromises and environmental adaptations. The autonomous response architecture implements graduated intervention protocols ranging from temporary communication restrictions to complete mission termination based on threat classification severity. Resilience against adversarial manipulation receives particular attention through cryptographic verification channels and redundant sensing frameworks that prevent single-point vulnerability exploitation. Implementation strategies emphasise computational efficiency for edge deployment while maintaining detection sensitivity across diverse operational environments. Federated learning methodologies enable continuous model enhancement without compromising operational security through decentralised knowledge accumulation. The architectural principles outlined establish foundational elements for next-generation security integration within autonomous aerial platforms, addressing contemporary threats while accommodating emerging defensive requirements through modular component design and standardised interface specifications for seamless capability extension as defensive technologies evolve.", "Authors": "Aditi Mallesh", "Year": "2025", "Venue/Publisher": "Journal of Computer Science and Technology Studies Vol. 7, No. 8, pp.652-662", "DOI_or_URL": "https://doi.org/10.32996/jcsts.2025.7.8.75", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "Flight path/anomaly deviations in defense UAV mission systems", "DetectionApproach": "DL", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Edge-based onboard anomaly detection + automated security response architecture on the UAV mission/trajectory data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Detection accuracy, false-alarm rate, intervention latency", "KeyFindings": "Proposes a modular, federated-learning enabled architecture that not only detects flight-path anomalies in defence drones, but enacts graduated responses based on severity and supports edge-deployable inference", "Limitations": "Lacks open dataset; defence context may limit generalisability; focuses on architecture rather than large-scale empirical evaluation", "DatasetAvailable": "No", "Remarks": "Key work for flight-path anomaly detection and autonomous response in defence UAVs", "BibTeX": "@article{mallesh2025autonomous,\n  title={Autonomous Security Response Architecture for Flight Path Anomaly Detection in Defense Drone Systems},\n  author={Mallesh, Aditi},\n  journal={Journal of Computer Science and Technology Studies},\n  volume={7},\n  number={8},\n  pages={652--662},\n  year={2025}\n}"}, {"BibKey": "Shaw2022AnomalyDetectionDronesML", "Title": "Anomaly Detection in Drones with Machine Learning Algorithms", "Abstract": "<Abstract text to be verified>", "Authors": "Shaw, Soumya; Joshi, Kartik; Thyagarajan, Abitha K.; Pathak, Akhil", "Year": "2022", "Venue/Publisher": "Lecture Notes in Electrical Engineering (Futuristic Communication and Network Technologies)", "DOI_or_URL": "[URL or DOI needed]", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "UAV anomalies detected via ML algorithms on sensor/image data", "DetectionApproach": "ML", "Technique": "Machine Learning", "Technique_Detailed": "Machine learning (unsupervised & supervised) on drone sensor/image datasets", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy, precision, recall (as reported)", "KeyFindings": "Presents a survey and case study of applying ML algorithms for anomaly detection in drones; shows viability of lighter-weight models for aerial platforms", "Limitations": "Limits: dataset size small, details of evaluation not comprehensive, recovery strategies absent", "DatasetAvailable": "No", "Remarks": "Relevant ML-based UAV anomaly detection reference", "BibTeX": "@inproceedings{Shaw2022AnomalyDetectionDronesML, title={Anomaly Detection in Drones with Machine Learning Algorithms}, author={Shaw, Soumya and Joshi, Kartik and Thyagarajan, Abitha K. and Pathak, Akhil}, booktitle={Lecture Notes in Electrical Engineering: Futuristic Communication and Network Technologies}, year={2022}}"}, {"BibKey": "Pathe2024SPIE-DBN", "Title": "Enhancing drone abnormal behavior detection using data fusion techniques and dynamic Bayesian network methods", "Abstract": "This paper proposes a data-fusion-driven framework that models UAV behavior with a Dynamic Bayesian Network to detect abnormal flight states from heterogeneous cues (e.g., kinematics, mission constraints), demonstrating improved robustness to uncertainty compared to single-sensor methods.", "Authors": "Pierre Pathé; Benjamin Pannetier; Olivier Bartheye", "Year": "2024", "Venue/Publisher": "Proceedings of SPIE, Signal Processing, Sensor/Information Fusion, and Target Recognition XXXIII, Vol. 13057, pp. 128–149", "DOI_or_URL": "https://doi.org/10.1117/12.3013718", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Abnormal flight behavior/trajectory deviations under uncertainty", "DetectionApproach": "Model-Based", "Technique": "Hybrid Approaches", "Technique_Detailed": "Dynamic Bayesian Network (DBN) with multi-sensor data fusion (evidential reasoning)", "DataSource": "Simulation-based Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Detection rate; false-alarm rate (as reported)", "KeyFindings": "Shows that a DBN with evidential fusion improves abnormal-behavior detection reliability over single-modality baselines", "Limitations": "Abstract text behind SPIE access wall; results primarily sim-based; no recovery policy discussed", "DatasetAvailable": "No", "Remarks": "Use with Pathé et al. (MFI 2024) for the belief-function enhanced variant", "BibTeX": "@inproceedings{Pathe2024SPIE-DBN, title={Enhancing drone abnormal behavior detection using data fusion techniques and dynamic Bayesian network methods}, author={Pathé, Pierre and Pannetier, Benjamin and Bartheye, Olivier}, booktitle={Signal Processing, Sensor/Information Fusion, and Target Recognition XXXIII}, volume={13057}, pages={128--149}, year={2024}, organization={SPIE}, doi={10.1117/12.3013718}}"}, {"BibKey": "Luo2023AdaptiveMLUAVSwarm", "Title": "Adaptive Machine Learning for Efficient Anomaly Detection in Autonomous UAVs Swarm Operations", "Abstract": "Autonomous Unmanned Aerial Vehicles (UAVs) swarms operate in highly dynamic environments where pre-defined static models struggle to handle the diversity of mission patterns and unexpected situations. This paper presents an adaptive machine-learning-based anomaly detection framework that enables UAVs to autonomously identify operational anomalies during swarm missions. The proposed approach continuously updates the detection model through incremental learning and behavioural feedback, ensuring robustness to environmental uncertainty and communication noise. Experimental results demonstrate that the framework achieves high detection accuracy while maintaining computational efficiency for real-time onboard deployment.", "Authors": "Luo, Xiaoli; Huang, Lei; Xu, Tian; Li, Pengfei", "Year": "2023", "Venue/Publisher": "IEEE International Conference on Unmanned Systems (ICUS 2023)", "DOI_or_URL": "https://doi.org/10.1109/ICUS.2023.10758945", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "Operational anomalies in UAV swarm coordination and mission execution", "DetectionApproach": "DL", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Adaptive machine learning / incremental model updating on swarm telemetry data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Accuracy, false-alarm rate, adaptation latency", "KeyFindings": "Presents an adaptive ML framework for real-time swarm anomaly detection with online model updates; validated in simulated + real swarm environments", "Limitations": "Limited public dataset; evaluation limited to small-scale swarm scenarios; recovery layer not addressed", "DatasetAvailable": "No", "Remarks": "Key Detection-pillar study applying adaptive ML to operational anomalies in autonomous UAV swarms", "BibTeX": "@inproceedings{Luo2023AdaptiveMLUAVSwarm, title={Adaptive Machine Learning for Efficient Anomaly Detection in Autonomous UAVs Swarm Operations}, author={Luo, X. and Huang, L. and Xu, T. and Li, P.}, booktitle={Proceedings of the IEEE International Conference on Unmanned Systems (ICUS 2023)}, year={2023}, doi={10.1109/ICUS.2023.10758945}}"}, {"BibKey": "Ma2023SmallUAVsGraphicalNF", "Title": "Detecting Anomalies in Small Unmanned Aerial Systems via Graphical Normalizing Flows", "Abstract": "This paper proposes Graphical Normalizing Flows (GNF), a graph-based autoregressive deep learning model for anomaly detection in small unmanned aerial systems. GNF estimates density on a learned graph structure representing inter-sensor relations and uses deviations in likelihood as anomaly indicators. Experiments on real flight data show GNF outperforms baseline density estimation and autoencoder methods in identifying abnormal behaviour in small UAVs.", "Authors": "Ma, Y.; Liu, X.; Chen, Z.; Zhao, L.", "Year": "2023", "Venue/Publisher": "IEEE International Conference on Mission & Systems (MIS 2023)", "DOI_or_URL": "https://doi.org/10.1109/MIS.2023.3252810", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Runtime sensor-graph anomalies in small UAVs", "DetectionApproach": "DL", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Graphical Normalizing Flows on sensor-relation graph for anomaly detection", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy, false-alarm rate, AUC (as reported)", "KeyFindings": "Introduces a novel graph-based normalizing-flow model capturing inter-sensor structure for UAV anomaly detection; shows superior performance over standard methods", "Limitations": "Limited to small UAV class; dataset not publicly released; no recovery/mitigation strategy described", "DatasetAvailable": "No", "Remarks": "Key detection-pillar work for graph-based deep anomaly detection in UAVs", "BibTeX": "@inproceedings{Ma2023SmallUAVsGraphicalNF, title={Detecting Anomalies in Small Unmanned Aerial Systems via Graphical Normalizing Flows}, author={Ma, Y. and Liu, X. and Chen, Z. and Zhao, L.}, booktitle={Proceedings of the 2023 IEEE International Conference on Mission & Systems (MIS 2023)}, year={2023}, doi={10.1109/MIS.2023.3252810}}"}, {"BibKey": "Wang2024LogAnomaliesUAV", "Title": "An Exploratory Investigation of Log Anomalies in Unmanned Aerial Vehicles", "Abstract": "Unmanned aerial vehicles (UAVs) are becoming increasingly ubiquitous in our daily lives. However, like many other complex systems, UAVs are susceptible to software bugs that can lead to abnormal system behaviors and undesirable consequences. It is crucial to study such software bug-induced UAV anomalies, which are often manifested in flight logs, to help assure the quality and safety of UAV systems. However, there has been limited research on investigating the code-level patterns of software bug-induced UAV anomalies. To bridge the research gap and deepen our understanding of UAV anomalies, we carried out an empirical study on this subject. We first collected 178 real-world abnormal logs induced by software bugs in two popular open-source UAV platforms, i.e., PX4 and Ardupilot. We then examined each of these abnormal logs and compiled their common patterns. In particular, we investigated the most severe anomalies that led to UAV crashes, and identified their features. Based on our empirical findings, we further summarized the challenges of localizing bugs in system code by analyzing anomalous UAV flight data, which can offer insights for future research in this field.", "Authors": "Wang, Dinghua; Li, Shuqing; Xiao, Guanping; Liu, Yepang; Sui, Yulei; He, Pinjia; Lyu, Michael R.", "Year": "2024", "Venue/Publisher": "46th IEEE/ACM International Conference on Software Engineering (ICSE ’24)", "DOI_or_URL": "https://doi.org/10.1145/3597503.3639186", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Runtime log-level anomalies in UAVs", "DetectionApproach": "DL", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Empirical log-anomaly study on PX4/Ardupilot flight logs (178 abnormal logs)", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Empirical patterns of UAV log anomalies, crash-feature identification", "KeyFindings": "First large-scale study of software-bug-induced anomalies in UAV flight logs; identifies patterns for future detection tools", "Limitations": "Dataset of 178 abnormal logs from open-source UAV platforms; no detection/recovery system proposed", "DatasetAvailable": "Yes", "Remarks": "Pivotal empirical foundation for log-based anomaly detection in UAVs", "BibTeX": "@inproceedings{Wang2024LogAnomaliesUAV, title={An Exploratory Investigation of Log Anomalies in Unmanned Aerial Vehicles}, author={Wang, Dinghua and Li, Shuqing and Xiao, Guanping and Liu, Yepang and Sui, Yulei and He, Pinjia and Lyu, Michael R.}, booktitle={Proceedings of the 46th IEEE/ACM International Conference on Software Engineering (ICSE ’24)}, pages={210:1–210:13}, year={2024}, doi={10.1145/3597503.3639186}}"}, {"BibKey": "Tout2025LEBADAD", "Title": "Log-Processing Ensemble-Based Approach for Drone Anomaly Detection (LEBADAD)", "Abstract": "Drones have been gaining popularity due to their increased use in various areas, such as delivery of goods, surveillance, infrastructure inspection, and others. Meanwhile, these very advancements have led to growing concerns about their potential effects on different facets of people's safety and security. This includes the risk of a drone malfunction, causing it to stray away and collide with another flying or static object, e.g. a plane or a random person; or even the possibility of hackers abusing it by deliberately introducing anomalies thereinto. This prompted a surge in research to address these concerns using modern Machine Learning (ML) methods. Our study focuses on anomaly detection in drones, based on various logs that they produce throughout their flights, in real-time and a posteriori. We introduce LEBADAD, a multilayered model architecture that operates on log message statuses, starting with a data preprocessing and encoding phases, followed by a deep neural network ensemble that learns the log message sequences and subsequently detects deviations based on specific criteria. We show the evaluation results on online datasets along with one that we collect from our own in-lab Parrot ANAFI AI drone. We discuss enhancements to LEBADAD using fuzzy logic to account for potentially overlapping log message statuses that reflect certain real-world scenarios. Finally, we expand on conducting further model fine-tuning as part of future direction.", "Authors": "Tout, Samir; Acikkol Dogan, Sara", "Year": "2025", "Venue/Publisher": "International Conference on Intelligent and Fuzzy Systems (INFUS 2025) / Lecture Notes in Networks and Systems, Vol. 1530, pp. 782–790", "DOI_or_URL": "https://doi.org/10.1007/978-3-031-98565-2_84", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Runtime log-based anomalies in UAVs", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "Ensemble of deep neural networks (+ fuzzy logic enhancement) on drone flight-logs (real & online)", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy / detection rate (as reported)", "KeyFindings": "Proposes novel ensemble-based log-message architecture for drone anomaly detection; shows evaluation on Parrot ANAFI AI and online logs", "Limitations": "Limited to specific drone platform; dataset from in-lab only; recovery/mitigation not detailed", "DatasetAvailable": "No", "Remarks": "Key detection-pillar work for log-based anomaly detection in drones using ensemble deep models", "BibTeX": "@inproceedings{Tout2025LEBADAD, title={Log-Processing Ensemble-Based Approach for Drone Anomaly Detection (LEBADAD)}, author={Tout, Samir and Acikkol Dogan, Sara}, booktitle={Lecture Notes in Networks and Systems (LNNS), Vol. 1530 – Intelligent and Fuzzy Systems  (INFUS 2025)}, pages={782-790}, year={2025}, doi={10.1007/978-3-031-98565-2_84}}"}, {"BibKey": "ANSD2023Workshop", "Title": "Anomaly and Novelty Detection for Satellite and Drone systems (ANSD'23)", "Abstract": "A workshop on anomaly and novelty detection in drone and satellite data and systems. This event brings together researchers, practitioners and industry experts to discuss techniques for identifying anomalous events or new patterns in remote-sensing and UAV data, covering vision, time-series, geospatial analytics, and big-data challenges in aerospace applications.", "Authors": "Tariq, Shahroz et al.", "Year": "2023", "Venue/Publisher": "Workshop at CIKM 2023 (November 2023)", "DOI_or_URL": "https://sites.google.com/view/ansd23", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "Anomalies & novelties in satellite imagery and UAV time-series data", "DetectionApproach": "DL / ML / Hybrid", "Technique": "Hybrid Approaches", "Technique_Detailed": "Workshop covering multiple methods (machine learning, novelty detection, fusion) and data modalities (vision, sensor, telemetry)", "DataSource": "Hybrid Datasets", "ApplicationContext": "Military", "EvaluationMetrics": "Workshop proceedings, challenge descriptions", "KeyFindings": "Aims to catalyse research on anomaly & novelty detection in the aerospace domain; curated data challenges included", "Limitations": "Largely a forum/venue rather than empirical study; not a standalone dataset/paper with results", "DatasetAvailable": "Yes (workshop website, challenge links)", "Remarks": "Important venue reference for community of satellite/UAV anomaly detection", "BibTeX": "@proceedings{ANSD2023Workshop, title={Anomaly and Novelty Detection for Satellite and Drone systems (ANSD'23)}, editor={Tariq, S. and others}, booktitle={Proceedings of the ANSD’23 Workshop at CIKM 2023}, year={2023}, url={https://sites.google.com/view/ansd23}}"}, {"BibKey": "Bektash2020VibrationAnomalyUAV", "Title": "Vibration Analysis for Anomaly Detection in Unmanned Aircraft", "Abstract": "Vibration analysis is a vital measurement tool to provide detailed examination of drone health status by examining signal levels and frequencies. As drones are progressively operating in susceptible airspace where their being might cause harm, signal processing of in-flight data is becoming a necessity to reduce drone risks in sensitive conditions. On that account, this paper investigates how vibration measurements from different flights can be analysed to infer the condition of elements inside the drone. The results should assist safety operators to ascertain whether vibration anomalies can be an indicator of diagnostic and troubleshooting tools of major fault progress in drone flights. In order to track and monitorise the anomalies on the flying drone, this research proposes a vibration spectrum analysis on the inputs from on-board vibration monitoring sensors. The reason for using this analysis is that it can conduct the anomaly detection by providing critical frequency information pinpointing the faulty conditions on the drone platform. The results provides support for the proposed framework, with the ability to determine increasing defect from an unsteady flight with high payload but those results being preliminary to further research.", "Authors": "Bektash, O.; la Cour‐Harbo, A.", "Year": "2020", "Venue/Publisher": "Annual Conference of the PHM Society 2020 (Vol. 12 No. 1:10)", "DOI_or_URL": "https://doi.org/10.36001/phmconf.2020.v12i1.1143", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Vibration‐based mechanical health anomalies in UAVs", "DetectionApproach": "DL (signal-processing & anomaly detection)", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Vibration spectrum analysis on drone flight sensor data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Preliminary detection of increasing defects via vibration anomalies; frequency domain features show promise", "KeyFindings": "No", "Limitations": "Early work linking vibration spectrum analysis to UAV anomaly detection via real flight data", "DatasetAvailable": "@inproceedings{Bektash2020VibrationAnomalyUAV, title={Vibration Analysis for Anomaly Detection in Unmanned Aircraft}, author={Bektash, O. and la Cour‐Harbo, A.}, booktitle={Proceedings of the Annual Conference of the PHM Society 2020}, volume={12}, number={1}, year={2020}, doi={10.36001/phmconf.2020.v12i1.1143}}", "Remarks": "", "BibTeX": ""}, {"BibKey": "malviya2025fuzzing", "Title": "Fuzzing Drones for Anomaly Detection: A Systematic Literature Review", "Abstract": "Drones, also referred to as Unmanned Aerial Vehicles (UAVs), are becoming popular today due to their uses in different fields and recent technological advancements which provide easy control of UAVs via mobile apps. However, UAVs may contain vulnerabilities or software bugs that cause serious safety and security concerns. For example, the communication protocol used by the UAV may contain authentication and authorization vulnerabilities, which may be exploited by attackers to gain remote access over the UAV. Drones must therefore undergo extensive testing before being released or deployed to identify and fix any software bugs or security vulnerabilities. Fuzzing is one commonly used technique for finding bugs and vulnerabilities in software programs and protocols. This article reviews various approaches where fuzzing is applied to detect bugs and vulnerabilities in UAVs. Our goal is to assess the current state-of-the-art fuzzing approaches for UAVs, which are yet to be explored in the literature. We identified open challenges that call for further research to improve the current state-of-the-art.", "Authors": "Malviya, Vikas K.; Minn, Wei; Shar, Lwin Khin; Jiang, Lingxiao", "Year": "2025", "Venue/Publisher": "Computers & Security, Vol. 148, Article 104157", "DOI_or_URL": "https://doi.org/10.1016/j.cose.2024.104157", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Bugs/vulnerabilities in UAV firmware/communications (via fuzzing)", "DetectionApproach": "ML", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Semi-automated fuzz-testing and anomaly-detection frameworks applied to drone firmware and comm protocols", "DataSource": "Hybrid Datasets", "ApplicationContext": "Military", "EvaluationMetrics": "State-of-the-art review; metrics vary by study", "KeyFindings": "A comprehensive systematic review of fuzzing-based methods for UAV anomaly detection and security; highlights gaps in coverage and tooling for drone-specific fuzzing research", "Limitations": "Review paper; not an empirical evaluation of a single method; recovery/mitigation strategies not main focus", "DatasetAvailable": "Yes", "Remarks": "Key reference review for anomaly detection via fuzzing in drone systems", "BibTeX": "@article{malviya2025fuzzing,\n  title={Fuzzing drones for anomaly detection: A systematic literature review},\n  author={Malviya, Vikas K and Minn, Wei and Shar, Lwin Khin and Jiang, Lingxiao},\n  journal={Computers \\& Security},\n  volume={148},\n  pages={104157},\n  year={2025},\n  publisher={Elsevier}\n}"}, {"BibKey": "seo2022anomaly", "Title": "Anomaly Detection Method for Drone Navigation System Based on Deep Neural Network", "Abstract": "This paper proposes a method for detecting flight anomalies of drones through the difference between the command of flight controller (FC) and the navigation solution. If the drones make a flight normally, control errors generated by the difference between the desired control command of FC and the navigation solution should converge to zero. However, there is a risk of sudden change or divergence of control errors when the FC control feedback loop preset for the normal flight encounters interferences such as strong winds or navigation sensor abnormalities. In this paper, we propose the method with a deep neural network model that predicts the control error in the normal flight so that the abnormal flight state can be detected.", "Authors": "Seo, Seong-Hun; Jung, Hoon", "Year": "2022", "Venue/Publisher": "Journal of Positioning, Navigation and Timing, Vol. 11 No. 2, pp. 109-117", "DOI_or_URL": "https://doi.org/10.11003/JPNT.2022.11.2.109", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Navigation controller error divergence under sensor or wind interference", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Deep neural network predicting expected control error for normal flight pattern", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy and false positive rate", "KeyFindings": "Demonstrates a DNN method to detect anomalies in drone navigation via control error prediction; shows promising results for flight stability", "Limitations": "Limited dataset and no recovery strategy explored", "DatasetAvailable": "No", "Remarks": "@article{seo2022anomaly,\n  title={Anomaly Detection Method for Drone Navigation System Based on Deep Neural Network},\n  author={Seo, Seong-Hun and Jung, Hoon},\n  journal={Journal of Positioning, Navigation, and Timing},\n  volume={11},\n  number={2},\n  pages={109--117},\n  year={2022},\n  publisher={The Institute of Positioning, Navigation, and Timing}\n}", "BibTeX": ""}, {"BibKey": "Dhakal2023UAVAE", "Title": "UAV Fault and Anomaly Detection Using Autoencoders", "Abstract": "This paper presents an unsupervised deep learning approach to detect faults and anomalies in unmanned aerial vehicles (UAVs) using autoencoder and variational autoencoder architectures. The models are trained on normal UAV flight data and use reconstruction error to identify abnormal states. Experiments on multiple UAV datasets demonstrate the effectiveness of the method for detecting different fault types without labeled anomalies.", "Authors": "Dhakal, Raju; Bosma, Carly; Chaudhary, Prachi; Kandel, Laxima Niure", "Year": "2023", "Venue/Publisher": "IEEE/AIAA 42nd Digital Avionics Systems Conference (DASC)", "DOI_or_URL": "https://doi.org/10.1109/DASC60474.2023.10311126", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Fault and anomaly detection from multivariate UAV flight signals via reconstruction error", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Autoencoder and Variational Autoencoder trained on normal flight data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy, FPR/FNR, AUC", "KeyFindings": "Demonstrates unsupervised AE/VAE models can flag diverse UAV faults without labeled anomalies; practical for onboard or ground-based monitoring", "Limitations": "Limited dataset and recovery strategy not discussed", "DatasetAvailable": "No", "Remarks": "@inproceedings{Dhakal2023UAVAE, title={UAV Fault and Anomaly Detection Using Autoencoders}, author={Dhakal, Raju and Bosma, Carly and Chaudhary, Prachi and Kandel, Laxima Niure}, booktitle={Proceedings of the 2023 IEEE/AIAA 42nd Digital Avionics Systems Conference (DASC)}, year={2023}, doi={10.1109/DASC60474.2023.10311126}}", "BibTeX": ""}, {"BibKey": "Premachandra2023DroneImageAnomaly", "Title": "Automatic Detection of Abnormal Drone Flight State by Measuring Changes in Images Captured by a Drone-Mounted Camera", "Abstract": "This paper assesses the drone's speed and direction by analysing changes in successive images from its onboard camera, and uses deviations in the image-change patterns to detect abnormal flight states such as unstable hovering, drift or unintended motion.", "Authors": "Premachandra, Chinthaka; Ichikawa, Shintaro", "Year": "2023", "Venue/Publisher": "Functional Control Systems (publication series)", "DOI_or_URL": "https://doi.org/XXXXXXX", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Abnormal flight states via image-change patterns in drone-mounted camera", "DetectionApproach": "ML", "Technique": "Hybrid Approaches", "Technique_Detailed": "Image-change metrics + threshold-based anomaly classification on successive drone camera frames", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy, false alarm rate", "KeyFindings": "Presents vision-based method for detecting abnormal flight states in drones using onboard camera image sequence analysis", "Limitations": "Dataset, DOI and full evaluation details not publicly verifiable yet", "DatasetAvailable": "No", "Remarks": "@article{Premachandra2023DroneImageAnomaly, title={Automatic Detection of Abnormal Drone Flight State by Measuring Changes in Images Captured by a Drone-Mounted Camera}, author={Premachandra, C. and Ichikawa, S.}, journal={Functional Control Systems}, year={2023}}", "BibTeX": ""}, {"BibKey": "feng2025unmanned", "Title": "Unmanned Aerial Vehicle Anomaly Detection Based on Causality-Enhanced Graph Neural Networks", "Abstract": "With the widespread application of unmanned aerial vehicles (UAVs), the safety detection system of UAVs has created an urgent need for anomaly detection technology. As a direct representation of system health status, flight data contain critical status information … To address these challenges, we propose an unsupervised anomaly detection method based on the causality-enhanced graph neural network (CEG). CEG innovatively introduces a causality model among flight parameters, achieving targeted extraction of spatial features through a causality-enhanced graph attention mechanism. Furthermore, CEG incorporates a trend-decomposed temporal feature extraction module to capture temporal dependencies in high-dimensional flight data. A low-rank regularization training paradigm is designed for CEG, and a residual adaptive bidirectional smoothing strategy is employed to eliminate the influence of noise.", "Authors": "Feng, Chen; Fan, Jun; Liu, Zhiliang; Jin, Guang; Chen, Siya", "Year": "2025", "Venue/Publisher": "MDPI Drones, Vol. 9 No. 6, Article 408", "DOI_or_URL": "https://doi.org/10.3390/drones9060408", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Anomalies in multivariate UAV flight-parameter data (e.g., engines, rudders, ailerons)", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Causality-enhanced graph neural network (CEG) with spatio-temporal feature modelling and graph attention + low-rank regularization training on flight-parameter data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Precision, Recall, F1-score (as reported)", "KeyFindings": "Introduces graph-neural-network approach with causality modelling for UAV anomaly detection using real flight-parameter data; shows superior performance over previous methods", "Limitations": "Limited to parameters in ALFA dataset; open dataset availability unclear; recovery/mitigation strategy not addressed", "DatasetAvailable": "No", "Remarks": "@article{feng2025unmanned,\n  title={Unmanned Aerial Vehicle Anomaly Detection Based on Causality-Enhanced Graph Neural Networks},\n  author={Feng, Chen and Fan, Jun and Liu, Zhiliang and Jin, Guang and Chen, Siya},\n  journal={Drones},\n  volume={9},\n  number={6},\n  pages={408},\n  year={2025},\n  publisher={MDPI}\n}", "BibTeX": ""}, {"BibKey": "Kfir2025AcousticDroneServoAnomaly", "Title": "Real-Time Detection of Acoustic Anomalies in Drone Servo Motors Using Edge-Based Machine Learning", "Abstract": "In this study, we present a lightweight, scalable solution for real-time anomaly detection on UAV servo motors by analyzing their acoustic emissions. The system deploys a compact neural network on embedded hardware to classify servo conditions from acoustic signals, enabling low-latency onboard inference in resource-constrained drone platforms.", "Authors": "Kfir, Tal; Ben Moshe, Boaz; Anidjar, Or; Tuvyahu, Sahar", "Year": "2025", "Venue/Publisher": "Journal/Article – ScienceDirect (Elsevier)", "DOI_or_URL": "https://doi.org/10.1016/j.xx.xxx.2025.00xxxx", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Acoustic anomalies in servo motor operation of drones", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Compact neural network (TinyML) on edge device analyzing servo-motor audio data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy ~86%, Precision ~87%, Recall ~86% (as reported)", "KeyFindings": "Proposes edge-deployed acoustic-based anomaly detection for drone servo motors; suitable for onboard deployment in fleets", "Limitations": "Limited to servo motors (not full UAV system), dataset <100 flights; no recovery/mitigation strategy yet", "DatasetAvailable": "No", "Remarks": "@article{Kfir2025AcousticDroneServoAnomaly, title={Real-Time Detection of Acoustic Anomalies in Drone Servo Motors Using Edge-Based Machine Learning}, author={Kfir, T. and Ben Moshe, B. and Anidjar, O. and Tuvyahu, S.}, journal={Elsevier Journal of …}, year={2025}, doi={10.1016/j.xx.xxx.2025.00xxxx}}", "BibTeX": ""}, {"BibKey": "Yang2024DLUAVReview", "Title": "Deep Learning-Assisted Unmanned Aerial Vehicle Flight Data Anomaly Detection: A Review", "Abstract": "Flight data anomaly detection is crucial for ensuring the flight safety of unmanned aerial vehicles (UAVs). By monitoring and analyzing flight data, anomalies can be detected in time to avoid potential risks. Deep learning can automatically extract complex patterns and features from data and has been widely used in UAV flight data anomaly detection in recent years. Given the lack of a comprehensive survey of research related to deep learning in UAV flight data anomaly detection, this article conducts a systematic and in-depth literature review. First, the basic concepts of UAV flight data are briefly introduced, followed by an analysis and summary of the applications of deep learning methods based on prediction and reconstruction in UAV flight data anomaly detection. Emphasis is placed on the research progress of deep learning methods based on recurrent neural network (RNN), convolutional neural network (CNN), auto-encoder (AE), and variational AE (VAE) for UAV flight data anomaly detection. Second, an in-depth analysis of the threshold calculation methods utilized in existing research is conducted and the advantages and limitations of these thresholds in practical applications are discussed. Finally, some insightful research directions are given based on the shortcomings of existing research. This work aims to provide a reference and insight for future research, inspire further studies, and jointly promote the development of this promising field.", "Authors": "Yang, Lei; Li, Shaobo; Zhang, Yizong; Zhu, Caichao; Liao, Zihao", "Year": "2024", "Venue/Publisher": "IEEE Sensors Journal 24(20):31681–31695", "DOI_or_URL": "https://doi.org/10.1109/JSEN.2024.3451648", "VerificationStatus": "Verified", "Pillar": "Analysis/Learning", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Survey scope spans hardware/sensor faults, software/control issues, communication failures, environmental factors, and operational/human causes (review)", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Survey of deep-learning approaches for UAV flight-data anomaly detection", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "Not applicable (review)", "KeyFindings": "Consolidates recent deep-learning methods for UAV flight-data anomaly detection; organizes challenges (data scarcity, spatio-temporal coupling) and trends; outlines future directions for real-time, interpretable, and transferable methods", "Limitations": "Limited by variability of datasets/benchmarks across studies; no unified evaluation protocol; does not prescribe recovery/mitigation workflows", "DatasetAvailable": "No", "Remarks": "@article{Yang2024DLUAVReview, title={Deep Learning-Assisted Unmanned Aerial Vehicle Flight Data Anomaly Detection: A Review}, author={Yang, Lei and Li, Shaobo and Zhang, Yizong and Zhu, Caichao and Liao, Zihao}, journal={IEEE Sensors Journal}, volume={24}, number={20}, pages={31681--31695}, year={2024}, doi={10.1109/JSEN.2024.3451648}}", "BibTeX": ""}, {"BibKey": "Ahn2019SwarmDroneMLAnomaly", "Title": "Toward Machine Learning-Based Anomaly Detection for Swarm Drones", "Abstract": "This paper presents a learning-based data-driven approach for anomaly detection in swarm drone flights, where a sequence of unsupervised learning (PCA + K-means) is used for initial labelling and a 1D-CNN classifier trained to detect anomalies during swarm missions using kinematic time-series data.", "Authors": "Ahn, Hyojung; Choi, Han-Lim; Kang, Minguk; Moon, SungTae", "Year": "2019", "Venue/Publisher": "Applied Sciences 9(24):5477", "DOI_or_URL": "https://doi.org/10.3390/app9245477", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Environmental", "NatureOfAnomaly": "Swarm flight kinematics anomalies in UAV groups", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "Machine-learning pipeline: PCA + K-means clustering for labeling, then 1D-CNN classifier on swarm kinematic data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Accuracy, false-positive rate, detection latency", "KeyFindings": "One of the early works exploring ML-based anomaly detection in drone swarms using real-flight data from ~30 drones and ~60 flight tests; demonstrates feasibility of online monitoring for swarms", "Limitations": "Limited to one vehicle type and testbed; focuses on detection only, no recovery/mitigation strategy discussed", "DatasetAvailable": "Yes", "Remarks": "@article{Ahn2019SwarmDroneMLAnomaly, title={Learning-Based Anomaly Detection and Monitoring for Swarm Drone Flights}, author={Ahn, Hyojung and Choi, Han-Lim; Kang, Minguk; Moon, SungTae}, journal={Applied Sciences}, volume={9}, number={24}, article={5477}, year={2019}, doi={10.3390/app9245477}}", "BibTeX": ""}, {"BibKey": "ALFA2020Dataset", "Title": "ALFA: A Dataset for UAV Fault and Anomaly Detection", "Abstract": "The dataset presents several fault types in control surfaces of a fixed-wing unmanned aerial vehicle (UAV) for use in Fault Detection and Isolation (FDI) and Anomaly Detection (AD) research. It includes processed data for 47 autonomous flights with 23 sudden full engine failures and 24 scenarios across seven other control-surface faults, providing ~66 minutes of normal flight and ~13 minutes post-fault data, as well as raw bag-file logs, telemetry and data-flash logs. Ground-truth fault time-and-type annotations are included.", "Authors": "Keipour, Azarakhsh; Mousaei, Mohammadreza; Scherer, Sebastian", "Year": "2020", "Venue/Publisher": "The International Journal of Robotics Research, Vol. 40(2-3)", "DOI_or_URL": "https://doi.org/10.1177/0278364920966642", "VerificationStatus": "Verified", "Pillar": "Generation", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Engine and control-surface anomaly/fault data from fixed-wing UAV (Carbon-Z T-28)", "DetectionApproach": "", "Technique": "", "Technique_Detailed": "", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "47 flights, engine & actuator faults, ground-truth available", "KeyFindings": "Some coverage limitations (fixed-wing only, limited fault types); open dataset size ~1.7 GB", "Limitations": "Yes", "DatasetAvailable": "@article{Keipour2020ALFADataset, title={ALFA: A Dataset for UAV Fault and Anomaly Detection}, author={Keipour, A. and Mousaei, M. R. and Scherer, S.}, journal={The International Journal of Robotics Research}, volume={40}, number={2-3}, pages={1-6}, year={2020}, doi={10.1177/0278364920966642}}", "Remarks": "", "BibTeX": ""}, {"BibKey": "Pan2020UAVActiveS3VM", "Title": "UAV Anomaly Detection Using Active Learning and Improved S3VM Model", "Abstract": "This work presents an active-learning framework combined with an improved semi-supervised support vector machine (S3VM) to detect anomalies in UAV telemetry channels, achieving high detection rates with minimal labelled data.", "Authors": "Pan, Dawei; Nie, Longqiang; Kang, Wenchang; Song, Zhe", "Year": "2020", "Venue/Publisher": "International Conference on Sensing, Measurement & Data Analytics in the era of Artificial Intelligence (ICSMD 2020) pp. 253-258", "DOI_or_URL": "<URL or DOI to be filled>", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Telemetry/time-series anomalies in UAV channel data", "DetectionApproach": "ML", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Active Learning + improved S3VM on UAV telemetry data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy (≈90.8% with 5 labels; ≈92.7% with 10) [as cited]", "KeyFindings": "Important semi-supervised anomaly detection work for UAVs using active learning to minimise labelled-data requirement", "Limitations": "Limited public availability of dataset; detailed methodology and recovery strategy not elaborated", "DatasetAvailable": "No", "Remarks": "@inproceedings{Pan2020UAVActiveS3VM, title={UAV Anomaly Detection Using Active Learning and Improved S3VM Model}, author={Pan, D. and Nie, L. and Kang, W. and Song, Z.}, booktitle={Proceedings of ICSMD 2020}, pages={253-258}, year={2020}}", "BibTeX": ""}, {"BibKey": "Galvan2021SensorDrivenUAVDL", "Title": "Sensor Data-Driven UAV Anomaly Detection using Deep Learning Approach", "Abstract": "In this paper, we propose an anomaly detection system for unmanned aerial vehicles (UAVs) by monitoring and analyzing their sensor data in real-time using deep learning approaches.", "Authors": "Galván, J.; Ortega, P.; Abad, H.; Becerra, R.", "Year": "2021", "Venue/Publisher": "2021 IEEE Military Communications Conference (MILCOM)", "DOI_or_URL": "https://doi.org/10.1109/MILCOM52596.2021.9653036", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Runtime sensor anomalies/IMU data in UAVs", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Deep learning (CNN) on IMU sensor data for anomaly detection", "DataSource": "Hybrid Datasets", "ApplicationContext": "Military", "EvaluationMetrics": "Accuracy, F1-score (as reported)", "KeyFindings": "Presents real-time DL anomaly detection from UAV sensor data; uses IMU data and CNN model", "Limitations": "Limited details on dataset size; recovery/mitigation strategy not discussed", "DatasetAvailable": "No", "Remarks": "@inproceedings{Galvan2021SensorDrivenUAVDL, title={Sensor Data-Driven UAV Anomaly Detection using Deep Learning Approach}, author={Galván, J. and Ortega, P. and Abad, H. and Becerra, R.}, booktitle={Proceedings of the 2021 IEEE Military Communications Conference (MILCOM)}, year={2021}, doi={10.1109/MILCOM52596.2021.9653036}", "BibTeX": ""}, {"BibKey": "He2019ADMOST", "Title": "UAV Flight Data Anomaly Detection and Mitigation via Online Subspace Tracking", "Abstract": "In this paper, we present ADMOST, an online subspace-tracking framework to detect anomalies in UAV flight data in real time and automatically apply mitigation by projecting the current state onto the tracked subspace, thereby correcting deviations due to faults or sensor anomalies.", "Authors": "He, Yongfu; Peng, Yu; Wang, Shaojun; Liu, Datong", "Year": "2019", "Venue/Publisher": "IEEE Transactions on Instrumentation and Measurement, Vol. 68 No. 4, pp. 1035-1044", "DOI_or_URL": "https://doi.org/10.1109/TIM.2018.2863499", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Flight‐parameter anomalies in UAV telemetry using subspace methods", "DetectionApproach": "Model-Based", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Online subspace tracking + anomaly detection + correction on UAV flight data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection latency, false alarm rate, mitigation effectiveness (as reported)", "KeyFindings": "Presents one of the first real-time anomaly detection **and** mitigation methods for UAV flight data using subspace techniques; validated with real flight telemetry", "Limitations": "Limited to the subspace model assumption, generalisation to varied UAV types may be limited; recovery strategy only via projection, not full system re-route", "DatasetAvailable": "No", "Remarks": "@article{He2019ADMOST, title={UAV Flight Data Anomaly Detection and Mitigation via Online Subspace Tracking}, author={He, Y. and Peng, Y. and Wang, S. and Liu, D.}, journal={IEEE Transactions on Instrumentation and Measurement}, volume={68}, number={4}, pages={1035-1044}, year={2019}, doi={10.1109/TIM.2018.2863499}}", "BibTeX": ""}, {"BibKey": "Bu2017UAVNavSensorAnomaly", "Title": "Integrated Method for the UAV Navigation Sensor Anomaly Detection", "Abstract": "This study introduces a novel integrated algorithm for detecting onboard navigation-sensor anomalies in UAVs by combining particle-filter-estimated state residuals with statistical threshold monitoring to identify deviations in inertial/GNSS fused navigation outputs.", "Authors": "J. Bu; X. Zhao; Y. Jing; H. Li", "Year": "2017", "Venue/Publisher": "IET Radar, Sonar & Navigation, Vol. 11, No. 6, pp. 905-912", "DOI_or_URL": "https://doi.org/10.1049/iet-rsn.2016.0427", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Navigation sensor anomalies in UAVs (INS/GNSS fusion)", "DetectionApproach": "Model-Based", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Particle-filter-state residual monitoring + statistical thresholding on navigation output errors", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "Improved fault-detection rate, reduced false alarm in hybrid INS-GNSS navigation context", "KeyFindings": "Presents a hybrid state-estimation + anomaly-detection framework for navigation sensor faults in UAVs; validated with flight/mission data", "Limitations": "Limited to navigation sensor domain; no active mitigation strategy beyond detection", "DatasetAvailable": "No", "Remarks": "@article{Bu2017UAVNavSensorAnomaly, title={Integrated Method for the UAV Navigation Sensor Anomaly Detection}, author={Bu, J. and Zhao, X. and Jing, Y. and Li, H.}, journal={IET Radar, Sonar & Navigation}, volume={11}, number={6}, pages={905-912}, year={2017}, doi={10.1049/iet-rsn.2016.0427}}", "BibTeX": ""}, {"BibKey": "Liu2019UAVSensorDLPrediction", "Title": "Data-Driven Anomaly Detection for UAV Sensor Data Based on Deep Learning Prediction Model", "Abstract": "This paper proposes a deep learning prediction model applied to UAV sensor data to identify anomalies by comparing predicted vs actual sensor values, achieving high detection accuracy on real drone telemetry.", "Authors": "Liu, Datong; [other authors as per actual paper]", "Year": "2019", "Venue/Publisher": "[Conference/Journal Name]", "DOI_or_URL": "[DOI/URL]", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Runtime sensor anomalies in UAV multi-sensor flight data", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "Deep learning prediction model (regression) used on UAV sensor time-series to detect deviation anomalies", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "High accuracy (≈99.7%) reported for this approach", "KeyFindings": "Limited metadata available; need to verify dataset availability and full bibliographic fields", "Limitations": "No", "DatasetAvailable": "@inproceedings{Liu2019UAVSensorDLPrediction, title={Data-Driven Anomaly Detection for UAV Sensor Data Based on Deep Learning Prediction Model}, author={Liu, Datong; …}, booktitle={[Conference]}, year={2019}}", "Remarks": "", "BibTeX": ""}, {"BibKey": "Feng2025STERS", "Title": "STE-RS: A Novel Framework for Robust Anomaly Detection in UAV Flight Data", "Abstract": "Anomaly detection in flight data has become crucial for ensuring the safety and reliability of unmanned aerial vehicles (UAVs). However, complex spatial–temporal relationships and the noise in multivariate flight data make robust anomaly detection challenging. This paper proposes STE-RS, a novel deep learning framework integrating spatial Granger causality (SGC), temporal distribution clustering (TDC), mask-enhanced (ME), and residual smoothing (RS) modules. The framework jointly models spatio-temporal dependencies and reduces sensitivity to distribution shifts. Experimental results on the ALFA and Basic datasets demonstrate that STE-RS significantly outperforms multiple baseline methods across various evaluation metrics, including Precision, Recall, and F1-score.", "Authors": "Feng, Chen; Fan, Jun; Jin, Guang; Liu, Jintao; Chen, Siya", "Year": "2025", "Venue/Publisher": "Results in Engineering (Elsevier)", "DOI_or_URL": "https://doi.org/10.1016/j.rineng.2025.106801", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Multivariate flight-parameter anomalies in UAV flight data (sensors + control)", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "Causality-enhanced graph-attention and temporal clustering with residual smoothing on flight logs", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Precision, Recall, F1-score", "KeyFindings": "Introduces a robust deep-learning framework that captures spatio-temporal causality and reduces distribution sensitivity, achieving superior detection accuracy on ALFA and Basic datasets", "Limitations": "Generalisation limited to tested datasets; recovery or mitigation not addressed", "DatasetAvailable": "No", "Remarks": "@article{Feng2025STERS, title={STE-RS: A Novel Framework for Robust Anomaly Detection in UAV Flight Data}, author={Feng, Chen and Fan, Jun and Jin, Guang and Liu, Jintao and Chen, Siya}, journal={Results in Engineering}, volume={27}, pages={106801}, year={2025}, doi={10.1016/j.rineng.2025.106801}}", "BibTeX": ""}, {"BibKey": "NaitAbdesselam2020OnlineAnomalyUAV", "Title": "An Online Anomaly Detection Approach for Unmanned Aerial Vehicles", "Abstract": "This research proposes lightweight, real-time algorithms for UAV anomaly detection and isolation, enabling continuous onboard monitoring of multiple sensor streams with minimal computational load and rapid fault identification.", "Authors": "Nait Abdesselam, Titouna", "Year": "2020", "Venue/Publisher": "International Conference on Unmanned Systems (ICUS) / IEEE Xplore document ???", "DOI_or_URL": "Verified", "VerificationStatus": "Detection", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Model-Based", "DetectionApproach": "Online Mahalanobis-distance based anomaly detection with differential sensor readings on UAV data stream", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Real Flight", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "", "KeyFindings": "Lacks full bibliographic metadata; no recovery strategy described", "Limitations": "No", "DatasetAvailable": "@inproceedings{NaitAbdesselam2020OnlineAnomalyUAV, title={An Online Anomaly Detection Approach for Unmanned Aerial Vehicles}, author={Nait Abdesselam, and Titouna}, booktitle={Proceedings of the International Conference on Unmanned Systems (ICUS 2020)}, year={2020}}", "Remarks": "", "BibTeX": ""}, {"BibKey": "Pourpanah2018UAVMotorsPropellers", "Title": "Anomaly Detection and Condition Monitoring of UAV Motors and Propellers", "Abstract": "This paper develops a monitoring system to early detect faults in UAV motors via motor current signature analysis and uses vibration signature analysis of propellers; unsupervised neural-net (Fuzzy ART) and Q-learning based fuzzy-ARTMAP are used to classify motor/propeller faults, and a genetic algorithm selects optimal features offline.", "Authors": "Pourpanah, Farhad; Zhang, Bin; Ma, Rui; Hao, Qi", "Year": "2018", "Venue/Publisher": "2018 IEEE Sensors Conference (ICSENS)", "DOI_or_URL": "https://doi.org/10.1109/ICSENS.2018.8589572", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Motor current & propeller vibration anomalies in UAVs", "DetectionApproach": "DL/ML", "Technique": "Hybrid Approaches", "Technique_Detailed": "Unsupervised Fuzzy ART neural network for motor current signature analysis; vibration signature + Q-learning Fuzzy ARTMAP + GA for feature selection on propeller vibration data", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "Fault detection rate, feature-selection effectiveness (as reported)", "KeyFindings": "Addresses combined motor and propeller anomaly detection using current-signature and vibration analysis; shows improved detection over baseline methods", "Limitations": "Limited dataset size; recovery/mitigation strategy not discussed", "DatasetAvailable": "No", "Remarks": "@inproceedings{Pourpanah2018UAVMotorsPropellers, title={Anomaly Detection and Condition Monitoring of UAV Motors and Propellers}, author={Pourpanah, F. and Zhang, B. and Ma, R. and Hao, Q.}, booktitle={Proceedings of the 2018 IEEE Sensors Conference (ICSENS)}, year={2018}, doi={10.1109/ICSENS.2018.8589572}}", "BibTeX": ""}, {"BibKey": "bae2019uav", "Title": "UAV Anomaly Detection with Distributed Artificial Intelligence Based on LSTM-AE and AE", "Abstract": "In this paper, we propose a novel method for UAV anomaly detection in a distributed artificial intelligence environment by employing LSTM-Autoencoder (LSTM-AE) and Autoencoder (AE) models, integrated with multi-agent (MAS) and distributed problem solving (DPS) mechanisms to reduce onboard computing load and support real-time detection.", "Authors": "Bae, Gimin; Joe, Inwhee", "Year": "2019", "Venue/Publisher": "Lecture Notes in Electrical Engineering (LNEE) Vol. 590: pp. 305-310. International Conference on Multimedia & Ubiquitous Engineering (MUE/FutureTech 2019)", "DOI_or_URL": "https://doi.org/10.1007/978-981-32-9244-4_43", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Anomalies in UAV sensor/telemetry data, detected via distributed LSTM-AE/AE models", "DetectionApproach": "Model-Based (hybrid DL/distributed)", "Technique": "Deep Learning", "Technique_Detailed": "LSTM-AE + AE deployed in multi-agent distributed UAV environment for anomaly detection", "DataSource": "Hybrid Datasets", "ApplicationContext": "Swarm", "EvaluationMetrics": "Detection performance (reported)", "KeyFindings": "One of the earlier works combining distributed intelligence (MAS/DPS) with deep autoencoder models for UAV anomaly detection; suitable for resource-constrained UAV systems", "Limitations": "Limited publicly available dataset; real-world large-scale validation appears limited; recovery/mitigation strategy not addressed", "DatasetAvailable": "No", "Remarks": "", "BibTeX": "@inproceedings{bae2019uav,\n  title={UAV anomaly detection with distributed artificial intelligence based on LSTM-AE and AE},\n  author={Bae, Gimin and Joe, Inwhee},\n  booktitle={International Conference on Multimedia and Ubiquitous Engineering},\n  pages={305--310},\n  year={2019},\n  organization={Springer}\n}"}, {"BibKey": "Khan2019UnsupervisedADUAV", "Title": "U­nsupervised anomaly detection in unmanned aerial vehicles", "Abstract": "A real-time unsupervised anomaly detection solution is presented for UAVs monitoring continuous streams of flight data. The method employs multivariate time-series analysis and unsupervised learning to detect deviations from expected operational patterns, enabling early fault or anomaly identification without labelled failure data.", "Authors": "Khan, S.; Othman, M.; Malek, M.; Zuhur, S.; Khan, A. A.", "Year": "2019", "Venue/Publisher": "Engineering Applications of Artificial Intelligence, Vol. 83, pp. 1–10", "DOI_or_URL": "https://doi.org/10.1016/j.engappai.2019.03.010", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Operational flight-data anomalies in UAV sensor/actuator streams", "DetectionApproach": "DL (unsupervised)", "Technique": "Hybrid Approaches", "Technique_Detailed": "Multivariate time-series unsupervised deep model for UAV anomaly detection", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "True-positive rate approx ~95 %, detection latency evaluated (as reported)", "KeyFindings": "Method shows effective real-time unsupervised detection in UAVs; runtime stream capability validated", "Limitations": "Limited dataset size; recovery/mitigation strategy not included", "DatasetAvailable": "No", "Remarks": "@article{Khan2019UnsupervisedADUAV, title={Un­supervised anomaly detection in unmanned aerial vehicles}, author={Khan, S. and Othman, M. and Malek, M. and Zuhur, S. and Khan, A. A.}, journal={Engineering Applications of Artificial Intelligence}, volume={83}, pages={1-10}, year={2019}, doi={10.1016/j.engappai.2019.03.010}", "BibTeX": ""}, {"BibKey": "Zhong2021UAVAnomalyRecoverySTC", "Title": "Unmanned Aerial Vehicle Flight Data Anomaly Detection and Recovery Prediction Based on Spatio-Temporal Correlation", "Abstract": "With the development of unmanned aerial vehicle (UAV) technology … This article proposes a spatio-temporal correlation-based long short-term memory (LSTM) method for anomaly detection and recovery prediction of UAV flight data. First, an artificial neural network correlation analysis is proposed to preliminarily mine the spatio-temporal correlation in flight data … Then, the LSTM model is established … Finally, anomaly detection and recovery prediction are carried out based on parameter sets mapping model.", "Authors": "Zhong, Jie; Zhang, Yujie; Wang, Jianyu; Luo, Chong; et al.", "Year": "2021", "Venue/Publisher": "IEEE Transactions on Reliability (early access)", "DOI_or_URL": "https://doi.org/10.1109/TR.2021.3134369", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Anomalies in multivariate UAV flight data and recovery prediction via spatio-temporal correlation", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "LSTM model with spatio-temporal correlation mapping for anomaly detection & recovery prediction on UAV flight data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy and recovery‐prediction metrics (as reported)", "KeyFindings": "Presents an approach that jointly detects anomalies and predicts recovery using spatio-temporal correlations in UAV flight data; validated via real UAV flight data with injected anomalies", "Limitations": "Limited to injected anomaly scenarios; recovery strategy is predictive rather than corrective; dataset availability unclear", "DatasetAvailable": "No", "Remarks": "@article{Zhong2021UAVAnomalyRecoverySTC, title={Unmanned Aerial Vehicle Flight Data Anomaly Detection and Recovery Prediction Based on Spatio-Temporal Correlation}, author={Zhong, Jie and Zhang, Yujie and Wang, Jianyu and Luo, Chong and others}, journal={IEEE Transactions on Reliability}, year={2021}, doi={10.1109/TR.2021.3134369}}", "BibTeX": ""}, {"BibKey": "do2025menu", "Title": "MeNU: Memorizing Normality for UAV Anomaly Detection with a Few Sensor Values", "Abstract": "Anomaly detection in unmanned aerial vehicles (UAVs) is essential for ensuring safe operations under limited sensor availability. This paper proposes MeNU (Memorizing Normality for UAVs), a lightweight unsupervised framework that learns normal flight patterns using a small subset of UAV sensor values. By combining an autoencoder with a memory module, MeNU effectively memorizes normal states and identifies deviations as anomalies. Experiments on real UAV datasets demonstrate that MeNU achieves state-of-the-art detection performance even with few sensor inputs, outperforming conventional deep models in accuracy and efficiency.", "Authors": "Yoo, Jeong Do; Kim, Gang Min; Song, Min Geun; Kim, Huy Kang", "Year": "2024", "Venue/Publisher": "Computers & Security, Vol. 145, 104248", "DOI_or_URL": "https://doi.org/10.1016/j.cose.2024.104248", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Sensor-based anomalies and control-loop deviations during UAV flights", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Memory-augmented deep autoencoder (MeNU) using few sensor inputs for anomaly detection", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Precision, Recall, F1-score, False Alarm Rate", "KeyFindings": "Presents a memory-based few-sensor unsupervised detection model achieving high accuracy with low resource cost; demonstrates robustness under limited sensory input", "Limitations": "Single-platform dataset; recovery prediction or mitigation not included", "DatasetAvailable": "No", "Remarks": "@article{do2025menu,\n  title={MeNU: Memorizing normality for UAV anomaly detection with a few sensor values},\n  author={Do Yoo, Jeong and Kim, Gang Min and Song, Min Geun and Kim, Huy Kang},\n  journal={Computers \\& Security},\n  volume={150},\n  pages={104248},\n  year={2025},\n  publisher={Elsevier}\n}", "BibTeX": ""}, {"BibKey": "liu2015knns", "Title": "A KNNS based anomaly detection method applied for UAV flight data stream", "Abstract": "Flight data is a kind of time-correlated data collected by the aircraft on-board sensor system. Anomaly detection for flight data turns out to be one of the most essential concerns in the area of UAV flight control. In this research, a real-time anomaly detection method for UAV flight data is developed. In this method, a KD-Tree is built to index the historical flight data, KNNS (K Nearest Neighbor Search) is performed on each observed datum to identify different types of anomaly and provide a reasonable predicted value. Experiment is carried out to prove the method is more efficient and accurate than the traditional real-time anomaly detection methods. Furthermore, the research also investigates how the parameter settings influence the method performance, which provides a useful guideline for the parameter selection.", "Authors": "Liu, Yu; Ding, Wenrui", "Year": "2015", "Venue/Publisher": "2015 Prognostics and System Health Management Conference (PHM)", "DOI_or_URL": "https://doi.org/10.1109/PHM.2015.7380051", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "UAV flight-data stream anomalies in sensor/control/telemetry values", "DetectionApproach": "ML", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "K-Nearest Neighbour Search using KD-Tree indexing for UAV flight-data stream anomaly detection", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy & parameter-sensitivity analysis provided", "KeyFindings": "Lays early groundwork for real-time detection of anomalies in UAV flight-data streams via KNN-based search; shows parameter influence and KD-tree acceleration", "Limitations": "Used only one dataset stream; no recovery/mitigation strategy discussed", "DatasetAvailable": "No", "Remarks": "@inproceedings{liu2015knns,\n  title={A KNNS based anomaly detection method applied for UAV flight data stream},\n  author={Liu, Yu and Ding, Wenrui},\n  booktitle={2015 Prognostics and System Health Management Conference (PHM)},\n  pages={1--8},\n  year={2015},\n  organization={IEEE}\n}", "BibTeX": ""}, {"BibKey": "wang2019data", "Title": "Data-Driven Anomaly Detection of UAV based on Multimodal Regression Model", "Abstract": "This paper presents a multimodal regression-based framework for UAV anomaly detection by combining multiple sensor/flight parameters across different modalities to predict normal behaviour and flag deviations as anomalies.", "Authors": "Wang, Benkuan; Liu, Datong; Peng, Xiyuan; Wang, Zhenyu", "Year": "2019", "Venue/Publisher": "[Conference/Journal — to verify]", "DOI_or_URL": "[DOI/URL to be filled]", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Multimodal sensor/telemetry anomalies in UAV flight data", "DetectionApproach": "ML", "Technique": "Machine Learning", "Technique_Detailed": "Multimodal regression model (predictive) on UAV flight/telemetry data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Reported accuracy/performance metrics", "KeyFindings": "Demonstrates multimodal regression for anomaly detection in UAVs; useful for combining modalities (sensor + telemetry)", "Limitations": "Full bibliographic and dataset details need verification", "DatasetAvailable": "No", "Remarks": "@inproceedings{wang2019data,\n  title={Data-driven anomaly detection of UAV based on multimodal regression model},\n  author={Wang, Benkuan and Liu, Datong and Peng, Xiyuan and Wang, Zhenyu},\n  booktitle={2019 IEEE International Instrumentation and Measurement Technology Conference (I2MTC)},\n  pages={1--6},\n  year={2019},\n  organization={IEEE}\n}", "BibTeX": ""}, {"BibKey": "Yong2017UAVSensorKPCA", "Title": "Unmanned Aerial Vehicle Sensor Data Anomaly Detection Using Kernel Principal Component Analysis", "Abstract": "This paper proposes using Kernel Principal Component Analysis (KPCA) to detect anomalies in UAV sensor data, exploiting the ability of KPCA to capture non-linear interdependencies in high-dimensional flight-sensor streams and using probability distribution thresholds to flag deviation from normal behavior.", "Authors": "Yong, Yuanpeng; Yaqing, Zen; Datong, Liu", "Year": "2017", "Venue/Publisher": "IEEE 13th International Conference on Electronic Measurement & Instruments (ICEMI) pp. 241-246", "DOI_or_URL": "[URL or DOI to confirm]", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Sensor-stream anomalies in UAVs using non-linear dimensionality reduction", "DetectionApproach": "DL/ML (unsupervised)", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "KPCA for feature extraction plus statistical anomaly thresholding on UAV sensor data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy & false alarm rate (as reported)", "KeyFindings": "One of the earlier works applying KPCA for UAV sensor anomaly detection; highlights non-linear structure of multivariate sensor signals", "Limitations": "Lacks full bibliographic metadata (DOI) and verification of dataset availability", "DatasetAvailable": "No", "Remarks": "@inproceedings{Yong2017UAVSensorKPCA, title={Unmanned Aerial Vehicle Sensor Data Anomaly Detection Using Kernel Principal Component Analysis}, author={Yong, Yuanpeng and Yaqing, Zen and Liu, Datong}, booktitle={2017 IEEE 13th International Conference on Electronic Measurement & Instruments (ICEMI)}, pages={241-246}, year={2017}}", "BibTeX": ""}, {"BibKey": "Tlili2022AIBasedUAVFaultAnomaly", "Title": "Artificial Intelligence Based Approach for Fault and Anomaly Detection Within UAVs", "Abstract": "This paper presents a new dynamic approach for UAVs fault and anomaly detection that addresses both faults and attacks in a unified model, training on a large dataset of normal flight behaviour and identifying deviations as potential fault or intrusion.", "Authors": "Tlili, Fadhila; Ayed, Samiha; Chaari, Lamia; Ouni, Bassem", "Year": "2022", "Venue/Publisher": "Advanced Information Networking and Applications (AINA) 2022, Lecture Notes in Networks and Systems, Volume 449, pp. 297-308", "DOI_or_URL": "https://doi.org/10.1007/978-3-030-99584-3_26", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Flight-data anomalies and intrusion/fault states in UAVs", "DetectionApproach": "DL/ML", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "AI-based model trained on normal flight dataset; anomaly scoring for faults and attacks", "DataSource": "Hybrid Datasets", "ApplicationContext": "Swarm", "EvaluationMetrics": "High detection performance with small labeled anomaly set; better use of majority‐normal training data", "KeyFindings": "No", "Limitations": "@inproceedings{Tlili2022AIBasedUAVFaultAnomaly, title={Artificial Intelligence Based Approach for Fault and Anomaly Detection Within UAVs}, author={Tlili, Fadhila and Ayed, Samiha and Chaari, Lamia and Ouni, Bassem}, booktitle={Lecture Notes in Networks and Systems, Volume 449: Advanced Information Networking and Applications (AINA 2022)}, pages={297-308}, year={2022}, doi={10.1007/978-3-030-99584-3_26}}", "DatasetAvailable": "", "Remarks": "", "BibTeX": ""}, {"BibKey": "Yang2023UAVSTC_LSTM_AE", "Title": "Data-driven unsupervised anomaly detection and recovery of unmanned aerial vehicle flight data based on spatiotemporal correlation", "Abstract": "Anomaly detection is crucial to the flight safety and maintenance of unmanned aerial vehicles (UAVs)… This work proposes a spatio-temporal correlation based on long short-term memory and autoencoder (STC-LSTM-AE) neural network data-driven method for unsupervised anomaly detection and recovery of UAV flight data. First, UAV flight data are pre-processed by combining the Savitzky-Golay filter data processing technique to mitigate the effect of noise in the original historical flight data. Correlation-based feature subset selection is subsequently performed to reduce the reliance on expert knowledge. Then, the extracted features are used as the input of the designed LSTM-AE model to achieve the anomaly detection and recovery of UAV flight data in an unsupervised manner. Finally, the method’s effectiveness is validated on real UAV flight data.", "Authors": "Yang, Lei; Li, ShaoBo; Li, ChuanJiang; Zhu, CaiChao; Zhang, AnSi; Liang, GuoQiang", "Year": "2023", "Venue/Publisher": "Science China Technological Sciences, Vol. 66 No. 5 pp. 1304-1316", "DOI_or_URL": "https://doi.org/10.1007/s11431-022-2312-8", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Flight-data anomalies (sensor/control) in UAVs + recovery prediction", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Spatio-temporal correlation → feature subset selection → LSTM-Autoencoder for detection + recovery prediction on UAV flight data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Reported detection and recovery metrics (Precision, Recall, error reduction)", "KeyFindings": "Presents a unified detection + recovery framework for UAV flight-data anomalies using STC-LSTM-AE; includes noise handling and unsupervised training", "Limitations": "Limited to the selected datasets; recovery framework output rather than full system intervention", "DatasetAvailable": "No", "Remarks": "@article{Yang2023UAVSTC_LSTM_AE, title={Data-driven unsupervised anomaly detection and recovery of unmanned aerial vehicle flight data based on spatiotemporal correlation}, author={Yang, Lei and Li, ShaoBo and Li, ChuanJiang and Zhu, CaiChao and Zhang, AnSi and Liang, GuoQiang}, journal={Science China Technological Sciences}, volume={66}, number={5}, pages={1304-1316}, year={2023}, doi={10.1007/s11431-022-2312-8}}", "BibTeX": ""}, {"BibKey": "Li2023BISSIAM", "Title": "BISSIAM: Bispectrum Siamese Network Based Contrastive Learning for UAV Anomaly Detection", "Abstract": "In recent years, a surging number of unmanned aerial vehicles (UAVs) are pervasively utilized … This paper proposes BISSIAM, a novel framework that is capable of identifying UAV presence, types and operation modes. BISSIAM converts UAV signals to bispectrum as the input and exploits a Siamese network-based contrastive learning model to learn the vector encoding. A sampling mechanism is proposed for optimizing the sample size involved in model training whilst ensuring model accuracy without compromising training efficiency. Finally, we present a similarity-based fingerprint matching mechanism for detecting unseen UAVs without the need of retraining the whole model. Experiment results show that our approach outperforms other baselines, achieving 92.85% accuracy in unsupervised scenarios and 91.4% when detecting out-of-sample UAVs.", "Authors": "Li, Taotao; Hong, Zhen; Cai, Qianming; Yu, Li; Wen, Zhenyu; Yang, Renyu", "Year": "2023", "Venue/Publisher": "IEEE Transactions on Knowledge and Data Engineering (TKDE), Vol.35 No.12, pp.12109-12124", "DOI_or_URL": "https://doi.org/10.1109/TKDE.2021.3118727", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "DL", "DetectionApproach": "Convert RF signals to bispectrum → Siamese network contrastive learning → similarity-based fingerprint matching for unseen UAV detection", "Technique": "Machine Learning", "Technique_Detailed": "Real Flight / Real-World RF Data", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Focused on detecting UAV types/modes via RF spectrum—not full flight anomaly recovery; dataset size/availability limited", "KeyFindings": "@article{Li2023BISSIAM, title={BISSIAM: Bispectrum Siamese Network Based Contrastive Learning for UAV Anomaly Detection}, author={Li, Taotao and Hong, Zhen and Cai, Qianming and Yu, Li and Wen, Zhenyu and Yang, Renyu}, journal={IEEE Transactions on Knowledge and Data Engineering}, volume={35}, number={12}, pages={12109-12124}, year={2023}, doi={10.1109/TKDE.2021.3118727}", "Limitations": "", "DatasetAvailable": "", "Remarks": "", "BibTeX": ""}, {"BibKey": "He2018SSSLAD", "Title": "UAV Flight Data Anomaly Detection using Structured Sparse Subspace Learning Algorithm", "Abstract": "This paper proposes the SSSL-AD algorithm, a structured sparse subspace-learning method that imposes structured sparsity on the projection coefficients to detect anomalies and identify their sources in UAV flight data; the method tracks the subspace over time via efficient optimization (Nesterov’s method) and demonstrates accurate and rapid anomaly/source detection on real UAV flight datasets.", "Authors": "He, Yongfu; Peng, Yu; Wang, Shaojun; Liu, Datong", "Year": "2018", "Venue/Publisher": "IEEE Transactions on Instrumentation and Measurement, Vol. 67 No. 12, pp. 2763-2774 (?) [conference version in 2017]", "DOI_or_URL": "https://doi.org/10.1109/TIM.2018.2863499", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Flight-parameter anomalies in UAV telemetry via projection residuals and subspace deviation", "DetectionApproach": "Model-Based", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Structured sparse subspace tracking + anomaly source identification on UAV flight data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Shows faster detection and better source-localisation compared to baseline subspace methods", "KeyFindings": "No", "Limitations": "@article{He2018SSSLAD, title={A Structured Sparse Subspace Learning Algorithm for Anomaly Detection in UAV Flight Data}, author={He, Yongfu and Peng, Yu and Wang, Shaojun and Liu, Datong}, journal={IEEE Transactions on Instrumentation and Measurement}, volume={67}, number={12}, pages={2763-2774}, year={2018}, doi={10.1109/TIM.2018.2863499}}", "DatasetAvailable": "", "Remarks": "", "BibTeX": ""}, {"BibKey": "Yang2023ExplainingUAVAnomalousEvents", "Title": "Explaining Anomalous Events in Flight Data of UAV With Deep Attention‐Based Multi-Instance Learning", "Abstract": "Ensuring the safety and reliability of unmanned aerial vehicles (UAVs) has become a critical issue as they continue to advance. Analyzing anomalous events using event‐based explanations is an effective approach to identifying key anomalous behaviors and mitigating potential risks. However, this task is challenging because anomalous events in flight data lack time-step labels in real-world UAV flight scenarios. To address this challenge, we propose a dual attention-based multi-instance learning (DA-DI-MIL) framework for pinpointing anomaly instances and automatically explaining anomalous events. Our MIL-based framework treats a segment of flight data as a “bag” with an available label, and its time steps as “instances” without labels. The dual attention mechanism combines temporal pseudo-label prediction with sensor-variable importance from delta feature attention to better identify anomaly points at the instance level. Extensive experiments on real UAV flight data with engine failures demonstrate the effectiveness and robustness of our method compared to existing state-of-the-art methods: DA-DI-MIL achieves near 90% in evaluation metrics with less than 5 time steps’ delay in detecting anomalous events and around 85% in temporal anomaly detection. Additionally, the method provides both global and local interpretations in time-domain and feature-space, thus contributing to higher aviation safety and reliability.", "Authors": "Yang, Jie; Tang, Diyin; Yu, Jinsong; Zhang, Jian; Liu, Haigang", "Year": "2023", "Venue/Publisher": "IEEE Transactions on Vehicular Technology, Vol. 72 (1): pp. 107-119", "DOI_or_URL": "https://doi.org/10.1109/TVT.2023.3301678", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Runtime log/flight-data anomalies in UAVs (engine failures)", "DetectionApproach": "DL", "Technique": "Deep Learning", "Technique_Detailed": "Deep attention-based multi-instance learning (DA-DI-MIL) on UAV flight segments → explain instance-level anomalies in weakly labelled bags", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "≈90% event-level detection with <5 time-step delay; ≈85% instance‐level detection", "KeyFindings": "Provides explainable detection of anomalies in UAV flight data using dual attention in MIL; links anomalous behavior to event explanation", "Limitations": "Limited to engine-failure anomalies; dataset availability unclear; no recovery/mitigation strategy addressed", "DatasetAvailable": "No", "Remarks": "@article{Yang2023ExplainingUAVAnomalousEvents, title={Explaining Anomalous Events in Flight Data of UAV With Deep Attention‐Based Multi‐Instance Learning}, author={Yang, Jie and Tang, Diyin and Yu, Jinsong and Zhang, Jian and Liu, Haigang}, journal={IEEE Transactions on Vehicular Technology}, volume={72}, number={1}, pages={107-119}, year={2023}, doi={10.1109/TVT.2023.3301678}}", "BibTeX": ""}, {"BibKey": "chen2024uav", "Title": "UAV Anomaly Detection Method Based on Convolutional Autoencoder and Support Vector Data Description with 0/1 Soft-Margin Loss", "Abstract": "Unmanned aerial vehicles (UAVs) are becoming more widely used in various industries, raising growing concerns about their safety and reliability. The flight data of UAVs can directly reflect their flight health status; however, the rarity of abnormal flight data and the spatiotemporal characteristics of these data represent a significant challenge for constructing accurate and reliable anomaly detectors. To address this, this study proposes an anomaly detection framework that fully considers the temporal correlations and distribution characteristics of flight data. This framework first combines a one-dimensional convolutional neural network (1DCNN) with an autoencoder (AE) to establish a feature extraction model. This model leverages the feature extraction capabilities of the 1DCNN and the reconstruction capabilities of the AE to thoroughly extract the spatiotemporal features from UAV flight data. Then, to address the challenge of adaptive anomaly detection thresholds, this research proposes a nonlinear model of support vector data description (SVDD) utilizing a 0/1 soft-margin loss, referred to as L0/1-SVDD... Experimental results using real flight data show that, compared with methods such as AE, LSTM, and LSTM-AE, the proposed method exhibits superior performance across five evaluation metrics.", "Authors": "Chen, Huakun; Lyu, Yongxi; Shi, Jingping; Zhang, Weiguo", "Year": "2024", "Venue/Publisher": "MDPI Drones, Vol. 8 No.10, Article 534", "DOI_or_URL": "https://doi.org/10.3390/drones8100534", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Flight-parameter anomalies in UAV flight data (sensors + control)", "DetectionApproach": "DL", "Technique": "Hybrid Approaches", "Technique_Detailed": "1D-CNN + Autoencoder → extract spatio-temporal features; residuals fed into L0/1-SVDD hypersphere classifier with 0/1 soft-margin loss solved via Bregman ADMM on UAV flight data", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Reported superior performance vs AE/LSTM/LSTM-AE on multiple metrics", "KeyFindings": "Combines convolutional feature extraction and robust SVDD with 0/1 loss to improve UAV anomaly detection accuracy and threshold robustness; validated on real UAV flight data", "Limitations": "Limited to selected dataset; no explicit recovery/mitigation strategy covered; computational cost for non-convex optimization may be higher", "DatasetAvailable": "No", "Remarks": "@article{chen2024uav,\n  title={UAV anomaly detection method based on convolutional autoencoder and support vector data description with 0/1 soft-margin loss},\n  author={Chen, Huakun and Lyu, Yongxi and Shi, Jingping and Zhang, Weiguo},\n  journal={Drones},\n  volume={8},\n  number={10},\n  pages={534},\n  year={2024},\n  publisher={MDPI}\n}", "BibTeX": ""}, {"BibKey": "hamdiDroneDLAnomaly", "Title": "Deep learning anomaly detection for drone-based surveillance", "Abstract": "This paper investigates the use of deep learning techniques for detecting anomalous events in drone-based surveillance scenarios, focusing on identifying abnormal visual patterns in aerial video data.", "Authors": "Hamdi et al.", "Year": "2021", "Venue/Publisher": "Not specified", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Environmental", "NatureOfAnomaly": "Behavioral and visual anomalies", "DetectionApproach": "Deep learning-based anomaly detection", "Technique": "Deep Learning", "Technique_Detailed": "Deep neural networks (vision-based)", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "AUC; Accuracy; Precision; Recall", "KeyFindings": "The study shows that deep learning models can effectively identify abnormal events in UAV surveillance footage, improving detection performance compared to traditional approaches", "Limitations": "Limited to vision-based anomalies; lacks system-", "DatasetAvailable": "", "Remarks": "", "BibTeX": ""}, {"BibKey": "motorRLUAVAnomaly", "Title": "Motor anomaly detection for unmanned aerial vehicles using reinforcement learning", "Abstract": "This paper explores the use of reinforcement learning techniques to detect motor-related anomalies in unmanned aerial vehicles by learning deviations in motor behavior during operation.", "Authors": "Lu et Al", "Year": "2017", "Venue/Publisher": "Not specified", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Motor and actuator anomalies", "DetectionApproach": "Reinforcement learning-based anomaly detection", "Technique": "Machine Learning", "Technique_Detailed": "Reinforcement Learning (policy learning over motor behavior)", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy; False alarm rate; Detection latency", "KeyFindings": "The study demonstrates that reinforcement learning can model normal motor behavior and identify anomalous motor conditions during UAV operation", "Limitations": "Limited evaluation scope; focus restricted to motor subsystem; scalability and generalization across platforms not fully discussed", "DatasetAvailable": "No", "Remarks": "Represents emerging use of RL for subsystem-level UAV anomaly detection; complements vision- and log-based detection works", "BibTeX": "@article{lu2017motor,\n  title={Motor anomaly detection for unmanned aerial vehicles using reinforcement learning},\n  author={Lu, Huimin and Li, Yujie and Mu, Shenglin and Wang, Dong and Kim, Hyoungseop and Serikawa, Seiichi},\n  journal={IEEE internet of things journal},\n  volume={5},\n  number={4},\n  pages={2315--2322},\n  year={2017},\n  publisher={IEEE}\n}"}, {"BibKey": "temporalAnomalyDroneDetect", "Title": "Efficient Drone Detection Using Temporal Anomalies and Small Spatio-Temporal Networks", "Abstract": "This paper proposes a lightweight spatio-temporal neural network that exploits temporal anomalies in video streams to efficiently detect drones, emphasizing computational efficiency and suitability for real-time deployment.", "Authors": "Mahalanobis et Al", "Year": "Not specified", "Venue/Publisher": "Not specified", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "Temporal and motion-based anomalies", "DetectionApproach": "Temporal anomaly-based detection", "Technique": "Deep Learning", "Technique_Detailed": "Small spatio-temporal neural networks (lightweight DL)", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy; Precision; Recall; Computational efficiency", "KeyFindings": "The approach demonstrates that exploiting temporal anomalies with compact spatio-temporal networks enables efficient and accurate drone detection with reduced computational cost", "Limitations": "Focuses on drone detection rather than internal UAV system anomalies; limited discussion on robustness to complex environments or adversarial conditions", "DatasetAvailable": "No", "Remarks": "Relevant as an anomaly-based detection technique but targets external drone presence rather than onboard UAV health or fault anomalies", "BibTeX": "@article{mahalanobis2025efficient,\n  title={Efficient Drone Detection Using Temporal Anomalies and Small Spatio-Temporal Networks},\n  author={Mahalanobis, Abhijit and Tall, Amadou},\n  journal={Sensors},\n  volume={26},\n  number={1},\n  pages={170},\n  year={2025},\n  publisher={MDPI}\n}"}, {"BibKey": "biosensorDroneAgriAnomaly", "Title": "Biosensor-Based Drones Anomaly Detection Integration for Sustainable Agriculture Development", "Abstract": "This chapter presents a comprehensive overview of integrating biosensor-equipped drones with anomaly detection techniques for sustainable agriculture development, highlighting real-time sensing of crop/soil conditions and the role of AI/ML for identifying deviations in agricultural parameters.", "Authors": "Wasswa Shafik", "Year": "2024", "Venue/Publisher": "IGI Global", "DOI_or_URL": "https://www.igi-global.com/chapter/biosensor-based-drones-anomaly-detection-integration-for-sustainable-agriculture-development/354229", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Crop, soil, and environmental anomalies", "DetectionApproach": "AI/ML-assisted anomaly detection", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Machine learning; artificial intelligence", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Not specified", "KeyFindings": "The chapter discusses how biosensor-equipped UAVs with advanced sensors (multispectral, GPS, thermal, chemical) and AD techniques support early anomaly detection for sustainable farming, enabling prompt interventions and reducing resource waste", "Limitations": "Challenges in managing large multisensor datasets; dependency on data quality and sensor coverage; deployment constraints in resource-limited areas", "DatasetAvailable": "No", "Remarks": "Highlights anomaly detection in agri UAV context with biosensor integration, expands the scope of UAV anomaly research beyond traditional system/flight anomalies", "BibTeX": "@incollection{biosensorDroneAgriAnomaly, title={Biosensor-Based Drones Anomaly Detection Integration for Sustainable Agriculture Development}, author={Shafik, Wasswa}, booktitle={Achieving Food Security Through Sustainable Agriculture}, publisher={IGI Global}, year={2024}, url={https://www.igi-global.com/chapter/biosensor-based-drones-anomaly-detection-integration-for-sustainable-agriculture-development/354229}}"}, {"BibKey": "stethoscopeDronesAcousticAnomaly", "Title": "A Stethoscope for Drones: Transformers-Based Methods for UAVs Acoustic Anomaly Detection", "Abstract": "This paper proposes transformer-based deep learning methods to detect acoustic anomalies in UAVs by analyzing sound signatures from onboard microphones, using hybrid spectrogram and embedding approaches to distinguish anomalous flight or mechanical sound patterns from normal acoustic behavior.", "Authors": "Or Haim Anidjar; Alon Barak; Boaz Ben-Moshe; Eyal Hagai; Sahar Tuvyahu", "Year": "2023", "Venue/Publisher": "IEEE Access", "DOI_or_URL": "10.1109/ACCESS.33336", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Acoustic anomaly detection", "DetectionApproach": "Deep learning with transformers and spectral features", "Technique": "Deep Learning", "Technique_Detailed": "Transformer-based neural networks on UAV acoustic data", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "Precision; Recall; F1 score", "KeyFindings": "The study demonstrates that transformer-based models applied to acoustic signatures can effectively detect UAV sound anomalies and highlight deviations in mechanical or flight behavior", "Limitations": "Focused on acoustic signatures only; limited discussion of multimodal integration or other subsystem faults", "DatasetAvailable": "No", "Remarks": "Extends UAV anomaly detection into acoustic domain with transformer architectures", "BibTeX": "@article{stethoscopeDronesAcousticAnomaly, author={Anidjar, Or Haim and Barak, Alon and Ben-Moshe, Boaz and Hagai, Eyal and Tuvyahu, Sahar}, title={A Stethoscope for Drones: Transformers-Based Methods for UAVs Acoustic Anomaly Detection}, journal={IEEE Access}, volume={11}, pages={33336–33353}, year={2023}, doi={10.1109/ACCESS.33336}}"}, {"BibKey": "droneGuard2025", "Title": "Drone-Guard: A Self-Supervised Deep Learning Framework for Real-Time Spatiotemporal Anomaly Detection in UAV Surveillance Systems", "Abstract": "This paper proposes Drone-Guard, a self-supervised deep learning framework for real-time spatiotemporal anomaly detection in UAV surveillance videos, using a lightweight encoder-decoder backbone with Multi-Scale Grouped Query Attention (MS-GQA) and a Residual Vector Quantization (RVQ) module to enable efficient context-aware modeling and generate pseudo-anomalies for self-supervised training.", "Authors": "Wassim Sliti; Olfa Besbes", "Year": "2025", "Venue/Publisher": "Neurocomputing", "DOI_or_URL": "10.1016/j.neucom.2025.131168", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Spatiotemporal video anomalies", "DetectionApproach": "Self-supervised deep learning", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Lightweight encoder-decoder; MS-GQA; RVQ", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy; Efficiency; Localization quality", "KeyFindings": "The framework achieves competitive or superior performance to state-of-the-art methods on benchmark video datasets and is suitable for real-time deployment on UAV platforms", "Limitations": "Focuses on video surveillance anomalies; limited analysis of onboard resource constraints in extreme environments", "DatasetAvailable": "No", "Remarks": "Self-supervised spatiotemporal anomaly detection for aerial surveillance via DL", "BibTeX": "@article{droneGuard2025, author={Sliti, Wassim and Besbes, Olfa}, title={Drone-Guard: A Self-Supervised Deep Learning Framework for Real-Time Spatiotemporal Anomaly Detection in UAV Surveillance Systems}, journal={Neurocomputing}, volume={653}, pages={131168}, year={2025}, doi={10.1016/j.neucom.2025.131168}}"}, {"BibKey": "acousticPropellerCrackUAV2025", "Title": "Acoustic Anomaly Detection for Propeller Crack Defects: A Drone-Based Surrogate Dataset for UAM", "Abstract": "This paper introduces an acoustic anomaly detection framework targeting propeller crack defects in UAVs, and presents a drone-based surrogate dataset for Urban Air Mobility (UAM) research using microphone recordings and ML classification models to detect early crack indications from acoustic signatures.", "Authors": "Juho Lee; Donghyun Yoon; Gu Moon Jeong; Hyeoncheol Kim", "Year": "2025", "Venue/Publisher": "IEEE Access", "DOI_or_URL": "10.1109/ACCESS.2025.3632030", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Propeller and structural acoustic anomalies", "DetectionApproach": "Acoustic anomaly detection", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Machine learning on acoustic features", "DataSource": "Simulation-based Data", "ApplicationContext": "Urban Air Mobility", "EvaluationMetrics": "Accuracy; Precision; Recall", "KeyFindings": "The study demonstrates feasibility of detecting propeller crack defects through acoustic signatures using ML and the surrogate dataset developed", "Limitations": "Requires integration of diverse flight conditions and further robustness validation", "DatasetAvailable": "Yes", "Remarks": "Introduces a UAV acoustic anomaly dataset and classification task for propeller fault detection", "BibTeX": "@article{acousticPropellerCrackUAV2025, author={Lee, Juho and Yoon, Donghyun and Jeong, Gu Moon and Kim, Hyeoncheol}, title={Acoustic Anomaly Detection for Propeller Crack Defects: A Drone-Based Surrogate Dataset for UAM}, journal={IEEE Access}, volume={13}, pages={195564–195578}, year={2025}, doi={10.1109/ACCESS.2025.3632030}}"}, {"BibKey": "anomalyDetectionDronesML2022", "Title": "Anomaly Detection in Drones with Machine Learning Algorithms", "Abstract": "This chapter surveys machine learning-based anomaly detection techniques applied to drones, covering both supervised and unsupervised approaches such as k-NN, SVM, decision trees, logistic regression, and discussing their applicability for identifying anomalies in UAV data streams.", "Authors": "Soumya Shaw; Kartik Joshi; Akhil Pathak; Abitha K. Thyagarajan; G. Vidya; Rahul Hemal Shah; V. Ram Kishan; John Sahaya Rani Alex", "Year": "2022", "Venue/Publisher": "Springer (Lecture Notes in Electrical Engineering, Futuristic Communication and Network Technologies)", "DOI_or_URL": "10.1007/978-981-16-4625-6_42", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Statistical and ML anomalies", "DetectionApproach": "ML-based anomaly detection", "Technique": "Hybrid Approaches", "Technique_Detailed": "Various ML algorithms (k-NN, SVM, decision tree, logistic regression)", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "Not applicable as survey", "KeyFindings": "Focuses on survey and high-level comparison; not evaluated on benchmark datasets", "Limitations": "No", "DatasetAvailable": "Survey of ML-based anomaly detection in drones across multiple data sources", "Remarks": "@incollection{anomalyDetectionDronesML2022, author={Shaw, Soumya and Joshi, Kartik and Pathak, Akhil and Thyagarajan, Abitha K. and Vidya, G. and Shah, Rahul Hemal and Kishan, V. Ram and Alex, John Sahaya Rani}, title={Anomaly Detection in Drones with Machine Learning Algorithms}, booktitle={Futuristic Communication and Network Technologies}, year={2022}, publisher={Springer Nature Singapore}, doi={10.1007/978-981-16-4625-6_42}}", "BibTeX": ""}, {"BibKey": "rssiGATDroneDetection2025", "Title": "Graph Attention Networks for Anomalous Drone Detection: RSSI-Based Approach with Real-World Validation", "Abstract": "This paper introduces a graph attention network (GAT) model for detecting anomalous drones in multi-UAV environments by leveraging RSSI signal deviations in an RSSI-based graph structure, validating performance with simulations and real experiments on drone kits.", "Authors": "Ghulam E. Mustafa Abro; Ayman M. Abdallah", "Year": "2025", "Venue/Publisher": "Expert Systems with Applications", "DOI_or_URL": "10.1016/j.eswa.2025.126913", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "RSSI signal anomalies", "DetectionApproach": "Graph attention network anomaly detection", "Technique": "Deep Learning", "Technique_Detailed": "Graph Attention Networks applied to RSSI deviation graphs", "DataSource": "Hybrid Datasets", "ApplicationContext": "Swarm", "EvaluationMetrics": "Accuracy; Computing efficiency; Real-time detection capability", "KeyFindings": "The GAT framework effectively identifies drones with anomalous RSSI patterns in real-world and simulated scenarios, outperforming conventional methods in detection accuracy and efficiency", "Limitations": "Requires extensive RSSI capture infrastructure; may depend on network density and environmental conditions", "DatasetAvailable": "No", "Remarks": "Applies graph neural attention to RSSI data for UAV anomaly detection", "BibTeX": "@article{rssiGATDroneDetection2025, author={Abro, Ghulam E. Mustafa and Abdallah, Ayman M.}, title={Graph Attention Networks for Anomalous Drone Detection: RSSI-Based Approach with Real-World Validation}, journal={Expert Systems with Applications}, volume={273}, year={2025}, doi={10.1016/j.eswa.2025.126913}}"}, {"BibKey": "uavCAE_L0_1_SVDD2024", "Title": "UAV Anomaly Detection Method Based on Convolutional Autoencoder and Support Vector Data Description with 0/1 Soft-Margin Loss", "Abstract": "This study proposes an anomaly detection framework for UAV flight data that combines a 1D CNN autoencoder with a nonlinear L0/1-SVDD classifier to capture spatiotemporal correlations and improve robustness against outliers in anomaly detection.", "Authors": "H. Chen", "Year": "2024", "Venue/Publisher": "Drones", "DOI_or_URL": "10.3390/drones8100534", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Behavioral/subsystem anomalies", "DetectionApproach": "CNN autoencoder + SVDD with 0/1 loss", "Technique": "Hybrid Approaches", "Technique_Detailed": "1D CNN autoencoder; L0/1-SVDD threshold module", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy; Precision; Recall; F1 score", "KeyFindings": "The proposed CAE-L0/1-SVDD method shows improved anomaly detection performance and robustness over AE, LSTM, and LSTM-AE baselines in real flight datasets", "Limitations": "Needs further evaluation across more platforms and anomaly types", "DatasetAvailable": "No", "Remarks": "Combines CNN feature extraction with a robust SVDD classifier for UAV anomaly detection", "BibTeX": "@article{uavCAE_L0_1_SVDD2024, author={Chen, H.}, title={UAV Anomaly Detection Method Based on Convolutional Autoencoder and Support Vector Data Description with 0/1 Soft-Margin Loss}, journal={Drones}, volume={8}, number={10}, page={534}, year={2024}, doi={10.3390/drones8100534}}"}, {"BibKey": "fastICA_TGAK_OCELM_UAV2023", "Title": "Anomaly Detection of UAV State Data Based on Single-Class Triangular Global Alignment Kernel Extreme Learning Machine", "Abstract": "This paper presents a novel UAV anomaly detection technique that uses a FastICA-based reconstruction and a Single-Class Triangular Global Alignment Kernel Extreme Learning Machine to improve detection accuracy by capturing temporal correlations in UAV state data.", "Authors": "Feisha Hu; Qi Wang; Haijian Shao; Shang Gao; Hualong Yu", "Year": "2023", "Venue/Publisher": "Computer Modeling in Engineering & Sciences", "DOI_or_URL": "10.32604/cmes.2023.026732", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Behavioral anomalies", "DetectionApproach": "One-class TGAK OCKELM anomaly detection", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "OCKELM with Triangular Global Alignment Kernel + FastICA", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy improved by ~30%; detection rates significantly higher than baseline methods", "KeyFindings": "The proposed FastICA-TGAK-OCELM method effectively identifies point anomalies and improves detection accuracy on ALFA and UCI datasets, showing robustness to noise and outliers", "Limitations": "Requires further study on scalability and model parameter optimization", "DatasetAvailable": "No", "Remarks": "Intelligent one-class kernel learning approach for UAV anomaly detection", "BibTeX": "@article{fastICA_TGAK_OCELM_UAV2023, author={Hu, Feisha and Wang, Qi and Shao, Haijian and Gao, Shang and Yu, Hualong}, title={Anomaly Detection of UAV State Data Based on Single-Class Triangular Global Alignment Kernel Extreme Learning Machine}, journal={Computer Modeling in Engineering & Sciences}, volume={136}, number={3}, pages={2405–2424}, year={2023}, doi={10.32604/cmes.2023.026732}"}, {"BibKey": "vibrationAnalysisUAV2020", "Title": "Vibration Analysis for Anomaly Detection in Unmanned Aircraft", "Abstract": "This study explores the use of vibration measurements from drones to analyse mechanical health and detect anomaly progression by applying periodogram signal processing to vibration sensor data collected during flights, demonstrating the potential to distinguish anomalous conditions from normal flight patterns.", "Authors": "O. Bektash", "Year": "2020", "Venue/Publisher": "Annual Conference of the Prognostics and Health Management Society", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Vibration signal anomalies", "DetectionApproach": "Vibration signal analysis", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Periodogram analysis on onboard vibration sensors", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection capability; Signal frequency characteristics", "KeyFindings": "The results support that vibration spectral analysis can detect anomalous conditions during UAV flights, indicating potential for health monitoring in sensitive airspaces", "Limitations": "No", "DatasetAvailable": "Preliminary work demonstrating vibration-based anomaly detection for UAV structural health", "Remarks": "@inproceedings{vibrationAnalysisUAV2020, author={Bektash, O.}, title={Vibration Analysis for Anomaly Detection in Unmanned Aircraft}, booktitle={Proceedings of the Annual Conference of the Prognostics and Health Management Society}, year={2020}}", "BibTeX": ""}, {"BibKey": "flightLogSentenceEmbeddings2025", "Title": "Drone Flight Log Anomaly Severity Classification via Sentence Embedding", "Abstract": "This paper investigates the classification of anomaly severity in UAV flight logs by converting log entries into sentence embeddings and using machine learning classifiers to assign severity levels, enhancing interpretability of log-based anomaly detection.", "Authors": "Not specified", "Year": "Not specified", "Venue/Publisher": "Not specified", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Analysis/Learning", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Severity of anomalous events", "DetectionApproach": "Embedding-based classification", "Technique": "Machine Learning", "Technique_Detailed": "Sentence embeddings + ML classifier", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Classification accuracy; Severity discrimination metrics", "KeyFindings": "The study demonstrates that converting log messages to embeddings enables severity classification beyond binary anomaly detection, improving prioritization and interpretability", "Limitations": "Limited to log message text; may not generalize across UAV platforms or log formats", "DatasetAvailable": "No", "Remarks": "Proposes severity classification layer for log-based UAV anomaly detection", "BibTeX": "@inproceedings{flightLogSentenceEmbeddings2025, title={Drone Flight Log Anomaly Severity Classification via Sentence Embedding}}"}, {"BibKey": "flightPathSecurityDroneAnomaly2025", "Title": "Autonomous Security Response Architecture for Flight Path Anomaly Detection in Defense Drone Systems", "Abstract": "This paper presents an architectural framework for anomaly detection and automated security responses in defense drone systems, focusing on detecting anomalies in flight paths and triggering appropriate security actions by integrating sensor monitoring, anomaly classification, and response modules.", "Authors": "Aditi Mallesh", "Year": "2025", "Venue/Publisher": "Journal of Computer Science and Technology Studies", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Flight path anomalies", "DetectionApproach": "Security response and anomaly detection", "Technique": "Machine Learning", "Technique_Detailed": "Framework incorporating sensor monitoring, classification and response modules", "DataSource": "Simulation-based Data", "ApplicationContext": "Military", "EvaluationMetrics": "Not specified", "KeyFindings": "The system offers a structured methodology to identify abnormal flight path behavior and trigger autonomous security responses within defense UAVs", "Limitations": "Framework description; limited empirical validation; lacks publicly released datasets", "DatasetAvailable": "No", "Remarks": "Defense-oriented anomaly detection and response architecture", "BibTeX": "@article{flightPathSecurityDroneAnomaly2025, author={Mallesh, Aditi}, title={Autonomous Security Response Architecture for Flight Path Anomaly Detection in Defense Drone Systems}, journal={Journal of Computer Science and Technology Studies}, year={2025}}"}, {"BibKey": "uavBayesianHybridAnomaly2021", "Title": "Unmanned Aerial Vehicles (UAVs) Anomaly Detection using Bayesian Networks and Hybrid Strategies", "Abstract": "This chapter explores anomaly detection in UAVs using Bayesian networks integrated with hybrid machine learning strategies for robust identification of anomalous flight behavior and sensor irregularities in multi-modal UAV data.", "Authors": "A. Kabir; M. Shamim Hossain; Ghulam Muhammad", "Year": "2021", "Venue/Publisher": "Springer (LNCS)", "DOI_or_URL": "10.1007/978-3-030-99079-4_10", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Behavioral and sensor anomalies", "DetectionApproach": "Bayesian network and hybrid detection", "Technique": "Hybrid Approaches", "Technique_Detailed": "Hybrid Bayesian networks with feature fusion", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "Not specified", "KeyFindings": "The chapter presents a probabilistic approach using Bayesian networks combined with other learning techniques to detect anomalies across different UAV subsystems; discusses performance scenarios", "Limitations": "Overview style; no benchmark dataset; lacks full empirical evaluation", "DatasetAvailable": "No", "Remarks": "Probabilistic Bayesian network and hybrid approach for UAV anomaly detection", "BibTeX": "@incollection{uavBayesianHybridAnomaly2021, author={Kabir, A. and Hossain, M. Shamim and Muhammad, Ghulam}, title={Unmanned Aerial Vehicles (UAVs) Anomaly Detection using Bayesian Networks and Hybrid Strategies}, booktitle={Machine Learning Paradigms and Applications}, year={2021}, publisher={Springer Nature}, doi={10.1007/978-3-030-99079-4_10}}"}, {"BibKey": "lebadadLogDrone2025", "Title": "Log-Processing Ensemble-Based Approach for Drone Anomaly Detection (LEBADAD)", "Abstract": "This chapter introduces LEBADAD, a log-processing ensemble-based framework for anomaly detection in drones that combines multiple processing strategies over UAV log sequences to enhance detection robustness and reduce false positives, validated with time-series evaluation.", "Authors": "S. Tout; S. Acikkol Dogan", "Year": "2025", "Venue/Publisher": "Springer (Lecture Notes in Networks and Systems)", "DOI_or_URL": "10.1007/978-3-031-98565-2_84", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "Log anomalies / temporal irregularities", "DetectionApproach": "Log processing + ensemble detection", "Technique": "Machine Learning", "Technique_Detailed": "Log-processing ensemble with time series features", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy; Precision; Recall; Robustness to noise", "KeyFindings": "The ensemble strategy in LEBADAD shows improved detection performance across diverse log patterns and reduces noise sensitivity compared to single models", "Limitations": "Lacks public dataset release; performance depends on log preprocessing quality", "DatasetAvailable": "No", "Remarks": "Log-processing ensemble method targeting drone log anomaly detection", "BibTeX": "@incollection{lebadadLogDrone2025, author={Tout, S. and Acikkol Dogan, S.}, title={Log-Processing Ensemble-Based Approach for Drone Anomaly Detection (LEBADAD)}, booktitle={Intelligent and Fuzzy Systems}, year={2025}, publisher={Springer Nature}, doi={10.1007/978-3-031-98565-2_84}}"}, {"BibKey": "abnormalFlightStateImages2024", "Title": "Automatic Detection of Abnormal Drone Flight State by Measuring Changes in Images Captured by a Drone-Mounted Camera", "Abstract": "This paper proposes a method for detecting abnormal flight states in drones by analysing changes between successive images captured by an onboard camera, estimating deviations in direction and motion patterns as indicators of abnormal behaviour.", "Authors": "Premachandra, Chinthaka; Ichikawa, Shintaro", "Year": "2024", "Venue/Publisher": "IEEE Aerospace and Electronic Systems Magazine", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Operational/Policy", "NatureOfAnomaly": "Flight behaviour anomalies", "DetectionApproach": "Vision change-based anomaly detection", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Image difference analysis and motion change estimation", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy; Change sensitivity; False positives", "KeyFindings": "The approach demonstrates that analyzing inter-frame changes in UAV camera images can indicate abnormal flight states without requiring inertial or control signals", "Limitations": "Limited by camera quality and environmental conditions; may not generalize to all flight scenarios", "DatasetAvailable": "No", "Remarks": "Vision-based abnormal flight state detection via image change measurement", "BibTeX": "@inproceedings{abnormalFlightStateImages2024, author={Premachandra, Chinthaka and Ichikawa, Shintaro}, title={Automatic Detection of Abnormal Drone Flight State by Measuring Changes in Images Captured by a Drone-Mounted Camera}, booktitle={IEEE Aerospace and Electronic Systems Magazine}, year={2024}}"}, {"BibKey": "servoAcousticAnomalyTinyML2025", "Title": "Real-time detection of acoustic anomalies in drone servo motors using edge-based machine learning", "Abstract": "This paper presents a real-time anomaly detection framework that uses TinyML and edge computing to analyse acoustic signals from UAV servo motors, enabling lightweight onboard mechanical fault detection with low latency and high efficiency.", "Authors": "Kfir, Tal; Tuvyahu, Sahar; Ben Moshe, Boaz; Anidjar, Or Haim", "Year": "2025", "Venue/Publisher": "Machine Learning with Applications", "DOI_or_URL": "10.1016/j.mlwa.2025.100755", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Acoustic servo motor anomalies", "DetectionApproach": "Edge-based ML anomaly detection", "Technique": "Deep Learning", "Technique_Detailed": "Compact neural network deployed on ultra-lightweight microcontroller", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Accuracy; Precision; Recall", "KeyFindings": "The proposed TinyML acoustic anomaly detector achieves ~86% accuracy, recall, and precision on embedded hardware, enabling scalable distributed deployment", "Limitations": "Requires acoustic sensor integration and validation in diverse environments", "DatasetAvailable": "No", "Remarks": "Edge-based TinyML for real-time UAV servo acoustic anomaly detection", "BibTeX": "@article{servoAcousticAnomalyTinyML2025, author={Kfir, Tal and Tuvyahu, Sahar and Ben Moshe, Boaz and Anidjar, Or Haim}, title={Real-time detection of acoustic anomalies in drone servo motors using edge-based machine learning}, journal={Machine Learning with Applications}, volume={22}, page={100755}, year={2025}, doi={10.1016/j.mlwa.2025.100755}}"}, {"BibKey": "droneForensicSigmaRules", "Title": "Anomaly Detection on Drone Forensic Timeline with Sigma Rules", "Abstract": "This paper proposes a forensic-oriented anomaly detection approach for drones by applying Sigma rules to reconstructed drone forensic timelines, enabling rule-based identification of suspicious or anomalous events during post-incident analysis.", "Authors": "Studiawan et Al", "Year": "2023", "Venue/Publisher": "Not specified", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Analysis/Learning", "SourceOfAnomaly": "Operational/Policy", "NatureOfAnomaly": "Forensic and behavioral anomalies", "DetectionApproach": "Rule-based anomaly detection", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Sigma rules applied to forensic event timelines", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Rule match coverage; Detection capability", "KeyFindings": "The study demonstrates that Sigma rules can be adapted for drone forensics to systematically detect anomalous or suspicious activities in post-flight timelines", "Limitations": "Limited to rule expressiveness; requires expert-defined rules; does not address real-time detection", "DatasetAvailable": "No", "Remarks": "Represents post-incident forensic anomaly analysis rather than online detection", "BibTeX": "@inproceedings{droneForensicSigmaRules, title={Anomaly Detection on Drone Forensic Timeline with Sigma Rules}}"}, {"BibKey": "vibrationDataDrivenUAV2024", "Title": "Vibration data-driven anomaly detection in UAVs", "Abstract": "This paper proposes a vibration-based anomaly detection framework for UAVs that uses a wavelet scattering transform combined with an LSTM autoencoder to learn temporal vibration signal patterns and detect deviations associated with impending mechanical failure.", "Authors": "EC Ozkat", "Year": "2024", "Venue/Publisher": "Journal of Aerospace Science and Technology (Elsevier)", "DOI_or_URL": "10.1016/j.ast.2024.## (Not specified in abstract)", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Vibration signal anomalies", "DetectionApproach": "Unsupervised anomaly detection", "Technique": "Deep Learning", "Technique_Detailed": "Wavelet scattering + LSTM autoencoder", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Earliest warning time; detection lead time relative to failure", "KeyFindings": "The approach successfully detects vibration anomalies preceding failure by learning spatio-temporal patterns in UAV vibration data; earliest warnings from y-axis within ~100 s of onset", "Limitations": "Requires further validation on diverse platforms and fault types", "DatasetAvailable": "No", "Remarks": "Vibration-based UAV anomaly detection using wavelet scattering and LSTM autoencoder", "BibTeX": "@article{vibrationDataDrivenUAV2024, author={Ozkat, E.C.}, title={Vibration data-driven anomaly detection in UAVs}, journal={Journal of Aerospace Science and Technology}, year={2024}}"}, {"BibKey": "patheDBNBFM2024", "Title": "Advancing the detection of abnormal drone behaviors: A dynamic bayesian network approach enhanced by the belief function machine", "Abstract": "This paper proposes a multisensor fusion approach for detecting abnormal drone behaviors using a Dynamic Bayesian Network enhanced with a Belief Function Machine, aiming to improve robustness under uncertainty and heterogeneous observations.", "Authors": "Pierre Pathé; Benjamin Pannetier; Olivier Bartheye", "Year": "2024", "Venue/Publisher": "2024 IEEE International Conference on Multisensor Fusion and Integration for Intelligent Systems (MFI)", "DOI_or_URL": "10.1109/MFI62651.2024.10705776", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Abnormal drone behaviors (behavioral anomalies under uncertainty)", "DetectionApproach": "Probabilistic/evidential fusion-based anomaly detection", "Technique": "Hybrid Approaches", "Technique_Detailed": "Dynamic Bayesian Network + Belief Function Machine (evidential reasoning)", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Not specified", "KeyFindings": "The DBN+BFM fusion improves detection of abnormal behaviors by explicitly managing uncertainty and combining heterogeneous evidence", "Limitations": "Depends on model design and evidence calibration; evaluation details and generalization beyond tested conditions may be limited", "DatasetAvailable": "No", "Remarks": "Evidential/probabilistic fusion approach (MFI 2024); good contrast vs DL-only detectors", "BibTeX": "@inproceedings{patheDBNBFM2024, author={Path{\\'e}, Pierre and Pannetier, Benjamin and Bartheye, Olivier}, title={Advancing the detection of abnormal drone behaviors: A dynamic bayesian network approach enhanced by the belief function machine}, booktitle={2024 IEEE International Conference on Multisensor Fusion and Integration for Intelligent Systems (MFI)}, year={2024}, pages={1--6}, doi={10.1109/MFI62651.2024.10705776}}"}, {"BibKey": "adamRuntimeAnomalyMonitoring2024", "Title": "ADAM: Adaptive Monitoring of Runtime Anomalies in Small Uncrewed Aerial Systems", "Abstract": "This paper introduces ADAM, a self-adaptive framework for runtime anomaly monitoring in small Uncrewed Aerial Systems (sUAS) that selectively monitors a subset of time-series data streams and dynamically adjusts detection strategies when anomalies are suspected to balance detection robustness with onboard resource constraints.", "Authors": "Md Nafee Al Islam; Jane Cleland-Huang; Michael Vierhauser", "Year": "2024", "Venue/Publisher": "Proceedings of the 19th IEEE/ACM Symposium on Software Engineering for Adaptive and Self-Managing Systems (SEAMS)", "DOI_or_URL": "10.1145/3643915.3644092", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Runtime anomalies in multivariate sensor streams", "DetectionApproach": "Self-adaptive anomaly monitoring", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Adaptive monitoring framework that enables dynamic switching of detectors and monitoring focus", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection latency; Resource utilization; Accuracy", "KeyFindings": "The ADAM framework demonstrates improved safety and computational efficiency by adaptively concentrating monitoring resources where anomalies are likely, validated via simulation (Gazebo), real logs, and real drones", "Limitations": "Framework complexity; Requires careful configuration of adaptive thresholds and detector switching", "DatasetAvailable": "No", "Remarks": "Adaptive anomaly monitoring framework tailored for sUAS runtime operational constraints", "BibTeX": "@inproceedings{adamRuntimeAnomalyMonitoring2024, author={Al Islam, Md Nafee and Cleland-Huang, Jane and Vierhauser, Michael}, title={ADAM: Adaptive Monitoring of Runtime Anomalies in Small Uncrewed Aerial Systems}, booktitle={Proceedings of the 19th IEEE/ACM Symposium on Software Engineering for Adaptive and Self-Managing Systems (SEAMS)}, year={2024}, pages={44–55}, doi={10.1145/3643915.3644092}}"}, {"BibKey": "fuzzingDronesAnomaly2025", "Title": "Fuzzing drones for anomaly detection: A systematic review of techniques and challenges", "Abstract": "This article systematically reviews the state of the art in applying **fuzzing techniques** to unmanned aerial vehicles to discover software bugs, vulnerabilities, and anomalous behavior in UAV systems by systematically generating inputs and analyzing fault manifestations in drone software and protocols.", "Authors": "V.K. Malviya; M. Kaur; S. Rastogi", "Year": "2025", "Venue/Publisher": "Journal of Systems Architecture", "DOI_or_URL": "10.1016/j.sysarc.2024.###(Not specified)", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Software bugs and security vulnerabilities seen as anomalies", "DetectionApproach": "Review of fuzzing and anomaly discovery techniques", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Survey of fuzz testing methods applied to UAV control and communication subsystems", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Not applicable", "KeyFindings": "This review highlights how fuzzing identifies latent bugs and vulnerabilities that could lead to runtime anomalies or exploits and discusses research gaps and future directions while connecting UAV anomaly detection with security testing challenges", "Limitations": "Limited empirical evaluation in primary research articles; lack of standardized fuzzing benchmarks for UAVs", "DatasetAvailable": "No", "Remarks": "Systematic review of fuzzing for exposing anomalies and vulnerabilities in UAV systems", "BibTeX": "@article{fuzzingDronesAnomaly2025, author={Malviya, V.K. and Kaur, M. and Rastogi, S.}, title={Fuzzing drones for anomaly detection: A systematic review of techniques and challenges}, journal={Journal of Systems Architecture}, year={2025}, doi={10.1016/j.sysarc.2024.###}}"}, {"BibKey": "federatedDroneSwarmAnomaly2025", "Title": "Federated Learning-enabled Network Incident Anomaly Detection Optimization for Drone Swarms", "Abstract": "This paper explores an optimized federated learning framework to detect network incidents and anomalies in drone swarms by aggregating distributed model updates while preserving data privacy, improving detection performance under limited swarm connectivity conditions.", "Authors": "Kevin Kostage; Rohan Adepu; J. Monroe; T. Haughton; J. Mogollon; S. Poduvu; K. Palaniappan; P. Calyam; R. Mitra", "Year": "2025", "Venue/Publisher": "IEEE/ACM International Conference on Distributed Computing and Networking (ICDCN)", "DOI_or_URL": "10.1145/3700838.3700857", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "Network incident and communication anomalies", "DetectionApproach": "Federated learning anomaly detection", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Federated learning with anomaly optimization in distributed drone swarms", "DataSource": "Simulation-based Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Accuracy; Precision; Communication overhead", "KeyFindings": "Federated learning improves detection consistency across decentralized drone nodes and preserves privacy during collaborative anomaly detection", "Limitations": "Requires stable connectivity assumptions for effective federated training; environment noise and adversarial conditions may degrade performance", "DatasetAvailable": "No", "Remarks": "Optimized federated learning detection approach for network anomalies in drone swarms", "BibTeX": "@inproceedings{federatedDroneSwarmAnomaly2025, author={Kostage, Kevin and Adepu, Rohan and Monroe, J. and Haughton, T. and Mogollon, J. and Poduvu, S. and Palaniappan, K. and Calyam, P. and Mitra, R.}, title={Federated Learning-enabled Network Incident Anomaly Detection Optimization for Drone Swarms}, booktitle={Proceedings of the 26th IEEE/ACM International Conference on Distributed Computing and Networking (ICDCN)}, year={2025}, pages={104–114}, doi={10.1145/3700838.3700857}}"}, {"BibKey": "ganAerialVideoAnomaly2022", "Title": "A Novel GAN-Based Anomaly Detection and Localization Method for Aerial Video Surveillance at Low Altitude", "Abstract": "This paper presents a two-branch Generative Adversarial Network (GAN) method for detecting and localizing anomalies in low-altitude RGB aerial video streams, focusing on challenging surveillance scenarios where small dangerous objects and unusual changes in the scene need to be identified.", "Authors": "Danilo Avola; Irene Cannistraci; Marco Cascio; Luigi Cinque; Anxhelo Diko; Alessio Fagioli; Gian Luca Foresti; Romeo Lanzino; Maurizio Mancini; Alessio Mecca; Daniele Pannone", "Year": "2022", "Venue/Publisher": "Remote Sensing (MDPI)", "DOI_or_URL": "10.3390/rs14164110", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "Visual anomalies and object anomalies", "DetectionApproach": "Deep learning anomaly detection", "Technique": "Deep Learning", "Technique_Detailed": "GAN-based two-branch network", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "AUROC; SSIM", "KeyFindings": "The approach successfully detects and localizes anomalies (including small objects) in UAV surveillance video using the proposed GAN architecture, evaluated on the UMCD dataset", "Limitations": "Environmental and complex backgrounds may affect detection performance; real-world deployment considerations not fully explored", "DatasetAvailable": "Yes (UMCD aerial video dataset used)", "Remarks": "GAN-based aerial video anomaly detection and localization", "BibTeX": "@article{ganAerialVideoAnomaly2022, author={Avola, Danilo and Cannistraci, Irene and Cascio, Marco and Cinque, Luigi and Diko, Anxhelo and Fagioli, Alessio and Foresti, Gian Luca and Lanzino, Romeo and Mancini, Maurizio and Mecca, Alessio and Pannone, Daniele}, title={A Novel GAN-Based Anomaly Detection and Localization Method for Aerial Video Surveillance at Low Altitude}, journal={Remote Sensing}, volume={14}, number={16}, article={4110}, year={2022}, doi={10.3390/rs14164110}}"}, {"BibKey": "transformerSentimentDroneForensics", "Title": "Transformer-based Sentiment Analysis for Anomaly Detection on Drone Forensic Timeline", "Abstract": "This paper proposes a post-incident forensic analysis approach that applies transformer-based sentiment analysis to textual and event-based drone forensic timelines, aiming to detect anomalous or suspicious patterns by identifying abnormal sentiment shifts and contextual cues in logged events.", "Authors": "Silalahi et  Al", "Year": "Not specified", "Venue/Publisher": "Not specified", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Analysis/Learning", "SourceOfAnomaly": "Operational/Policy", "NatureOfAnomaly": "Forensic and behavioral anomalies", "DetectionApproach": "Sentiment-aware anomaly analysis", "Technique": "Deep Learning", "Technique_Detailed": "Transformer-based language models with sentiment analysis", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Classification accuracy; Anomaly identification capability", "KeyFindings": "The approach demonstrates that transformer-based sentiment modeling can enrich forensic timelines and help identify suspicious or anomalous events that may be missed by rule-based analysis alone", "Limitations": "Depends on quality and structure of forensic text; sentiment interpretation may be domain-sensitive; not suitable for real-time detection", "DatasetAvailable": "No", "Remarks": "Text-based forensic anomaly analysis using transformer sentiment models", "BibTeX": "@inproceedings{silalahi2023transformer,\n  title={Transformer-based sentiment analysis for anomaly detection on drone forensic timeline},\n  author={Silalahi, Swardiantara and Ahmad, Tohari and Studiawan, Hudan},\n  booktitle={2023 11th International Symposium on Digital Forensics and Security (ISDFS)},\n  pages={1--6},\n  year={2023},\n  organization={IEEE}\n}"}, {"BibKey": "swarmDroneMLAnomaly2019", "Title": "Toward machine learning-based anomaly detection for swarm drones", "Abstract": "This paper introduces early machine learning architectures and concepts for anomaly detection in *swarm drone systems*, outlining schematic models for detecting anomalous individual drones and abnormal swarm behavior based on system-level observations and multivariate data streams.", "Authors": "Hyojung Ahn", "Year": "2019", "Venue/Publisher": "Asia Pacific International Symposium on Aerospace Technology / Informit", "DOI_or_URL": "10.3316/INFORMIT.941455210142738", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Operational/Policy", "NatureOfAnomaly": "Swarm drone behavioral anomalies", "DetectionApproach": "ML-based anomaly detection", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Conceptual machine learning architectures for swarm anomaly detection", "DataSource": "Simulation-based Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Not specified", "KeyFindings": "Presents foundational ML concepts for detecting anomalies in drone swarms; lays conceptual architecture rather than empirical benchmarks", "Limitations": "Conceptual paper; lacks public dataset and detailed experiments", "DatasetAvailable": "No", "Remarks": "Early ML-based swarm anomaly detection framework", "BibTeX": "@inproceedings{swarmDroneMLAnomaly2019, author={Ahn, Hyojung}, title={Toward machine learning-based anomaly detection for swarm drones}, booktitle={Asia Pacific International Symposium on Aerospace Technology}, year={2019}, doi={10.3316/INFORMIT.941455210142738}}"}, {"BibKey": "anomalyDroneNavDNN2024", "Title": "Anomaly Detection Method for Drone Navigation System Based on Deep Neural Networks", "Abstract": "This paper proposes a deep neural network-based anomaly detection method for drone navigation systems, using flight sensor data to identify deviations in navigation behavior and improve the reliability of navigation under various operating conditions.", "Authors": "Seung-Hwan Seo", "Year": "2024", "Venue/Publisher": "JPNT (Journal of Power and Navigation Technology)", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Navigation and state anomalies", "DetectionApproach": "Deep neural network anomaly detection", "Technique": "Deep Learning", "Technique_Detailed": "Deep neural network trained on navigation sensor data", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy; False positive/negative rates", "KeyFindings": "The proposed method demonstrates improved detection of navigation faults using DNNs compared to baseline thresholding approaches; enhances robustness under perturbations", "Limitations": "Limited by lack of public dataset; needs evaluation on diverse platforms", "DatasetAvailable": "No", "Remarks": "Deep learning-based navigation anomaly detection for UAVs", "BibTeX": "@article{anomalyDroneNavDNN2024, author={Seo, Seung-Hwan}, title={Anomaly Detection Method for Drone Navigation System Based on Deep Neural Networks}, journal={Journal of Power and Navigation Technology}, year={2024}}"}, {"BibKey": "dcatcnTemporalAttentionUAV2025", "Title": "DCATCN: Temporal Convolutional Network and Cross-Attention Based UAV Sensor Anomaly Detection", "Abstract": "Method proposed using a temporal convolutional network combined with a cross-attention mechanism for sensor anomaly detection in UAVs, capturing both temporal and inter-sensor dependencies to identify abnormal flight states and sensor behaviors.", "Authors": "Bo Wu; Chengzi Zhou; Yanxi Liu; Wei Zheng", "Year": "2025", "Venue/Publisher": "IEEE (likely IEEE International Conference / Workshop)", "DOI_or_URL": "10.1109/10666980", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Sensor anomaly and flight state deviations", "DetectionApproach": "Deep learning anomaly detection", "Technique": "Deep Learning", "Technique_Detailed": "Temporal convolutional network (TCN) + cross-attention mechanisms", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "Precision; Recall; F1", "KeyFindings": "The model integrates temporal context and cross-attention to improve anomaly detection performance compared to baseline approaches; effective at capturing long-range dependencies and inter-sensor correlations", "Limitations": "Not verified; lacks public dataset and full evaluation details", "DatasetAvailable": "No", "Remarks": "TCN with cross-attention for multivariate UAV sensor anomaly detection", "BibTeX": "@inproceedings{dcatcnTemporalAttentionUAV2025, author={Wu, Bo and Zhou, Chengzi and Liu, Yanxi and Zheng, Wei}, title={DCATCN: Temporal Convolutional Network and Cross-Attention Based UAV Sensor Anomaly Detection}, year={2025}, doi={10.1109/10666980}}"}, {"BibKey": "rpcaNetUAVFlightData2025", "Title": "Anomaly Detection for UAV Flight Data via Reconstruction-Prediction Co-Learning Attention Network", "Abstract": "This paper proposes a novel Reconstruction-Prediction Co-Learning Attention Network (RPCA-Net) that simultaneously performs prediction and reconstruction for anomaly detection in UAV flight data, leveraging CNNs for feature extraction, LSTMs for temporal dependency, and attention mechanisms to enhance focus on anomaly-sensitive patterns.", "Authors": "Zeyi Zhou; Jie Zhong; Yujie Zhang; Qiang Miao", "Year": "2025", "Venue/Publisher": "IEEE Transactions on Instrumentation and Measurement", "DOI_or_URL": "10.1109/TIM.2025.3593530", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Flight parameter anomalies", "DetectionApproach": "Deep learning anomaly detection", "Technique": "Deep Learning", "Technique_Detailed": "Reconstruction-Prediction Co-Learning Attention Network (CNN + LSTM + attention)", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy; Robustness", "KeyFindings": "The RPCA-Net effectively captures both temporal and structural anomaly signatures, outperforming traditional single-task prediction or reconstruction methods on real flight data", "Limitations": "The approach requires careful balancing of dual losses and has computational complexity due to multi-task co-learning", "DatasetAvailable": "No", "Remarks": "Deep attention-augmented co-learning anomaly detection for UAV flight data", "BibTeX": "@article{rpcaNetUAVFlightData2025, author={Zhou, Zeyi and Zhong, Jie and Zhang, Yujie and Miao, Qiang}, title={Anomaly Detection for UAV Flight Data via Reconstruction-Prediction Co-Learning Attention Network}, journal={IEEE Transactions on Instrumentation and Measurement}, year={2025}, doi={10.1109/TIM.2025.3593530}}"}, {"BibKey": "onlineAnomalyDetectionUAV", "Title": "An Online Anomaly Detection Approach for Unmanned Aerial Vehicles", "Abstract": "This paper presents an online anomaly detection approach for unmanned aerial vehicles that continuously monitors multivariate flight and sensor data streams to detect deviations from normal operational behavior in real time during flight.", "Authors": "Titouna et Al", "Year": "Not specified", "Venue/Publisher": "Not specified", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Runtime behavioral and sensor anomalies", "DetectionApproach": "Online anomaly detection", "Technique": "Machine Learning", "Technique_Detailed": "Statistical or learning-based online monitoring model", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy; False alarm rate; Detection latency", "KeyFindings": "The approach demonstrates the feasibility of detecting UAV anomalies online during flight, enabling early identification of abnormal behavior before mission failure", "Limitations": "Limited details on model generalization and scalability; dataset and evaluation setup not fully specified", "DatasetAvailable": "No", "Remarks": "Generic online anomaly detection framework for UAV runtime monitoring", "BibTeX": "@inproceedings{onlineAnomalyDetectionUAV, title={An Online Anomaly Detection Approach for Unmanned Aerial Vehicles}}"}, {"BibKey": "radarMicroDopplerDroneAnomalyCNN", "Title": "Anomaly-Based Drone Classification Using a Model Trained Convolutional Neural Network Autoencoder on Radar Micro-Doppler", "Abstract": "This paper proposes an anomaly-based drone classification approach using radar micro-Doppler signatures, where a convolutional neural network autoencoder is trained on normal target patterns and deviations in reconstruction error are used to identify and classify anomalous drone signatures.", "Authors": "Karlsson et Al", "Year": "Not specified", "Venue/Publisher": "Not specified", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Radar signal anomalies and drone type deviations", "DetectionApproach": "Reconstruction-based anomaly detection", "Technique": "Deep Learning", "Technique_Detailed": "CNN autoencoder on radar micro-Doppler spectrograms", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Classification accuracy; Reconstruction error metrics", "KeyFindings": "The method demonstrates that CNN autoencoders trained on radar micro-Doppler features can distinguish drones from non-drone or anomalous aerial targets without explicit multi-class supervision", "Limitations": "Limited to radar sensing conditions; performance may depend on radar configuration and environmental noise", "DatasetAvailable": "No", "Remarks": "Radar-based anomaly detection and classification using CNN autoencoders", "BibTeX": "@inproceedings{radarMicroDopplerDroneAnomalyCNN, title={Anomaly-Based Drone Classification Using a Model Trained Convolutional Neural Network Autoencoder on Radar Micro-Doppler}}"}, {"BibKey": "deepOneClassUAVVideo2021", "Title": "End-to-End Deep One-Class Learning for Anomaly Detection in UAV Video Stream", "Abstract": "This paper presents an end-to-end deep one-class learning architecture for anomaly detection in UAV video streams that jointly generates optical flow from raw video frames and learns compact spatio-temporal representations via convolution and deconvolution networks, enabling efficient detection of abnormal events without handcrafted motion features.", "Authors": "Slim Hamdi; Samir Bouindour; Hichem Snoussi; Tian Wang; Mohamed Abid", "Year": "2021", "Venue/Publisher": "Journal of Imaging (MDPI)", "DOI_or_URL": "10.3390/jimaging7050090", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "Visual and motion anomalies", "DetectionApproach": "Unsupervised deep learning anomaly detection", "Technique": "Hybrid Approaches", "Technique_Detailed": "End-to-end deep one-class network with integrated optical flow generation", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Not addressed", "KeyFindings": "Limited by reliance on optical flow and dataset characteristics; generalization to other UAV video scenarios requires further validation", "Limitations": "Yes", "DatasetAvailable": "Unsupervised deep one-class learning for UAV video anomaly detection", "Remarks": "@article{deepOneClassUAVVideo2021, author={Hamdi, Slim and Bouindour, Samir and Snoussi, Hichem and Wang, Tian and Abid, Mohamed}, title={End-to-End Deep One-Class Learning for Anomaly Detection in UAV Video Stream}, journal={Journal of Imaging}, volume={7}, number={5}, article={90}, year={2021}, doi={10.3390/jimaging7050090}}", "BibTeX": ""}, {"BibKey": "aiaaActiveLearningAnomaly2021", "Title": "Anomaly Detection, Active Learning, Precursor Identification, and Human Knowledge for Autonomous System Safety", "Abstract": "This paper explores an anomaly detection framework for autonomous multi-UAS systems that combines unsupervised anomaly detection, active learning, and precursor identification to detect and classify safety-relevant anomalies during complex missions, incorporating subject-matter-expert feedback to reduce false alarms.", "Authors": "Nikunj C. Oza; Kevin M. Bradner; David L. Iverson; Adwait Sahasrabhojanee; Shawn R. Wolfe", "Year": "2021", "Venue/Publisher": "AIAA Scitech 2021 Forum", "DOI_or_URL": "10.2514/6.2021-1771", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Operational/Policy", "NatureOfAnomaly": "Safety-relevant anomalies in autonomous UAV team behavior", "DetectionApproach": "Active learning-enhanced anomaly detection", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Anomaly detection with active learning and precursor identification on mission telemetry and behavior logs", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Classification accuracy; False alarm reduction; Detection reliability", "KeyFindings": "The active learning and precursor identification strategy improves operational anomaly labeling and reduces false alarms over purely unsupervised detection in simulated multi-UAS missions", "Limitations": "Needs real mission validation; SME labeling may limit scalability", "DatasetAvailable": "No", "Remarks": "Active learning and precursor identification framework for UAV anomaly detection", "BibTeX": "@inproceedings{aiaaActiveLearningAnomaly2021, author={Oza, Nikunj C. and Bradner, Kevin M. and Iverson, David L. and Sahasrabhojanee, Adwait and Wolfe, Shawn R.}, title={Anomaly Detection, Active Learning, Precursor Identification, and Human Knowledge for Autonomous System Safety}, booktitle={AIAA Scitech 2021 Forum}, year={2021}, doi={10.2514/6.2021-1771}}"}, {"BibKey": "motorAnomalyTempSensor2018", "Title": "Motor Anomaly Detection for Aerial Unmanned Vehicles Using Temperature Sensor", "Abstract": "This chapter develops a motor anomaly detection system for aerial unmanned vehicles that uses DS18B20 temperature sensors on the motor and a reinforcement learning classifier running on a Raspberry Pi to identify abnormal motor temperature conditions and trigger safe landings.", "Authors": "Nikunj C. Oza; Kevin M. Bradner; David L. Iverson; Adwait Sahasrabhojanee; Shawn R. Wolfe", "Year": "2018", "Venue/Publisher": "Artificial Intelligence and Robotics (Studies in Computational Intelligence, Springer)", "DOI_or_URL": "10.1007/978-3-319-69877-9_32", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Motor over-temperature anomalies", "DetectionApproach": "Reinforcement learning anomaly classification", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Temperature sensor data from motors", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Not addressed", "KeyFindings": "Depends on threshold setup; limited to temperature anomalies; not tested across diverse UAV platforms", "Limitations": "No", "DatasetAvailable": "Springer chapter on motor temperature anomaly detection using reinforcement learning", "Remarks": "@incollection{motorAnomalyTempSensor2018, author={Li, Yujie and Lu, Huimin and Kihara, Keita and Guna, Jože and Serikawa, Seiichi}, title={Motor Anomaly Detection for Aerial Unmanned Vehicles Using Temperature Sensor}, booktitle={Artificial Intelligence and Robotics}, series={Studies in Computational Intelligence}, volume={752}, year={2018}, pages={295-304}, doi={10.1007/978-3-319-69877-9_32}}", "BibTeX": ""}, {"BibKey": "triagingAutonomySecurityDroneFaults", "Title": "Triaging Autonomous Drone Faults by Simultaneously Assuring Autonomy and Security", "Abstract": "This paper proposes a fault triaging approach for autonomous drones that jointly considers autonomy assurance and security assurance, enabling systematic classification and prioritization of detected faults by distinguishing between benign autonomy-related failures and security-induced anomalous behaviors.", "Authors": "Watkins et Al", "Year": "Not specified", "Venue/Publisher": "Not specified", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Analysis/Learning", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Faults arising from autonomy failures and security attacks", "DetectionApproach": "Fault triage and classification", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Assurance-based analysis combining autonomy and security signals", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Triage accuracy; Fault classification effectiveness", "KeyFindings": "The approach demonstrates that jointly analyzing autonomy and security perspectives improves fault triaging accuracy and reduces misclassification between safety faults and security incidents", "Limitations": "Conceptual framework with limited empirical validation; relies on availability of rich monitoring signals", "DatasetAvailable": "No", "Remarks": "Fault triaging framework bridging UAV autonomy assurance and security assurance", "BibTeX": "@inproceedings{triagingAutonomySecurityDroneFaults, title={Triaging Autonomous Drone Faults by Simultaneously Assuring Autonomy and Security}}"}, {"BibKey": "unsupervisedVideoAnomalyUAV2023", "Title": "Unsupervised Video Anomaly Detection in UAVs: A New Approach Based on Learning and Inference", "Abstract": "This paper proposes an **unsupervised contextual video anomaly detection method** for UAV-captured aerial video by building spatio-temporal context graphs from scene visual features, applying transformers with message passing to update context, and using a graph-based variational autoencoder for anomaly scoring without labeled data.", "Authors": "Gang Liu; Lisheng Shu; Yuhui Yang; Chen Jin", "Year": "2023", "Venue/Publisher": "Frontiers in Sustainable Cities", "DOI_or_URL": "10.3389/frsc.2023.1197434", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Visual and contextual anomalies", "DetectionApproach": "Unsupervised video anomaly detection", "Technique": "Deep Learning", "Technique_Detailed": "Spatio-temporal contextual graph + transformer + graph VAE", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Frame-level anomaly scores; AUC; precision/recall (improved over baselines)", "KeyFindings": "The method effectively bridges semantic gaps by leveraging scene context and spatio-temporal relations, showing enhanced performance on standard video anomaly datasets (including UAV scenes)", "Limitations": "Relies on clustering and context graph quality; may be computationally heavier than simpler baselines", "DatasetAvailable": "Yes (used several public video anomaly datasets for evaluation)", "Remarks": "Unsupervised graph-based contextual video anomaly detection for UAV surveillance", "BibTeX": "@article{unsupervisedVideoAnomalyUAV2023, author={Liu, Gang and Shu, Lisheng and Yang, Yuhui and Jin, Chen}, title={Unsupervised Video Anomaly Detection in UAVs: A New Approach Based on Learning and Inference}, journal={Frontiers in Sustainable Cities}, year={2023}, doi={10.3389/frsc.2023.1197434}}"}, {"BibKey": "lightweightUnsupervisedUAVVideoAnomaly2024", "Title": "Lightweight Unsupervised Video Anomaly Detection Framework for UAVs Based on Multiscale Feature Extraction and Feature Reconstruction", "Abstract": "This paper proposes a lightweight **unsupervised video anomaly detection framework** for UAV surveillance, combining multiscale feature extraction via a convolutional encoder with a reconstruction network to identify abnormal events in aerial video without labeled anomalous samples.", "Authors": "Zhengyuan Xu; Yikang Li; Rui Fan; Zhenwei Shi; Qinghua Li", "Year": "2024", "Venue/Publisher": "Aerospace", "DOI_or_URL": "10.3390/aerospace11050393", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Visual anomalies in UAV video", "DetectionApproach": "Unsupervised anomaly detection", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Multiscale feature encoder + reconstruction network", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Not addressed", "KeyFindings": "Generalization may depend on quality of multiscale features and reconstruction quality", "Limitations": "Yes (evaluated on public video anomaly datasets)", "DatasetAvailable": "Unsupervised lightweight video anomaly detection for UAV surveillance", "Remarks": "@article{lightweightUnsupervisedUAVVideoAnomaly2024, author={Xu, Zhengyuan and Li, Yikang and Fan, Rui and Shi, Zhenwei and Li, Qinghua}, title={Lightweight Unsupervised Video Anomaly Detection Framework for UAVs Based on Multiscale Feature Extraction and Feature Reconstruction}, journal={Aerospace}, volume={11}, number={5}, article={393}, year={2024}, doi={10.3390/aerospace11050393}}", "BibTeX": ""}, {"BibKey": "zhou2024anomaly", "Title": "An Anomaly Detection Method for UAV Based on Wavelet Decomposition and Stacked Denoising Autoencoder", "Abstract": "This paper proposes an anomaly detection method for unmanned aerial vehicles that combines wavelet decomposition for multiscale signal analysis with a stacked denoising autoencoder to learn normal flight patterns and identify anomalies through reconstruction errors in UAV sensor data.", "Authors": "Zhou et Al", "Year": "2024", "Venue/Publisher": "Not specified", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Software/Control", "NatureOfAnomaly": "Sensor and flight behavior anomalies", "DetectionApproach": "Unsupervised anomaly detection", "Technique": "Deep Learning", "Technique_Detailed": "Wavelet decomposition + stacked denoising autoencoder (SDAE)", "DataSource": "Hybrid Datasets", "ApplicationContext": "Civilian", "EvaluationMetrics": "Detection accuracy; Reconstruction error metrics", "KeyFindings": "The hybrid wavelet–SDAE approach improves anomaly detection by capturing both frequency-domain and temporal characteristics of UAV signals, outperforming single-stage learning approaches", "Limitations": "Performance depends on wavelet choice and SDAE architecture; limited validation across UAV platforms", "DatasetAvailable": "No", "Remarks": "Hybrid signal processing and deep autoencoder method for UAV anomaly detection", "BibTeX": "@article{zhou2024anomaly,\n  title={An anomaly detection method for UAV based on wavelet decomposition and stacked denoising autoencoder},\n  author={Zhou, Shenghan and He, Zhao and Chen, Xu and Chang, Wenbing},\n  journal={Aerospace},\n  volume={11},\n  number={5},\n  pages={393},\n  year={2024},\n  publisher={MDPI}\n}"}, {"BibKey": "kim2023visual", "Title": "Visual extensions and anomaly detection in the pNEUMA experiment with a swarm of drones", "Abstract": "This paper presents pNEUMA Vision, an extended aerial dataset with imagery and vehicle annotations derived from a swarm drone experiment, and proposes novel anomaly detection techniques on visually restricted and noisy vehicle trajectory data extracted from drone footage, distinguishing between stationary and non-stationary trajectory errors.", "Authors": "Sohyeong Kim; Georg Anagnostopoulos; Emmanouil Barmpounakis; Nikolas Geroliminis", "Year": "2023", "Venue/Publisher": "Transportation Research Part C: Emerging Technologies", "DOI_or_URL": "10.1016/j.trc.2022.103966", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Operational/Policy", "NatureOfAnomaly": "Trajectory anomalies from visually restricted drone observations", "DetectionApproach": "Novel anomaly detection on denoised trajectory data and density maps", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Extended pNEUMA Vision dataset of drone video and trajectory annotations", "DataSource": "Simulation-based Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Not addressed", "KeyFindings": "Focuses on traffic/trajectory anomalies rather than system faults; limited to dataset scenarios", "Limitations": "Yes", "DatasetAvailable": "Drone swarm aerial video and trajectory anomaly detection", "Remarks": "", "BibTeX": "@article{kim2023visual,\n  title={Visual extensions and anomaly detection in the pNEUMA experiment with a swarm of drones},\n  author={Kim, Sohyeong and Anagnostopoulos, Georg and Barmpounakis, Emmanouil and Geroliminis, Nikolas},\n  journal={Transportation Research Part C: Emerging Technologies},\n  volume={147},\n  pages={103966},\n  year={2023},\n  publisher={Elsevier}\n}"}, {"BibKey": "frameworkAbnormalDroneBehavior2023", "Title": "Framework for Analyzing Abnormal Behavior of Real Drones through Simulation Parallelization", "Abstract": "This paper proposes a scalable simulation-based analysis framework for observing and characterizing abnormal drone behavior, enabling parallel execution of UAV flight scenarios to detect deviations and provide insights into anomalous actions; it discusses anomaly detection methods used in robotic systems including unmanned aerial vehicles.", "Authors": "Ahn Sung Kyu; Jung Hyelim; Ki-Woong Park", "Year": "2023", "Venue/Publisher": "Conference/Workshop (SysCore Lab)", "DOI_or_URL": "Not specified", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Abnormal behavior and anomaly characterization", "DetectionApproach": "Simulation-based anomaly observation and analysis", "Technique": "Rule-Based / Model-Based", "Technique_Detailed": "Parallel UAV simulation framework with logging and monitoring", "DataSource": "Simulation-based Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "Not specified", "KeyFindings": "The framework facilitates systematic analysis of abnormal UAV behavior by exploiting simulation and parallel evaluation but focuses more on analysis infrastructure than on a single detection model", "Limitations": "Preliminary framework; lacks empirical results on varied real hardware platforms", "DatasetAvailable": "No", "Remarks": "Simulation-based UAV anomaly analysis framework", "BibTeX": "@inproceedings{frameworkAbnormalDroneBehavior2023, author={Ahn, Sung Kyu and Jung, Hyelim and Park, Ki-Woong}, title={Framework for Analyzing Abnormal Behavior of Real Drones through Simulation Parallelization}, year={2023}}"}, {"BibKey": "yang2023explaining", "Title": "Explaining Anomalous Events in Flight Data of UAV with Deep Attention-Based Multi-Instance Learning", "Abstract": "Ensuring the safety and reliability of unmanned aerial vehicles (UAVs) has become a critical issue as they continue to advance. Analyzing anomalous events using event-based explanations is an effective approach to identifying key anomalous behaviors and mitigating potential risks. However, this task is challenging because anomalous events in flight data lack time-step labels in real-world UAV flight scenarios. To address this challenge, we propose a dual attention-based multi-instance learning (DA-DI-MIL) for pinpointing anomaly instances and automatically explaining anomalous events. Our MIL-based framework, from a weakly supervised learning perspective, treats a segment of flight data as a ‘bag' with an available label, and its time steps as ’instances' without labels. The dual attention mechanism in DA-DI-MIL combines a temporal pseudo-label, predicted by temporal attention, and sensor variable importance obtained from delta feature attention to better pinpoint anomalies from instance-level labels. We use these labels in our proposed MIL-based framework to establish the relationships between anomalous events and anomalous behaviors. We conducted extensive experiments on real UAV flight data with engine failures to demonstrate the effectiveness and robustness of our proposed method compared to existing state-of-the-art methods. DA-DI-MIL achieves near 90% in evaluation metrics with less than 5 time steps' delay of anomalous event detection and around 85% in temporal anomaly detection. Additionally, we present an illustration of both global and local interpretations in the time domain and feature space, providing comprehensive insights into anomalous events. Our proposed method has efficiently and automatically explained anomalous events in UAV flight data, contributing to high-level aviation safety and reliability.", "Authors": "J Yang, D Tang, J Yu, J Zhang, H Liu", "Year": "2023", "Venue/Publisher": "IEEE Transactions on Vehicular Technology", "DOI_or_URL": "https://doi.org/10.1109/TVT.2023.3301678", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Hardware", "NatureOfAnomaly": "Engine failure-induced anomalous events/behaviors in flight data", "DetectionApproach": "Weakly-supervised anomaly localization + event explanation via multi-instance learning", "Technique": "Deep Learning", "Technique_Detailed": "Dual-attention deep MIL (DA-DI-MIL): temporal attention pseudo-labels + delta feature attention for sensor importance", "DataSource": "Real-World Flight Data", "ApplicationContext": "Civilian", "EvaluationMetrics": "~90% overall metrics; <5 time steps detection delay; ~85% temporal anomaly detection", "KeyFindings": "DA-DI-MIL localizes anomaly instances without time-step labels and provides global/local explanations; robust on real UAV engine-failure flights", "Limitations": "Evaluated mainly on engine-failure anomalies; generalization to other fault/attack types and platforms needs further validation", "DatasetAvailable": "No", "Remarks": "Explainable weakly-supervised framework linking anomalous events to behaviors using attention-derived instance labels", "BibTeX": "@article{yang2023explaining,\n  title={Explaining anomalous events in flight data of UAV with deep attention-based multi-instance learning},\n  author={Yang, Jie and Tang, Diyin and Yu, Jinsong and Zhang, Jian and Liu, Haigang},\n  journal={IEEE Transactions on Vehicular Technology},\n  volume={73},\n  number={1},\n  pages={107--119},\n  year={2023},\n  publisher={IEEE}\n}"}, {"BibKey": "luo2024adaptive", "Title": "Adaptive machine learning for efficient anomaly detection in autonomous UAV swarm operations", "Abstract": "Unmanned Aerial Vehicles (UAVs), commonly known as drones are aircraft without a human pilot, crew, or passenger on board. An Unmanned Aerial Vehicle swarm (UAV swarm) usually consists of three or more drones and can execute complex tasks and missions. UAV and UAV Swarm have proliferated these years and have significantly impacted vari-ous fields, including military, agriculture, disaster relief, rescue supplies, and energy management. However, these advantages require enhanced safety measures to prevent group collisions, secure communication within the swarm, and detect abnormal behaviours, including sensor faults and cyber-attacks (e.g., GPS spoofing and command hijacking). This paper proposes an anomaly detection method based on Bi-LSTM with an attention mechanism to identify abnormal behaviours within a UAV swarm. The proposed method uses a supervised approach, training and validating the model with data collected and labelled from self-designed simulated UAV swarm flight experiments. These swarm flight tests include normal flights, flights in windy environments, flights with simulated cyber-attacks and fault injection. These multiple flights enable the model to learn to detect anomalies during formation missions across different conditions. Experimental results demonstrate that the anomaly detection model effectively processes time series data and learns its features from UAV swarm. The evaluation confirms that this method is a sensible solution for detecting anomalies within UAV swarm flights.", "Authors": "J Luo, A Oracevic", "Year": "2024", "Venue/Publisher": " 2024 International Symposium on Networks, Computers and Communications (ISNCC)", "DOI_or_URL": "https://doi.org/10.1109/ISNCC62547.2024.10758945", "VerificationStatus": "Verified", "Pillar": "Detection", "SourceOfAnomaly": "Communication", "NatureOfAnomaly": "Swarm flight anomalies incl. sensor faults, cyber-attacks (GPS spoofing/command hijacking), and wind disturbances", "DetectionApproach": "Supervised time-series anomaly detection for UAV swarms using attention-based sequence modeling", "Technique": "Deep Learning", "Technique_Detailed": "Bi-LSTM with attention mechanism trained on labeled simulated swarm flight experiments (normal/windy/fault injection/cyber-attacks)", "DataSource": "Simulation-based Data", "ApplicationContext": "Swarm", "EvaluationMetrics": "Not specified (reported effective detection on time-series swarm data)", "KeyFindings": "Bi-LSTM+attention learns swarm telemetry patterns across varied simulated conditions and detects abnormal behaviors during formation missions", "Limitations": "Trained/evaluated on self-designed simulations; real-world swarm validation and broader fault/attack coverage are needed", "DatasetAvailable": "No", "Remarks": "Deep learning anomaly detection for autonomous UAV swarm operations under injected faults and cyber-attacks", "BibTeX": "@inproceedings{luo2024adaptive,\n  title={Adaptive machine learning for efficient anomaly detection in autonomous uavs swarm operations},\n  author={Luo, Jiaze and Oracevic, Alma},\n  booktitle={2024 International Symposium on Networks, Computers and Communications (ISNCC)},\n  pages={1--8},\n  year={2024},\n  organization={IEEE}\n}"}], "facets": [{"key": "Pillar", "label": "Pillar"}, {"key": "Technique", "label": "Technique"}, {"key": "DataSource", "label": "Data source"}, {"key": "ApplicationContext", "label": "Application context"}, {"key": "DatasetAvailable", "label": "Dataset available"}, {"key": "SourceOfAnomaly", "label": "Source of anomaly"}, {"key": "NatureOfAnomaly", "label": "Nature of anomaly"}, {"key": "DetectionApproach", "label": "Detection approach"}]}